rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#ifndef AON_REG_H
#define AON_REG_H
#include <stdint.h>

/* ================================================================================ */
/* ================                AON Register               ================ */
/* ===========     Reference: RL7019_SYSON_auto_gen_table_20251107A.xlsx
                          RL7019_SYSON_replace_fw_general_20250926A.xlsx  =========== */
/* ================================================================================ */
#define AON_REG_SYSTEM_REG0X                        0x0
#define AON_REG_SYSTEM_REG1X                        0x4
#define AON_REG_SYSTEM_REG2X                        0x8
#define AON_REG_SYSTEM_REG3X                        0xC
#define AON_REG_SYSTEM_REG4X                        0x10
#define AON_REG_SYSTEM_REG5X                        0x14
#define AON_REG_SYSTEM_REG6X                        0x18
#define AON_REG_SYSTEM_REG7X                        0x1C
#define AON_REG_SYSTEM_REG8X                        0x20
#define AON_REG_SYSTEM_REG9X                        0x24
#define AON_REG_SYSTEM_REG10X                       0x28
#define AON_REG_SYSTEM_REG11X                       0x2C
#define AON_REG_SYSTEM_REG12X                       0x30
#define AON_REG_SYSTEM_REG13X                       0x34
#define AON_REG_SYSTEM_REG14X                       0x38
#define AON_REG_SYSTEM_REG15X                       0x3C
#define AON_REG_SYSTEM_REG16X                       0x40
#define AON_REG_SYSTEM_REG17X                       0x44
#define AON_REG_SYSTEM_REG18X                       0x48
#define AON_REG_SYSTEM_REG19X                       0x4C
#define AON_REG_SYSTEM_REG20X                       0x50
#define AON_REG_SYSTEM_REG21X                       0x54
#define AON_REG_SYSTEM_REG22X                       0x58
#define AON_REG_SYSTEM_REG23X                       0x5C
#define AON_REG_SYSTEM_REG24X                       0x60
#define AON_REG_SYSTEM_REG25X                       0x64
#define AON_REG_SYSTEM_REG26X                       0x68
#define AON_REG_SYSTEM_REG27X                       0x6C
#define AON_REG_SYSTEM_REG28X                       0x70
#define AON_REG_SYSTEM_REG29X                       0x74
#define AON_REG_SYSTEM_REG30X                       0x78
#define AON_REG_SYSTEM_REG31X                       0x7C
#define AON_REG_SYSTEM_REG32X                       0x80
#define AON_REG_SYSTEM_REG33X                       0x84
#define AON_REG_SYSTEM_REG34X                       0x88
#define AON_REG_SYSTEM_REG35X                       0x8C
#define AON_REG_SYSTEM_REG36X                       0x90
#define AON_REG_SYSTEM_REG37X                       0x94
#define AON_REG_SYSTEM_REG38X                       0x98
#define AON_REG_FW_GENERAL_REG0X                    0xC0
#define AON_REG_FW_GENERAL_REG1X                    0xC4
#define AON_REG_FW_GENERAL_REG2X                    0xC8
#define AON_REG_FW_GENERAL_REG3X                    0xCC
#define AON_REG_FW_GENERAL_REG4X                    0xD0
#define AON_REG_FW_GENERAL_REG5X                    0xD4
#define AON_REG_FW_GENERAL_REG6X                    0xD8
#define AON_REG_DEBUG_AUTHENTICATION0               0xDC
#define AON_REG_DEBUG_AUTHENTICATION1               0xE0
#define AON_REG_DEBUG_AUTHENTICATION2               0xE4
#define AON_REG_DEBUG_AUTHENTICATION3               0xE8
#define AON_REG_FW_GENERAL_REG11X                   0xEC
#define AON_REG_FW_GENERAL_REG12X                   0xF0
#define AON_REG_FW_GENERAL_REG13X                   0xF4
#define AON_REG_FW_GENERAL_REG14X                   0xF8
#define AON_REG_FW_GENERAL_REG15X                   0xFC
#define AON_REG_FW_GENERAL_REG16X                   0x100
#define AON_REG_FW_GENERAL_REG17X                   0x104
#define AON_REG_PAD_REG0X                           0x120
#define AON_REG_PAD_REG1X                           0x124
#define AON_REG_PAD_REG2X                           0x128
#define AON_REG_PAD_REG3X                           0x12C
#define AON_REG_PAD_REG4X                           0x130
#define AON_REG_PAD_REG5X                           0x134
#define AON_REG_PAD_REG6X                           0x138
#define AON_REG_PAD_REG7X                           0x13C
#define AON_REG_PAD_REG8X                           0x140
#define AON_REG_PAD_REG9X                           0x144
#define AON_REG_PAD_REG10X                          0x148
#define AON_REG_PAD_REG11X                          0x14C
#define AON_REG_PAD_REG12X                          0x150
#define AON_REG_PAD_REG13X                          0x154
#define AON_REG_PAD_REG14X                          0x158
#define AON_REG_PAD_REG15X                          0x15C
#define AON_REG_PAD_REG16X                          0x160
#define AON_REG_PAD_REG17X                          0x164
#define AON_REG_PAD_REG18X                          0x168
#define AON_REG_PAD_REG19X                          0x16C
#define AON_REG_PAD_REG20X                          0x170
#define AON_REG_PAD_REG21X                          0x174
#define AON_REG_PAD_REG22X                          0x178
#define AON_REG_PAD_REG23X                          0x17C
#define AON_REG_PAD_REG24X                          0x180
#define AON_REG_PAD_REG25X                          0x184
#define AON_REG_PAD_REG26X                          0x188
#define AON_REG_PAD_REG27X                          0x18C
#define AON_REG_PAD_REG28X                          0x190
#define AON_REG_PAD_REG29X                          0x194
#define AON_REG_SPI_PAD_REG30X                      0x198
#define AON_REG_PAD_REG31X                          0x19C
#define AON_REG_PAD_REG32X                          0x1A0
#define AON_REG_PAD_REG33X                          0x1A4
#define AON_REG_PAD_REG34X                          0x1A8
#define AON_REG_PAD_VPON_REG0X                      0x1C4
#define AON_REG_PAD_VPON_REG1X                      0x1C8
#define AON_REG_PAD_VPON_REG2X                      0x1CC
#define AON_REG_WDT_REG0X                           0x400
#define AON_REG_WDT_REG1X                           0x404
#define AON_REG_WDT_REG2X                           0x408
#define AON_REG_WDT_REG3X                           0x40C
#define AON_REG_WDT_REG4X                           0x410
#define AON_REG_WDT_REG5X                           0x414
#define AON_REG_WDT_REG6X                           0x418
#define AON_REG_WDT_REG7X                           0x41C
#define AON_REG_WDT_REG8X                           0x420
#define AON_REG_WDT_REG9X                           0x424
#define AON_REG_WDT_REG10X                          0x428
#define AON_REG_WDT_REG11X                          0x42C
#define AON_REG_WDT_REG12X                          0x430
#define AON_REG_WDT_REG13X                          0x434
#define AON_REG_WDT_REG14X                          0x438
#define AON_REG_WDT_REG15X                          0x43C
#define AON_REG_WDT_REG16X                          0x440
#define AON_REG_WDT_REG17X                          0x444
#define AON_REG_WDT_REG18X                          0x448
#define AON_REG_WDT_REG19X                          0x44C
#define AON_REG_WDT_REG20X                          0x450
#define AON_REG_IO_WDT_REG0X                        0x458
#define AON_REG_IO_WDT_REG1X                        0x45C
#define AON_REG_SHIP_DPD_REG0X                      0x464
#define AON_C_KOUT0X_DPD                            0x468
#define AON_REG_MBIAS_REG0X                         0x488
#define AON_REG_MBIAS_REG1X                         0x48C
#define AON_REG_MBIAS_REG2X                         0x490
#define AON_REG_MBIAS_REG3X                         0x494
#define AON_C_KOUT0X_MBIAS                          0x498
#define AON_C_KOUT1X_MBIAS                          0x49C
#define AON_REG0X_OSC10M                            0x4BC
#define AON_REG2X_OSC10M                            0x4C0
#define AON_REG0X_OSC128K                           0x4C4
#define AON_REG_POW_OSC                             0x4C8
#define AON_C_KOUT0X_OSC128K10M                     0x4CC
#define AON_REG0X_OSC128K_CAL                       0x500
#define AON_REG2X_OSC128K_CAL                       0x504
#define AON_REG4X_OSC128K_CAL                       0x508
#define AON_REG6X_OSC128K_CAL                       0x50C
#define AON_REG8X_OSC128K_CAL                       0x510
#define AON_REG10X_OSC128K_CAL                      0x514
#define AON_REG12X_OSC128K_CAL                      0x518
#define AON_REG14X_OSC128K_CAL                      0x51C
#define AON_REG16X_OSC128K_CAL                      0x520
#define AON_REG18X_OSC128K_CAL                      0x524
#define AON_REG20X_OSC128K_CAL                      0x528
#define AON_REG22X_OSC128K_CAL                      0x52C
#define AON_REG24X_OSC128K_CAL                      0x530
#define AON_REG26X_OSC128K_CAL                      0x534
#define AON_REG28X_OSC128K_CAL                      0x538
#define AON_REG30X_OSC128K_CAL                      0x53C
#define AON_REG32X_OSC128K_CAL                      0x540
#define AON_REG34X_OSC128K_CAL                      0x544
#define AON_REG36X_OSC128K_CAL                      0x548
#define AON_REG38X_OSC128K_CAL                      0x54C
#define AON_REG_OSC128K_CAL_RAP                     0x550
#define AON_REG_OSC128K_CAL_QCH                     0x554
#define AON_REG_40MXTAL_AON_REG0X                   0x600
#define AON_ANAPAR_XTAL_MODE                        0x610
#define AON_ANAPAR_XTAL0                            0x614
#define AON_ANAPAR_XTAL2                            0x618
#define AON_ANAPAR_XTAL4                            0x61C
#define AON_ANAPAR_XTAL6                            0x620
#define AON_ANAPAR_XTAL8                            0x624
#define AON_ANAPAR_XTAL10                           0x628
#define AON_ANAPAR_XTAL12                           0x62C
#define AON_ANAPAR_XTAL14                           0x630
#define AON_REG0X_OSC80M                            0x650
#define AON_REG2X_OSC80M                            0x654
#define AON_C_KOUT0X_OSC80M                         0x658
#define AON_REG_SIMO_REG0X                          0x674
#define AON_REG_SIMO_REG1X                          0x678
#define AON_REG_SIMO_REG2X                          0x684
#define AON_REG_SIMO_REG3X                          0x688
#define AON_REG_SIMO_REG4X                          0x68C
#define AON_REG_SIMO_REG5X                          0x690
#define AON_REG_SIMO_REG6X                          0x694
#define AON_REG_SIMO_REG7X                          0x698
#define AON_REG_SIMO_REG8X                          0x69C
#define AON_REG_SIMO_REG9X                          0x6A0
#define AON_C_KOUT0X_SIMO                           0x6A4
#define AON_C_KOUT1X_SIMO                           0x6A8
#define AON_C_KOUT2X_SIMO                           0x6AC
#define AON_REG_LDO_ANA_REG0X                       0x6D4
#define AON_REG_LDO_PA_REG0X                        0x6E4
#define AON_REG0X_PLL1                              0x6F4
#define AON_REG2X_PLL1                              0x6F8
#define AON_C_KOUT0X_PLL1                           0x6FC
#define AON_REG0X_PLL1_LDO                          0x708
#define AON_REG_TMETER_DATA_0                       0x728
#define AON_REG_TMETER_DATA_1                       0x72C
#define AON_REG_TMETER_DATA_2                       0x730
#define AON_REG_TMETER_CTRL1                        0x738
#define AON_REG_TMETER_COMP_CTRL                    0x73C
#define AON_REG_TMETER_REL_COMP_THD0                0x740
#define AON_REG_TMETER_REL_COMP_THD1                0x744
#define AON_REG_TMETER_ABS_COMP0_VREF               0x748
#define AON_REG_TMETER_ABS_COMP1_VREF               0x74C
#define AON_REG_TMETER_ABS_COMP2_VREF               0x750
#define AON_REG_TMETER_ABS_COMP3_VREF               0x754
#define AON_REG_TMETER_ANALOG_CTRL                  0x758
#define AON_REG_TMETER_MAPPING                      0x75C
#define AON_REG_RTC_CR0                             0x768
#define AON_REG_RTC_INT_clear                       0x76C
#define AON_REG_RTC_INT_SR                          0x770
#define AON_REG_RTC_PRESCALER                       0x774
#define AON_REG_RTC_COMP_0                          0x778
#define AON_REG_RTC_COMP_1                          0x77C
#define AON_REG_RTC_COMP_2                          0x780
#define AON_REG_RTC_COMP_3                          0x784
#define AON_REG_RTC_CNT0                            0x788
#define AON_REG_RTC_PRESCALE_CNT0                   0x78C
#define AON_REG_RTC_PRESCALE_CMP0                   0x790
#define AON_REG_RTC_BACKUP                          0x794
#define AON_REG_RTC_RTL_VERSION0                    0x798
#define AON_REG_RTC_RELOAD_CTRL                     0x79C
#define AON_REG_RTC_COMP_0_RELOAD                   0x7A0
#define AON_REG_RTC_COMP_1_RELOAD                   0x7A4
#define AON_REG_RTC_COMP_2_RELOAD                   0x7A8
#define AON_REG_RTC_COMP_3_RELOAD                   0x7AC
#define AON_REG_RTC_TASK_CTRL                       0x7B0
#define AON_REG_RTC_SHOT_CTRL                       0x7B4
#define AON_REG_RTC_QACTIVE_CTRL                    0x7B8
#define AON_REG_LPC_VERSION                         0x7C0
#define AON_REG_LPC_CR0                             0x7C4
#define AON_REG_LPC_SR                              0x7C8
#define AON_REG_LPC_CMP                             0x7CC
#define AON_REG_LPC_CNT                             0x7D0
#define AON_REG_LPC_TASK_CTRL                       0x7D4
#define AON_REG_LPC_SHOT_CTRL                       0x7D8
#define AON_REG_LPC_QACTIVE_CTRL                    0x7DC
#define AON_REG0X_SD                                0x7E0
#define AON_REG_LPQDEC_X_DIV                        0x7E4
#define AON_REG_LPQDEC_X_CONFIG                     0x7E8
#define AON_REG_LPQDEC_X_SR_1                       0x7EC
#define AON_REG_LPQDEC_X_SR_2                       0x7F0
#define AON_REG_LPQDEC_X_INT_CLR                    0x7F4
#define AON_REG_LPQDEC_X_VERSION                    0x7F8
#define AON_REG_LPQDEC_X_LED_CTRL                   0x7FC
#define AON_REG_LPQDEC_X_QACTIVE_CTRL               0x800
#define AON_REG_LPPWM_CH0_CTL                       0x80C
#define AON_REG_LPPWM_CH0_P0_H                      0x810
#define AON_REG_LPPWM_CH0_P0_L                      0x814
#define AON_REG_LPPWM_CH0_CURRENT                   0x818
#define AON_REG_LPPWM_VERSION                       0x81C
#define AON_REG_LPPWM_QACTIVE_MANUAL_CTRL           0x820
#define AON_REG_SRAM_CTRL0                          0x828
#define AON_REG_SRAM_CTRL1                          0x82C
#define AON_REG_SRAM_CTRL2                          0x830
#define AON_REG_SRAM_CTRL3                          0x834
#define AON_REG_SRAM_CTRL4                          0x838
#define AON_REG_SRAM_CTRL5                          0x83C
#define AON_REG_SRAM_CTRL6                          0x840
#define AON_REG_SRAM_CTRL7                          0x844
#define AON_REG_SRAM_CTRL8                          0x848
#define AON_REG_SRAM_CTRL9                          0x84C
#define AON_REG_SRAM_CTRL10                         0x850
#define AON_REG_SRAM_CTRL11                         0x854
#define AON_REG_SRAM_CTRL12                         0x858
#define AON_REG_SRAM_CTRL13                         0x85C
#define AON_REG_SRAM_CTRL14                         0x860
#define AON_REG_SRAM_CTRL15                         0x864
#define AON_REG_SRAM_CTRL16                         0x868
#define AON_REG_SRAM_CTRL17                         0x86C
#define AON_REG_SRAM_CTRL18                         0x870
#define AON_REG_SRAM_CTRL19                         0x874
#define AON_REG_SRAM_CTRL20                         0x878
#define AON_REG_SRAM_CTRL21                         0x87C
#define AON_REG_SRAM_CTRL22                         0x880
#define AON_REG_SRAM_CTRL23                         0x884
#define AON_REG_SRAM_CTRL24                         0x888
#define AON_REG_SRAM_CTRL25                         0x88C
#define AON_REG_SRAM_CTRL27                         0x890
#define AON_REG_SRAM_CTRL28                         0x894
#define AON_REG_SRAM_CTRL29                         0x898
#define AON_REG_SRAM_CTRL30                         0x89C
#define AON_REG_SRAM_CTRL31                         0x8A0
#define AON_REG_SRAM_CTRL32                         0x8A4
#define AON_REG_SRAM_CTRL33                         0x8A8
#define AON_REG_SRAM_CTRL34                         0x8AC
#define AON_REG_SRAM_CTRL35                         0x8B0
#define AON_REG_PCK600_AON_REG0X                    0x8B4
#define AON_REG_PCK600_AON_REG1X                    0x8B8
#define AON_REG_PCK600_AON_REG2X                    0x8BC
#define AON_REG_PCK600_AON_REG3X                    0x8C0
#define AON_REG_PCK600_AON_REG4X                    0x8C4
#define AON_REG_PCK600_AON_REG5X                    0x8C8
#define AON_REG_PCK600_VPON_REG0X                   0x8CC
#define AON_REG_PCK600_VPON_REG1X                   0x8D0
#define AON_REG_PCK600_VPON_REG2X                   0x8D4
#define AON_REG_PCK600_VPON_REG3X                   0x8D8
#define AON_REG_PCK600_VPON_REG4X                   0x8DC
#define AON_REG_PCK600_VPON_REG5X                   0x8E0
#define AON_REG_PCK600_VPON_REG6X                   0x8E4
#define AON_BT_ANAPAR_LDO_ADDA                      0x718
#define AON_REG_BT_ANAPAR_LDO_IQMDA                 0x71C
#define AON_BT_TPMK_ADC_LDO                         0x720
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1   0x9A4
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2   0x9A8
#define AON_LOP_PON_PPU_VPON_PCSM_1                 0x9AC
#define AON_LOP_PON_PPU_VPON_PCSM_2                 0x9B0
#define AON_LOP_PON_PPU_VPON_PCSM_3                 0x9B4
#define AON_LOP_PON_PPU_VPON_PCSM_4                 0x9B8
#define AON_LOP_PON_PPU_VPON_PCSM_5                 0x9BC
#define AON_LOP_PON_PPU_VPON_PCSM_6                 0x9C0
#define AON_LOP_PON_PPU_VPON_PCSM_7                 0x9C4
#define AON_LOP_PON_PPU_VPON_PCSM_8                 0x9C8
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1          0x9CC
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2          0x9D0
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1   0xA30
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2   0xA34
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1             0xA38
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2             0xA3C
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3             0xA40
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_4             0xA44
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_1         0xA48
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_2         0xA4C
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3         0xA50
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4         0xA54
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_1        0xA58
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2        0xA5C
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3        0xA60
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4        0xA64
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5        0xA68
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY             0xA6C
#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY        0xA70
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2           0xA74
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1          0xA78
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2          0xA7C
#define AON_LOP_PON_VPON_40MXTAL_PCSM               0xB18
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1  0xB14
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_2  0xB10
#define AON_LOP_PON_PPUVCORE1_PCSM_1                0xB0C
#define AON_LOP_PON_PPUVCORE1_PCSM_2                0xB08
#define AON_LOP_PON_PPUVCORE1_PCSM_3                0xB04
#define AON_LOP_PON_PPUVCORE1_PCSM_4                0xB00
#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1          0xAFC
#define AON_LOP_POF_VPON_40MXTAL_PCSM               0xC08
#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1  0xC04
#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_2  0xC00
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1           0xBFC
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2           0xBF8
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3           0xBF4
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_4           0xBF0
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_1      0xBEC
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_2      0xBE8
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3      0xBE4
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4      0xBE0
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1      0xBDC
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_2      0xBD8
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_3      0xBD4
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_4      0xBD0
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_DELAY_1     0xBCC
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1          0xC2C
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2          0xC28
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_1          0xC44
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2          0xC40
#define AON_REG_SCH_PLN_RSTB                        0xC60
#define AON_REG_SCH_PLN_TREE0_ROOT_ACT_TIME         0xC64
#define AON_REG_SCH_PLN_TREE1_ROOT_ACT_TIME         0xC68
#define AON_REG_SCH_PLN_TREE_ACT_CLEAR              0xC6C
#define AON_REG_SCH_PLN_MANUAL_TRIGGER              0xC70
#define AON_REG_SCH_PLN_INTR_CTRL                   0xC74
#define AON_REG_SCH_PLN_INTR_STATUS                 0xC78
#define AON_REG_SCH_PLN_INTR_CLEAR                  0xC7C
#define AON_REG_SCH_PLN_NODE_DISABLE                0xC80
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS    0xC84
#define AON_REG_SCH_PLN_CMPNT0_DELAY_PON            0xC88
#define AON_REG_SCH_PLN_CMPNT0_DELAY_POF            0xC8C
#define AON_REG_SCH_PLN_CMPNT1_DELAY_PON            0xC90
#define AON_REG_SCH_PLN_CMPNT1_DELAY_POF            0xC94
#define AON_REG_SCH_PLN_CMPNT2_DELAY_PON            0xC98
#define AON_REG_SCH_PLN_CMPNT2_DELAY_POF            0xC9C
#define AON_REG_SCH_PLN_CMPNT3_DELAY_PON            0xCA0
#define AON_REG_SCH_PLN_CMPNT3_DELAY_POF            0xCA4
#define AON_REG_SCH_PLN_CMPNT4_DELAY_PON            0xCA8
#define AON_REG_SCH_PLN_CMPNT4_DELAY_POF            0xCAC
#define AON_REG_SCH_PLN_CMPNT5_DELAY_PON            0xCB0
#define AON_REG_SCH_PLN_CMPNT5_DELAY_POF            0xCB4
#define AON_REG_SCH_PLN_CMPNT6_DELAY_PON            0xCB8
#define AON_REG_SCH_PLN_CMPNT6_DELAY_POF            0xCBC
#define AON_REG_SCH_PLN_CMPNT7_DELAY_PON            0xCC0
#define AON_REG_SCH_PLN_CMPNT7_DELAY_POF            0xCC4
#define AON_REG_SCH_PLN_CMPNT8_DELAY_PON            0xCC8
#define AON_REG_SCH_PLN_CMPNT8_DELAY_POF            0xCCC
#define AON_REG_SCH_PLN_CMPNT9_DELAY_PON            0xCD0
#define AON_REG_SCH_PLN_CMPNT9_DELAY_POF            0xCD4
#define AON_REG_SCH_PLN_QACTIVE_CTRL                0xCD8
#define AON_REG_SCH_PLN_VERSION                     0xCDC
#define AON_REG_SCH_PLN_TREE0_ROOT_CHECK_TIME       0xCE0
#define AON_REG_SCH_PLN_TREE1_ROOT_CHECK_TIME       0xCE4
#define AON_REG_GTC_CTRL                            0xCF0
#define AON_REG_GTC_CNT                             0xCF4
#define AON_REG_GTC_VERSION                         0xCF8
#define AON_REG_GRTC_CTRL                           0xD04
#define AON_REG_GRTC_INTR_CTRL                      0xD08
#define AON_REG_GRTC_COMP_INTR_SR                   0xD0C
#define AON_REG_GRTC_COMP_INT_CLR                   0xD10
#define AON_REG_GRTC_COMP_0                         0xD14
#define AON_REG_GRTC_COMP_1                         0xD18
#define AON_REG_GRTC_COMP_2                         0xD1C
#define AON_REG_GRTC_COMP_3                         0xD20
#define AON_REG_GRTC_COMP_4                         0xD24
#define AON_REG_GRTC_COMP_5                         0xD28
#define AON_REG_GRTC_COMP_6                         0xD2C
#define AON_REG_GRTC_COMP_7                         0xD30
#define AON_REG_GRTC_RELOAD_CTRL                    0xD34
#define AON_REG_GRTC_COMP_0_RELOAD                  0xD38
#define AON_REG_GRTC_COMP_1_RELOAD                  0xD3C
#define AON_REG_GRTC_COMP_2_RELOAD                  0xD40
