rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_GRTC_COMP_3_RELOAD                  0xD44
#define AON_REG_GRTC_COMP_4_RELOAD                  0xD48
#define AON_REG_GRTC_COMP_5_RELOAD                  0xD4C
#define AON_REG_GRTC_COMP_6_RELOAD                  0xD50
#define AON_REG_GRTC_COMP_7_RELOAD                  0xD54
#define AON_REG_GRTC_SLEEP_CTRL                     0xD58
#define AON_REG_GRTC_COMP_0_SLEEP_PENDING_CNT       0xD5C
#define AON_REG_GRTC_COMP_1_SLEEP_PENDING_CNT       0xD60
#define AON_REG_GRTC_COMP_2_SLEEP_PENDING_CNT       0xD64
#define AON_REG_GRTC_COMP_3_SLEEP_PENDING_CNT       0xD68
#define AON_REG_GRTC_COMP_4_SLEEP_PENDING_CNT       0xD6C
#define AON_REG_GRTC_COMP_5_SLEEP_PENDING_CNT       0xD70
#define AON_REG_GRTC_COMP_6_SLEEP_PENDING_CNT       0xD74
#define AON_REG_GRTC_COMP_7_SLEEP_PENDING_CNT       0xD78
#define AON_REG_GRTC_TASK_CTRL                      0xD7C
#define AON_REG_GRTC_QACTIVE_CTRL                   0xD80
#define AON_REG_GRTC_RTL_VERSION                    0xD84
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR         0xD88
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR        0xD8C
#define AON_REG0X_OSC80M_CAL                        0xDB4
#define AON_REG2X_OSC80M_CAL                        0xDB8
#define AON_REG4X_OSC80M_CAL                        0xDBC
#define AON_REG6X_OSC80M_CAL                        0xDC0
#define AON_REG8X_OSC80M_CAL                        0xDC4
#define AON_REG10X_OSC80M_CAL                       0xDC8
#define AON_REG_OSC80M_CAL_RAP                      0xDCC
#define AON_REG_OSC80M_CAL_QCH                      0xDD0
#define AON_REG0X_OSC10M_CAL                        0xDF0
#define AON_REG2X_OSC10M_CAL                        0xDF4
#define AON_REG4X_OSC10M_CAL                        0xDF8
#define AON_REG6X_OSC10M_CAL                        0xDFC
#define AON_REG8X_OSC10M_CAL                        0xE00
#define AON_REG10X_OSC10M_CAL                       0xE04
#define AON_REG_OSC10M_CAL_RAP                      0xE08
#define AON_REG_OSC10M_CAL_QCH                      0xE0C
#define AON_REG_DEB_MUX_SEL                         0xE2C
#define AON_REG_DEB_CNT_1_0                         0xE30
#define AON_REG_DEB_CNT_3_2                         0xE34
#define AON_REG_DEB_CNT_4                           0xE38
#define AON_REG_DEB_STS                             0xE3C
#define AON_REG_PAD_AUTO_SW_AON_REG0X               0xE90
#define AON_REG_PAD_AUTO_SW_AON_REG1X               0xE94
#define AON_REG_PAD_AUTO_SW_AON_REG2X               0xE98
#define AON_REG_PAD_AUTO_SW_AON_REG3X               0xE9C
#define AON_REG_PAD_AUTO_SW_AON_REG4X               0xEA0
#define AON_REG_PAD_AUTO_SW_AON_REG5X               0xEA4
#define AON_REG_PAD_AUTO_SW_AON_REG6X               0xEA8
#define AON_REG_PAD_AUTO_SW_AON_REG7X               0xEAC
#define AON_REG_PAD_AUTO_SW_AON_REG8X               0xEB0
#define AON_REG_PAD_AUTO_SW_AON_REG9X               0xEB4
#define AON_REG_PAD_AUTO_SW_PON_REG0X               0xEC4
#define AON_REG_PAD_AUTO_SW_PON_REG1X               0xEC8
#define AON_REG_PAD_AUTO_SW_PON_REG2X               0xECC
#define AON_REG_PAD_AUTO_SW_PON_REG3X               0xED0
#define AON_REG_PAD_AUTO_SW_PON_REG4X               0xED4
#define AON_REG_PAD_AUTO_SW_PON_REG5X               0xED8
#define AON_REG_PAD_AUTO_SW_PON_REG6X               0xEDC
#define AON_REG_PAD_AUTO_SW_PON_REG7X               0xEE0

/* 0x0      0x4000_0000
    28:0    R/W     RESERVED                                                    29'h0
    29      R/W     AON_GATED_EN                                                1'b1
    30      R/W     VCORE_PC_VG2                                                1'b1
    31      R/W     VCORE_PC_VG1                                                1'b1
 */
typedef union _AON_REG_SYSTEM_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 29;
        uint32_t AON_GATED_EN: 1;
        uint32_t VCORE_PC_VG2: 1;
        uint32_t VCORE_PC_VG1: 1;
    };
} AON_REG_SYSTEM_REG0X_TYPE;

/*0x4000_0000 AON_REG_SYSTEM_REG0X*/
#define AON_REG_SYSTEM_REG0X_RESERVED_Pos                                                                                0U
#define AON_REG_SYSTEM_REG0X_RESERVED_Msk                                                                                (0x1FFFFFFFUL << AON_REG_SYSTEM_REG0X_RESERVED_Pos)

#define AON_REG_SYSTEM_REG0X_AON_GATED_EN_Pos                                                                            29U
#define AON_REG_SYSTEM_REG0X_AON_GATED_EN_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG0X_AON_GATED_EN_Pos)

#define AON_REG_SYSTEM_REG0X_VCORE_PC_VG2_Pos                                                                            30U
#define AON_REG_SYSTEM_REG0X_VCORE_PC_VG2_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG0X_VCORE_PC_VG2_Pos)

#define AON_REG_SYSTEM_REG0X_VCORE_PC_VG1_Pos                                                                            31U
#define AON_REG_SYSTEM_REG0X_VCORE_PC_VG1_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG0X_VCORE_PC_VG1_Pos)

/* 0x4      0x4000_0004
    7:0     R/W     DEBUG_SEL                                                   8'h0
    31:8    R       RESERVED                                                    24'h0
 */
typedef union _AON_REG_SYSTEM_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEBUG_SEL: 8;
        uint32_t RESERVED: 24;
    };
} AON_REG_SYSTEM_REG1X_TYPE;

/*0x4000_0004 AON_REG_SYSTEM_REG1X*/
#define AON_REG_SYSTEM_REG1X_DEBUG_SEL_Pos                                                                               0U
#define AON_REG_SYSTEM_REG1X_DEBUG_SEL_Msk                                                                               (0xFFUL << AON_REG_SYSTEM_REG1X_DEBUG_SEL_Pos)

#define AON_REG_SYSTEM_REG1X_RESERVED_Pos                                                                                8U
#define AON_REG_SYSTEM_REG1X_RESERVED_Msk                                                                                (0xFFFFFFUL << AON_REG_SYSTEM_REG1X_RESERVED_Pos)

