rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x8      0x4000_0008
    31:0    R       RESERVED                                                    32'h0
 */
typedef union _AON_REG_SYSTEM_REG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} AON_REG_SYSTEM_REG2X_TYPE;

/*0x4000_0008 AON_REG_SYSTEM_REG2X*/
#define AON_REG_SYSTEM_REG2X_RESERVED_Pos                                                                                0U
#define AON_REG_SYSTEM_REG2X_RESERVED_Msk                                                                                (0xFFFFFFFFUL << AON_REG_SYSTEM_REG2X_RESERVED_Pos)

/* 0xC      0x4000_000c
    31:0    R       RESERVED                                                    32'h0
 */
typedef union _AON_REG_SYSTEM_REG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} AON_REG_SYSTEM_REG3X_TYPE;

/*0x4000_000c AON_REG_SYSTEM_REG3X*/
#define AON_REG_SYSTEM_REG3X_RESERVED_Pos                                                                                0U
#define AON_REG_SYSTEM_REG3X_RESERVED_Msk                                                                                (0xFFFFFFFFUL << AON_REG_SYSTEM_REG3X_RESERVED_Pos)

/* 0x10     0x4000_0010
    8:0     R/W     RESERVED                                                    9'h0
    9       W1C     MBISR2_RESTORE                                              1'b0
    10      W1C     PERIPHERAL_ALL_STORE                                        1'b0
    11      W1C     PERIPHERAL_ALL_RESTORE                                      1'b0
    12      W1C     RFC_STORE                                                   1'b0
    13      W1C     RFC_RESTORE                                                 1'b0
    14      W1C     MODEM_STORE                                                 1'b0
    15      W1C     MODEM_RESTORE                                               1'b0
    16      W1C     BZ_STORE                                                    1'b0
    17      W1C     BZ_RESTORE                                                  1'b0
    18      W1C     BLE_STORE                                                   1'b0
    19      W1C     BLE_RESTORE                                                 1'b0
    20      W1C     PF_STORE                                                    1'b0
    21      W1C     PF_RESTORE                                                  1'b0
    22      W1C     DP_MODEM_STORE                                              1'b0
    23      W1C     DP_MODEM_RESTORE                                            1'b0
    24      R       BT_CORE_RSTB                                                1'b0
    25      R       BT_PON_RSTB                                                 1'b0
    26      R       BT_RET_RSTB                                                 1'b0
    27      R/W     ISO_XTAL                                                    1'b1
    28      R       ISO_BT_CORE                                                 1'b1
    29      R       ISO_BT_PON                                                  1'b1
    30      R/W     ISO_EFLASH2VCORE                                            1'b1
    31      R/W     ISO_PLL                                                     1'b1
 */
typedef union _AON_REG_SYSTEM_REG4X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 9;
        uint32_t MBISR2_RESTORE: 1;
        uint32_t PERIPHERAL_ALL_STORE: 1;
        uint32_t PERIPHERAL_ALL_RESTORE: 1;
        uint32_t RFC_STORE: 1;
        uint32_t RFC_RESTORE: 1;
        uint32_t MODEM_STORE: 1;
        uint32_t MODEM_RESTORE: 1;
        uint32_t BZ_STORE: 1;
        uint32_t BZ_RESTORE: 1;
        uint32_t BLE_STORE: 1;
        uint32_t BLE_RESTORE: 1;
        uint32_t PF_STORE: 1;
        uint32_t PF_RESTORE: 1;
        uint32_t DP_MODEM_STORE: 1;
        uint32_t DP_MODEM_RESTORE: 1;
        uint32_t BT_CORE_RSTB: 1;
        uint32_t BT_PON_RSTB: 1;
        uint32_t BT_RET_RSTB: 1;
        uint32_t ISO_XTAL: 1;
        uint32_t ISO_BT_CORE: 1;
        uint32_t ISO_BT_PON: 1;
        uint32_t ISO_EFLASH2VCORE: 1;
        uint32_t ISO_PLL: 1;
    };
} AON_REG_SYSTEM_REG4X_TYPE;

/*0x4000_0010 AON_REG_SYSTEM_REG4X*/
#define AON_REG_SYSTEM_REG4X_RESERVED_Pos                                                                                0U
#define AON_REG_SYSTEM_REG4X_RESERVED_Msk                                                                                (0x1FFUL << AON_REG_SYSTEM_REG4X_RESERVED_Pos)

#define AON_REG_SYSTEM_REG4X_MBISR2_RESTORE_Pos                                                                          9U
#define AON_REG_SYSTEM_REG4X_MBISR2_RESTORE_Msk                                                                          (0x1UL << AON_REG_SYSTEM_REG4X_MBISR2_RESTORE_Pos)

#define AON_REG_SYSTEM_REG4X_PERIPHERAL_ALL_STORE_Pos                                                                    10U
#define AON_REG_SYSTEM_REG4X_PERIPHERAL_ALL_STORE_Msk                                                                    (0x1UL << AON_REG_SYSTEM_REG4X_PERIPHERAL_ALL_STORE_Pos)

#define AON_REG_SYSTEM_REG4X_PERIPHERAL_ALL_RESTORE_Pos                                                                  11U
#define AON_REG_SYSTEM_REG4X_PERIPHERAL_ALL_RESTORE_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG4X_PERIPHERAL_ALL_RESTORE_Pos)

#define AON_REG_SYSTEM_REG4X_RFC_STORE_Pos                                                                               12U
#define AON_REG_SYSTEM_REG4X_RFC_STORE_Msk                                                                               (0x1UL << AON_REG_SYSTEM_REG4X_RFC_STORE_Pos)

#define AON_REG_SYSTEM_REG4X_RFC_RESTORE_Pos                                                                             13U
#define AON_REG_SYSTEM_REG4X_RFC_RESTORE_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG4X_RFC_RESTORE_Pos)

#define AON_REG_SYSTEM_REG4X_MODEM_STORE_Pos                                                                             14U
#define AON_REG_SYSTEM_REG4X_MODEM_STORE_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG4X_MODEM_STORE_Pos)

#define AON_REG_SYSTEM_REG4X_MODEM_RESTORE_Pos                                                                           15U
#define AON_REG_SYSTEM_REG4X_MODEM_RESTORE_Msk                                                                           (0x1UL << AON_REG_SYSTEM_REG4X_MODEM_RESTORE_Pos)

#define AON_REG_SYSTEM_REG4X_BZ_STORE_Pos                                                                                16U
#define AON_REG_SYSTEM_REG4X_BZ_STORE_Msk                                                                                (0x1UL << AON_REG_SYSTEM_REG4X_BZ_STORE_Pos)

