rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG4X_BZ_RESTORE_Pos                                                                              17U
#define AON_REG_SYSTEM_REG4X_BZ_RESTORE_Msk                                                                              (0x1UL << AON_REG_SYSTEM_REG4X_BZ_RESTORE_Pos)

#define AON_REG_SYSTEM_REG4X_BLE_STORE_Pos                                                                               18U
#define AON_REG_SYSTEM_REG4X_BLE_STORE_Msk                                                                               (0x1UL << AON_REG_SYSTEM_REG4X_BLE_STORE_Pos)

#define AON_REG_SYSTEM_REG4X_BLE_RESTORE_Pos                                                                             19U
#define AON_REG_SYSTEM_REG4X_BLE_RESTORE_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG4X_BLE_RESTORE_Pos)

#define AON_REG_SYSTEM_REG4X_PF_STORE_Pos                                                                                20U
#define AON_REG_SYSTEM_REG4X_PF_STORE_Msk                                                                                (0x1UL << AON_REG_SYSTEM_REG4X_PF_STORE_Pos)

#define AON_REG_SYSTEM_REG4X_PF_RESTORE_Pos                                                                              21U
#define AON_REG_SYSTEM_REG4X_PF_RESTORE_Msk                                                                              (0x1UL << AON_REG_SYSTEM_REG4X_PF_RESTORE_Pos)

#define AON_REG_SYSTEM_REG4X_DP_MODEM_STORE_Pos                                                                          22U
#define AON_REG_SYSTEM_REG4X_DP_MODEM_STORE_Msk                                                                          (0x1UL << AON_REG_SYSTEM_REG4X_DP_MODEM_STORE_Pos)

#define AON_REG_SYSTEM_REG4X_DP_MODEM_RESTORE_Pos                                                                        23U
#define AON_REG_SYSTEM_REG4X_DP_MODEM_RESTORE_Msk                                                                        (0x1UL << AON_REG_SYSTEM_REG4X_DP_MODEM_RESTORE_Pos)

#define AON_REG_SYSTEM_REG4X_BT_CORE_RSTB_Pos                                                                            24U
#define AON_REG_SYSTEM_REG4X_BT_CORE_RSTB_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG4X_BT_CORE_RSTB_Pos)

#define AON_REG_SYSTEM_REG4X_BT_PON_RSTB_Pos                                                                             25U
#define AON_REG_SYSTEM_REG4X_BT_PON_RSTB_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG4X_BT_PON_RSTB_Pos)

#define AON_REG_SYSTEM_REG4X_BT_RET_RSTB_Pos                                                                             26U
#define AON_REG_SYSTEM_REG4X_BT_RET_RSTB_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG4X_BT_RET_RSTB_Pos)

#define AON_REG_SYSTEM_REG4X_ISO_XTAL_Pos                                                                                27U
#define AON_REG_SYSTEM_REG4X_ISO_XTAL_Msk                                                                                (0x1UL << AON_REG_SYSTEM_REG4X_ISO_XTAL_Pos)

#define AON_REG_SYSTEM_REG4X_ISO_BT_CORE_Pos                                                                             28U
#define AON_REG_SYSTEM_REG4X_ISO_BT_CORE_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG4X_ISO_BT_CORE_Pos)

#define AON_REG_SYSTEM_REG4X_ISO_BT_PON_Pos                                                                              29U
#define AON_REG_SYSTEM_REG4X_ISO_BT_PON_Msk                                                                              (0x1UL << AON_REG_SYSTEM_REG4X_ISO_BT_PON_Pos)

#define AON_REG_SYSTEM_REG4X_ISO_EFLASH2VCORE_Pos                                                                        30U
#define AON_REG_SYSTEM_REG4X_ISO_EFLASH2VCORE_Msk                                                                        (0x1UL << AON_REG_SYSTEM_REG4X_ISO_EFLASH2VCORE_Pos)

#define AON_REG_SYSTEM_REG4X_ISO_PLL_Pos                                                                                 31U
#define AON_REG_SYSTEM_REG4X_ISO_PLL_Msk                                                                                 (0x1UL << AON_REG_SYSTEM_REG4X_ISO_PLL_Pos)

/* 0x14     0x4000_0014
    0       R/W     FW_ENTER_LPS                                                1'b0
    1       R/W     FW_PON_SEQ_RST_N                                            1'b0
    19:2    R/W     RESERVED_1                                                  18'h0
    20      W1C     DMAC_STORE                                                  1'b0
    21      W1C     DMAC_RESTORE                                                1'b0
    22      W1C     CM33_STORE                                                  1'b0
    23      W1C     CM33_RESTORE                                                1'b0
    31:24   R/W     RESERVED                                                    8'h0
 */
typedef union _AON_REG_SYSTEM_REG5X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_ENTER_LPS: 1;
        uint32_t FW_PON_SEQ_RST_N: 1;
        uint32_t RESERVED_1: 18;
        uint32_t DMAC_STORE: 1;
        uint32_t DMAC_RESTORE: 1;
        uint32_t CM33_STORE: 1;
        uint32_t CM33_RESTORE: 1;
        uint32_t RESERVED: 8;
    };
} AON_REG_SYSTEM_REG5X_TYPE;

/*0x4000_0014 AON_REG_SYSTEM_REG5X*/
#define AON_REG_SYSTEM_REG5X_FW_ENTER_LPS_Pos                                                                            0U
#define AON_REG_SYSTEM_REG5X_FW_ENTER_LPS_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG5X_FW_ENTER_LPS_Pos)

#define AON_REG_SYSTEM_REG5X_FW_PON_SEQ_RST_N_Pos                                                                        1U
#define AON_REG_SYSTEM_REG5X_FW_PON_SEQ_RST_N_Msk                                                                        (0x1UL << AON_REG_SYSTEM_REG5X_FW_PON_SEQ_RST_N_Pos)

#define AON_REG_SYSTEM_REG5X_RESERVED_1_Pos                                                                              2U
#define AON_REG_SYSTEM_REG5X_RESERVED_1_Msk                                                                              (0x3FFFFUL << AON_REG_SYSTEM_REG5X_RESERVED_1_Pos)

#define AON_REG_SYSTEM_REG5X_DMAC_STORE_Pos                                                                              20U
#define AON_REG_SYSTEM_REG5X_DMAC_STORE_Msk                                                                              (0x1UL << AON_REG_SYSTEM_REG5X_DMAC_STORE_Pos)

