rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG5X_DMAC_RESTORE_Pos                                                                            21U
#define AON_REG_SYSTEM_REG5X_DMAC_RESTORE_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG5X_DMAC_RESTORE_Pos)

#define AON_REG_SYSTEM_REG5X_CM33_STORE_Pos                                                                              22U
#define AON_REG_SYSTEM_REG5X_CM33_STORE_Msk                                                                              (0x1UL << AON_REG_SYSTEM_REG5X_CM33_STORE_Pos)

#define AON_REG_SYSTEM_REG5X_CM33_RESTORE_Pos                                                                            23U
#define AON_REG_SYSTEM_REG5X_CM33_RESTORE_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG5X_CM33_RESTORE_Pos)

#define AON_REG_SYSTEM_REG5X_RESERVED_Pos                                                                                24U
#define AON_REG_SYSTEM_REG5X_RESERVED_Msk                                                                                (0xFFUL << AON_REG_SYSTEM_REG5X_RESERVED_Pos)

/* 0x18     0x4000_0018
    0       W1C     MBISR_STORE                                                 1'b0
    1       W1C     MBISR_RESTORE                                               1'b0
    2       W1C     VENDOR_STORE                                                1'b0
    3       W1C     VENDOR_RESTORE                                              1'b0
    4       W1C     SYSON_STORE                                                 1'b0
    5       W1C     SYSON_RESTORE                                               1'b0
    6       W1C     EFLASH_STORE                                                1'b0
    7       W1C     EFLASH_RESTORE                                              1'b0
    13:8    R/W     RESERVED_1                                                  6'h0
    14      R/W     WAIT_OK_80M                                                 1'b0
    15      R/W     WAIT_CP_DIS_OUT                                             1'b0
    16      R/W     WAIT_XTAL_CLK_OK                                            1'b0
    17      R/W     WAIT_PLL1_READY                                             1'b0
    18      R/W     WAIT_VDDCORE_DET_READY                                      1'b0
    19      R/W     WAIT_VANA_DET_READY                                         1'b0
    20      R/W     WAIT_VDDANA_DET_READY                                       1'b0
    21      R/W     WAIT_VDDPA_DET_READY                                        1'b0
    22      R/W     WAIT_HV18_DET_READY                                         1'b0
    23      R/W     RESERVED                                                    1'b0
    24      R/W     WAIT_32KOSC_CLK_OK                                          1'b0
    25      R/W     WAIT_10MOSC_CLK_OK                                          1'b0
    26      R/W     LDO_ANA_POS_EN_DR_FIX                                       1'b0
    27      R/W     LDO_PA_POS_EN_DR_FIX                                        1'b0
    28      R/W     EN_BUCK_BOOST_VDDPA_SYNC_SWITCH                             1'b0
    29      R/W     EN_LDOPA_VOUT_SWITCH                                        1'b0
    30      R/W     BUCK_BOOST_VDDPA_POS_EN_DR_FIX                              1'b0
    31      R/W     BUCK_BOOST_HV18_POS_EN_DR_FIX                               1'b0
 */
typedef union _AON_REG_SYSTEM_REG6X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t MBISR_STORE: 1;
        uint32_t MBISR_RESTORE: 1;
        uint32_t VENDOR_STORE: 1;
        uint32_t VENDOR_RESTORE: 1;
        uint32_t SYSON_STORE: 1;
        uint32_t SYSON_RESTORE: 1;
        uint32_t EFLASH_STORE: 1;
        uint32_t EFLASH_RESTORE: 1;
        uint32_t RESERVED_1: 6;
        uint32_t WAIT_OK_80M: 1;
        uint32_t WAIT_CP_DIS_OUT: 1;
        uint32_t WAIT_XTAL_CLK_OK: 1;
        uint32_t WAIT_PLL1_READY: 1;
        uint32_t WAIT_VDDCORE_DET_READY: 1;
        uint32_t WAIT_VANA_DET_READY: 1;
        uint32_t WAIT_VDDANA_DET_READY: 1;
        uint32_t WAIT_VDDPA_DET_READY: 1;
        uint32_t WAIT_HV18_DET_READY: 1;
        uint32_t RESERVED: 1;
        uint32_t WAIT_32KOSC_CLK_OK: 1;
        uint32_t WAIT_10MOSC_CLK_OK: 1;
        uint32_t LDO_ANA_POS_EN_DR_FIX: 1;
        uint32_t LDO_PA_POS_EN_DR_FIX: 1;
        uint32_t EN_BUCK_BOOST_VDDPA_SYNC_SWITCH: 1;
        uint32_t EN_LDOPA_VOUT_SWITCH: 1;
        uint32_t BUCK_BOOST_VDDPA_POS_EN_DR_FIX: 1;
        uint32_t BUCK_BOOST_HV18_POS_EN_DR_FIX: 1;
    };
} AON_REG_SYSTEM_REG6X_TYPE;

/*0x4000_0018 AON_REG_SYSTEM_REG6X*/
#define AON_REG_SYSTEM_REG6X_MBISR_STORE_Pos                                                                             0U
#define AON_REG_SYSTEM_REG6X_MBISR_STORE_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG6X_MBISR_STORE_Pos)

#define AON_REG_SYSTEM_REG6X_MBISR_RESTORE_Pos                                                                           1U
#define AON_REG_SYSTEM_REG6X_MBISR_RESTORE_Msk                                                                           (0x1UL << AON_REG_SYSTEM_REG6X_MBISR_RESTORE_Pos)

#define AON_REG_SYSTEM_REG6X_VENDOR_STORE_Pos                                                                            2U
#define AON_REG_SYSTEM_REG6X_VENDOR_STORE_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG6X_VENDOR_STORE_Pos)

#define AON_REG_SYSTEM_REG6X_VENDOR_RESTORE_Pos                                                                          3U
#define AON_REG_SYSTEM_REG6X_VENDOR_RESTORE_Msk                                                                          (0x1UL << AON_REG_SYSTEM_REG6X_VENDOR_RESTORE_Pos)

#define AON_REG_SYSTEM_REG6X_SYSON_STORE_Pos                                                                             4U
#define AON_REG_SYSTEM_REG6X_SYSON_STORE_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG6X_SYSON_STORE_Pos)

#define AON_REG_SYSTEM_REG6X_SYSON_RESTORE_Pos                                                                           5U
#define AON_REG_SYSTEM_REG6X_SYSON_RESTORE_Msk                                                                           (0x1UL << AON_REG_SYSTEM_REG6X_SYSON_RESTORE_Pos)

