rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG6X_EFLASH_STORE_Pos                                                                            6U
#define AON_REG_SYSTEM_REG6X_EFLASH_STORE_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG6X_EFLASH_STORE_Pos)

#define AON_REG_SYSTEM_REG6X_EFLASH_RESTORE_Pos                                                                          7U
#define AON_REG_SYSTEM_REG6X_EFLASH_RESTORE_Msk                                                                          (0x1UL << AON_REG_SYSTEM_REG6X_EFLASH_RESTORE_Pos)

#define AON_REG_SYSTEM_REG6X_RESERVED_1_Pos                                                                              8U
#define AON_REG_SYSTEM_REG6X_RESERVED_1_Msk                                                                              (0x3FUL << AON_REG_SYSTEM_REG6X_RESERVED_1_Pos)

#define AON_REG_SYSTEM_REG6X_WAIT_OK_80M_Pos                                                                             14U
#define AON_REG_SYSTEM_REG6X_WAIT_OK_80M_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG6X_WAIT_OK_80M_Pos)

#define AON_REG_SYSTEM_REG6X_WAIT_CP_DIS_OUT_Pos                                                                         15U
#define AON_REG_SYSTEM_REG6X_WAIT_CP_DIS_OUT_Msk                                                                         (0x1UL << AON_REG_SYSTEM_REG6X_WAIT_CP_DIS_OUT_Pos)

#define AON_REG_SYSTEM_REG6X_WAIT_XTAL_CLK_OK_Pos                                                                        16U
#define AON_REG_SYSTEM_REG6X_WAIT_XTAL_CLK_OK_Msk                                                                        (0x1UL << AON_REG_SYSTEM_REG6X_WAIT_XTAL_CLK_OK_Pos)

#define AON_REG_SYSTEM_REG6X_WAIT_PLL1_READY_Pos                                                                         17U
#define AON_REG_SYSTEM_REG6X_WAIT_PLL1_READY_Msk                                                                         (0x1UL << AON_REG_SYSTEM_REG6X_WAIT_PLL1_READY_Pos)

#define AON_REG_SYSTEM_REG6X_WAIT_VDDCORE_DET_READY_Pos                                                                  18U
#define AON_REG_SYSTEM_REG6X_WAIT_VDDCORE_DET_READY_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG6X_WAIT_VDDCORE_DET_READY_Pos)

#define AON_REG_SYSTEM_REG6X_WAIT_VANA_DET_READY_Pos                                                                     19U
#define AON_REG_SYSTEM_REG6X_WAIT_VANA_DET_READY_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG6X_WAIT_VANA_DET_READY_Pos)

#define AON_REG_SYSTEM_REG6X_WAIT_VDDANA_DET_READY_Pos                                                                   20U
#define AON_REG_SYSTEM_REG6X_WAIT_VDDANA_DET_READY_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG6X_WAIT_VDDANA_DET_READY_Pos)

#define AON_REG_SYSTEM_REG6X_WAIT_VDDPA_DET_READY_Pos                                                                    21U
#define AON_REG_SYSTEM_REG6X_WAIT_VDDPA_DET_READY_Msk                                                                    (0x1UL << AON_REG_SYSTEM_REG6X_WAIT_VDDPA_DET_READY_Pos)

#define AON_REG_SYSTEM_REG6X_WAIT_HV18_DET_READY_Pos                                                                     22U
#define AON_REG_SYSTEM_REG6X_WAIT_HV18_DET_READY_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG6X_WAIT_HV18_DET_READY_Pos)

#define AON_REG_SYSTEM_REG6X_RESERVED_Pos                                                                                23U
#define AON_REG_SYSTEM_REG6X_RESERVED_Msk                                                                                (0x1UL << AON_REG_SYSTEM_REG6X_RESERVED_Pos)

#define AON_REG_SYSTEM_REG6X_WAIT_32KOSC_CLK_OK_Pos                                                                      24U
#define AON_REG_SYSTEM_REG6X_WAIT_32KOSC_CLK_OK_Msk                                                                      (0x1UL << AON_REG_SYSTEM_REG6X_WAIT_32KOSC_CLK_OK_Pos)

#define AON_REG_SYSTEM_REG6X_WAIT_10MOSC_CLK_OK_Pos                                                                      25U
#define AON_REG_SYSTEM_REG6X_WAIT_10MOSC_CLK_OK_Msk                                                                      (0x1UL << AON_REG_SYSTEM_REG6X_WAIT_10MOSC_CLK_OK_Pos)

#define AON_REG_SYSTEM_REG6X_LDO_ANA_POS_EN_DR_FIX_Pos                                                                   26U
#define AON_REG_SYSTEM_REG6X_LDO_ANA_POS_EN_DR_FIX_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG6X_LDO_ANA_POS_EN_DR_FIX_Pos)

#define AON_REG_SYSTEM_REG6X_LDO_PA_POS_EN_DR_FIX_Pos                                                                    27U
#define AON_REG_SYSTEM_REG6X_LDO_PA_POS_EN_DR_FIX_Msk                                                                    (0x1UL << AON_REG_SYSTEM_REG6X_LDO_PA_POS_EN_DR_FIX_Pos)

#define AON_REG_SYSTEM_REG6X_EN_BUCK_BOOST_VDDPA_SYNC_SWITCH_Pos                                                         28U
#define AON_REG_SYSTEM_REG6X_EN_BUCK_BOOST_VDDPA_SYNC_SWITCH_Msk                                                         (0x1UL << AON_REG_SYSTEM_REG6X_EN_BUCK_BOOST_VDDPA_SYNC_SWITCH_Pos)

#define AON_REG_SYSTEM_REG6X_EN_LDOPA_VOUT_SWITCH_Pos                                                                    29U
#define AON_REG_SYSTEM_REG6X_EN_LDOPA_VOUT_SWITCH_Msk                                                                    (0x1UL << AON_REG_SYSTEM_REG6X_EN_LDOPA_VOUT_SWITCH_Pos)

#define AON_REG_SYSTEM_REG6X_BUCK_BOOST_VDDPA_POS_EN_DR_FIX_Pos                                                          30U
#define AON_REG_SYSTEM_REG6X_BUCK_BOOST_VDDPA_POS_EN_DR_FIX_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG6X_BUCK_BOOST_VDDPA_POS_EN_DR_FIX_Pos)

#define AON_REG_SYSTEM_REG6X_BUCK_BOOST_HV18_POS_EN_DR_FIX_Pos                                                           31U
#define AON_REG_SYSTEM_REG6X_BUCK_BOOST_HV18_POS_EN_DR_FIX_Msk                                                           (0x1UL << AON_REG_SYSTEM_REG6X_BUCK_BOOST_HV18_POS_EN_DR_FIX_Pos)

/* 0x1C     0x4000_001c
    0       R/W     BUCK_BOOST_HV18_POS_RSTB                                    1'b0
    1       R/W     BUCK_BOOST_HV18_POS_EN_POS                                  1'b0
    5:2     R/W     BUCK_BOOST_HV18_POS_POF_STEP                                4'b0001
    9:6     R/W     BUCK_BOOST_HV18_POS_PON_STEP                                4'b0001
    12:10   R/W     BUCK_BOOST_HV18_POS_POF_WAIT                                3'b000
    15:13   R/W     BUCK_BOOST_HV18_POS_PON_WAIT                                3'b000
    23:16   R/W     BUCK_BOOST_HV18_POS_PON_OVER                                8'b00011111
    31:24   R/W     BUCK_BOOST_HV18_POS_PON_START                               8'b00000000
 */
typedef union _AON_REG_SYSTEM_REG7X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_BOOST_HV18_POS_RSTB: 1;
        uint32_t BUCK_BOOST_HV18_POS_EN_POS: 1;
        uint32_t BUCK_BOOST_HV18_POS_POF_STEP: 4;
        uint32_t BUCK_BOOST_HV18_POS_PON_STEP: 4;
        uint32_t BUCK_BOOST_HV18_POS_POF_WAIT: 3;
        uint32_t BUCK_BOOST_HV18_POS_PON_WAIT: 3;
        uint32_t BUCK_BOOST_HV18_POS_PON_OVER: 8;
        uint32_t BUCK_BOOST_HV18_POS_PON_START: 8;
    };
} AON_REG_SYSTEM_REG7X_TYPE;

/*0x4000_001c AON_REG_SYSTEM_REG7X*/
#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_RSTB_Pos                                                                0U
#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_RSTB_Msk                                                                (0x1UL << AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_RSTB_Pos)

#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_EN_POS_Pos                                                              1U
#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_EN_POS_Msk                                                              (0x1UL << AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_EN_POS_Pos)

