rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_POF_STEP_Pos                                                            2U
#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_POF_STEP_Msk                                                            (0xFUL << AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_POF_STEP_Pos)

#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_STEP_Pos                                                            6U
#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_STEP_Msk                                                            (0xFUL << AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_STEP_Pos)

#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_POF_WAIT_Pos                                                            10U
#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_POF_WAIT_Msk                                                            (0x7UL << AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_POF_WAIT_Pos)

#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_WAIT_Pos                                                            13U
#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_WAIT_Msk                                                            (0x7UL << AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_WAIT_Pos)

#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_OVER_Pos                                                            16U
#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_OVER_Msk                                                            (0xFFUL << AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_OVER_Pos)

#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_START_Pos                                                           24U
#define AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_START_Msk                                                           (0xFFUL << AON_REG_SYSTEM_REG7X_BUCK_BOOST_HV18_POS_PON_START_Pos)

/* 0x20     0x4000_0020
    7:0     R/W     BUCK_BOOST_HV18_POS_POF_OVER                                8'b00000000
    15:8    R/W     BUCK_BOOST_HV18_POS_POF_START                               8'b00011111
    23:16   R/W     BUCK_BOOST_HV18_POS_SET_PON_FLAG1                           8'b00000000
    31:24   R/W     BUCK_BOOST_HV18_POS_SET_PON_FLAG2                           8'b00011000
 */
typedef union _AON_REG_SYSTEM_REG8X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_BOOST_HV18_POS_POF_OVER: 8;
        uint32_t BUCK_BOOST_HV18_POS_POF_START: 8;
        uint32_t BUCK_BOOST_HV18_POS_SET_PON_FLAG1: 8;
        uint32_t BUCK_BOOST_HV18_POS_SET_PON_FLAG2: 8;
    };
} AON_REG_SYSTEM_REG8X_TYPE;

/*0x4000_0020 AON_REG_SYSTEM_REG8X*/
#define AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_POF_OVER_Pos                                                            0U
#define AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_POF_OVER_Msk                                                            (0xFFUL << AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_POF_OVER_Pos)

#define AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_POF_START_Pos                                                           8U
#define AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_POF_START_Msk                                                           (0xFFUL << AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_POF_START_Pos)

#define AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_SET_PON_FLAG1_Pos                                                       16U
#define AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_SET_PON_FLAG1_Msk                                                       (0xFFUL << AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_SET_PON_FLAG1_Pos)

#define AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_SET_PON_FLAG2_Pos                                                       24U
#define AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_SET_PON_FLAG2_Msk                                                       (0xFFUL << AON_REG_SYSTEM_REG8X_BUCK_BOOST_HV18_POS_SET_PON_FLAG2_Pos)

/* 0x24     0x4000_0024
    7:0     R/W     BUCK_BOOST_HV18_POS_SET_PON_FLAG3                           8'b00011100
    15:8    R/W     BUCK_BOOST_HV18_POS_SET_PON_FLAG4                           8'b00011111
    23:16   R/W     BUCK_BOOST_HV18_POS_SET_POF_FLAG1                           8'b00000000
    31:24   R/W     BUCK_BOOST_HV18_POS_SET_POF_FLAG2                           8'b00011000
 */
typedef union _AON_REG_SYSTEM_REG9X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_BOOST_HV18_POS_SET_PON_FLAG3: 8;
        uint32_t BUCK_BOOST_HV18_POS_SET_PON_FLAG4: 8;
        uint32_t BUCK_BOOST_HV18_POS_SET_POF_FLAG1: 8;
        uint32_t BUCK_BOOST_HV18_POS_SET_POF_FLAG2: 8;
    };
} AON_REG_SYSTEM_REG9X_TYPE;

/*0x4000_0024 AON_REG_SYSTEM_REG9X*/
#define AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_PON_FLAG3_Pos                                                       0U
#define AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_PON_FLAG3_Msk                                                       (0xFFUL << AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_PON_FLAG3_Pos)

#define AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_PON_FLAG4_Pos                                                       8U
#define AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_PON_FLAG4_Msk                                                       (0xFFUL << AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_PON_FLAG4_Pos)

#define AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_POF_FLAG1_Pos                                                       16U
#define AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_POF_FLAG1_Msk                                                       (0xFFUL << AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_POF_FLAG1_Pos)

#define AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_POF_FLAG2_Pos                                                       24U
#define AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_POF_FLAG2_Msk                                                       (0xFFUL << AON_REG_SYSTEM_REG9X_BUCK_BOOST_HV18_POS_SET_POF_FLAG2_Pos)

/* 0x28     0x4000_0028
    7:0     R/W     BUCK_BOOST_HV18_POS_SET_POF_FLAG3                           8'b00011100
    15:8    R/W     BUCK_BOOST_HV18_POS_SET_POF_FLAG4                           8'b00011111
    18:16   R       BUCK_BOOST_HV18_POS_FSM_CS                                  3'b000
    19      R       BUCK_BOOST_HV18_POS_POF_FLAG4                               1'b0
    20      R       BUCK_BOOST_HV18_POS_POF_FLAG3                               1'b0
    21      R       BUCK_BOOST_HV18_POS_POF_FLAG2                               1'b0
    22      R       BUCK_BOOST_HV18_POS_POF_FLAG1                               1'b0
    23      R       BUCK_BOOST_HV18_POS_PON_FLAG4                               1'b0
    24      R       BUCK_BOOST_HV18_POS_PON_FLAG3                               1'b0
    25      R       BUCK_BOOST_HV18_POS_PON_FLAG2                               1'b0
    26      R       BUCK_BOOST_HV18_POS_PON_FLAG1                               1'b0
    29:27   R/W     BUCK_BOOST_HV18_POS_DIV_CLK                                 3'b111
    30      R/W     BUCK_BOOST_HV18_POS_CLK_GATED                               1'b1
    31      R       RESERVED                                                    1'b0
 */
typedef union _AON_REG_SYSTEM_REG10X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_BOOST_HV18_POS_SET_POF_FLAG3: 8;
        uint32_t BUCK_BOOST_HV18_POS_SET_POF_FLAG4: 8;
        uint32_t BUCK_BOOST_HV18_POS_FSM_CS: 3;
        uint32_t BUCK_BOOST_HV18_POS_POF_FLAG4: 1;
        uint32_t BUCK_BOOST_HV18_POS_POF_FLAG3: 1;
        uint32_t BUCK_BOOST_HV18_POS_POF_FLAG2: 1;
        uint32_t BUCK_BOOST_HV18_POS_POF_FLAG1: 1;
        uint32_t BUCK_BOOST_HV18_POS_PON_FLAG4: 1;
        uint32_t BUCK_BOOST_HV18_POS_PON_FLAG3: 1;
        uint32_t BUCK_BOOST_HV18_POS_PON_FLAG2: 1;
        uint32_t BUCK_BOOST_HV18_POS_PON_FLAG1: 1;
        uint32_t BUCK_BOOST_HV18_POS_DIV_CLK: 3;
        uint32_t BUCK_BOOST_HV18_POS_CLK_GATED: 1;
        uint32_t RESERVED: 1;
    };
} AON_REG_SYSTEM_REG10X_TYPE;

