rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0028 AON_REG_SYSTEM_REG10X*/
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_SET_POF_FLAG3_Pos                                                      0U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_SET_POF_FLAG3_Msk                                                      (0xFFUL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_SET_POF_FLAG3_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_SET_POF_FLAG4_Pos                                                      8U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_SET_POF_FLAG4_Msk                                                      (0xFFUL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_SET_POF_FLAG4_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_FSM_CS_Pos                                                             16U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_FSM_CS_Msk                                                             (0x7UL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_FSM_CS_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG4_Pos                                                          19U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG4_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG4_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG3_Pos                                                          20U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG3_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG3_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG2_Pos                                                          21U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG2_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG2_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG1_Pos                                                          22U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG1_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_POF_FLAG1_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG4_Pos                                                          23U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG4_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG4_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG3_Pos                                                          24U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG3_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG3_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG2_Pos                                                          25U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG2_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG2_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG1_Pos                                                          26U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG1_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_PON_FLAG1_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_DIV_CLK_Pos                                                            27U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_DIV_CLK_Msk                                                            (0x7UL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_DIV_CLK_Pos)

#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_CLK_GATED_Pos                                                          30U
#define AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_CLK_GATED_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG10X_BUCK_BOOST_HV18_POS_CLK_GATED_Pos)

#define AON_REG_SYSTEM_REG10X_RESERVED_Pos                                                                               31U
#define AON_REG_SYSTEM_REG10X_RESERVED_Msk                                                                               (0x1UL << AON_REG_SYSTEM_REG10X_RESERVED_Pos)

/* 0x2C     0x4000_002c
    0       R/W     BUCK_BOOST_VDDPA_POS_RSTB                                   1'b0
    1       R/W     BUCK_BOOST_VDDPA_POS_EN_POS                                 1'b0
    5:2     R/W     BUCK_BOOST_VDDPA_POS_POF_STEP                               4'b0001
    9:6     R/W     BUCK_BOOST_VDDPA_POS_PON_STEP                               4'b0001
    12:10   R/W     BUCK_BOOST_VDDPA_POS_POF_WAIT                               3'b000
    15:13   R/W     BUCK_BOOST_VDDPA_POS_PON_WAIT                               3'b000
    23:16   R/W     BUCK_BOOST_VDDPA_POS_PON_OVER                               8'b00011111
    31:24   R/W     BUCK_BOOST_VDDPA_POS_PON_START                              8'b00000000
 */
typedef union _AON_REG_SYSTEM_REG11X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_BOOST_VDDPA_POS_RSTB: 1;
        uint32_t BUCK_BOOST_VDDPA_POS_EN_POS: 1;
        uint32_t BUCK_BOOST_VDDPA_POS_POF_STEP: 4;
        uint32_t BUCK_BOOST_VDDPA_POS_PON_STEP: 4;
        uint32_t BUCK_BOOST_VDDPA_POS_POF_WAIT: 3;
        uint32_t BUCK_BOOST_VDDPA_POS_PON_WAIT: 3;
        uint32_t BUCK_BOOST_VDDPA_POS_PON_OVER: 8;
        uint32_t BUCK_BOOST_VDDPA_POS_PON_START: 8;
    };
} AON_REG_SYSTEM_REG11X_TYPE;

/*0x4000_002c AON_REG_SYSTEM_REG11X*/
#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_RSTB_Pos                                                              0U
#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_RSTB_Msk                                                              (0x1UL << AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_RSTB_Pos)

