rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_EN_POS_Pos                                                            1U
#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_EN_POS_Msk                                                            (0x1UL << AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_EN_POS_Pos)

#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_POF_STEP_Pos                                                          2U
#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_POF_STEP_Msk                                                          (0xFUL << AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_POF_STEP_Pos)

#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_STEP_Pos                                                          6U
#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_STEP_Msk                                                          (0xFUL << AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_STEP_Pos)

#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_POF_WAIT_Pos                                                          10U
#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_POF_WAIT_Msk                                                          (0x7UL << AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_POF_WAIT_Pos)

#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_WAIT_Pos                                                          13U
#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_WAIT_Msk                                                          (0x7UL << AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_WAIT_Pos)

#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_OVER_Pos                                                          16U
#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_OVER_Msk                                                          (0xFFUL << AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_OVER_Pos)

#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_START_Pos                                                         24U
#define AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_START_Msk                                                         (0xFFUL << AON_REG_SYSTEM_REG11X_BUCK_BOOST_VDDPA_POS_PON_START_Pos)

/* 0x30     0x4000_0030
    7:0     R/W     BUCK_BOOST_VDDPA_POS_POF_OVER                               8'b00000000
    15:8    R/W     BUCK_BOOST_VDDPA_POS_POF_START                              8'b00011111
    23:16   R/W     BUCK_BOOST_VDDPA_POS_SET_PON_FLAG1                          8'b00000000
    31:24   R/W     BUCK_BOOST_VDDPA_POS_SET_PON_FLAG2                          8'b00011000
 */
typedef union _AON_REG_SYSTEM_REG12X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_BOOST_VDDPA_POS_POF_OVER: 8;
        uint32_t BUCK_BOOST_VDDPA_POS_POF_START: 8;
        uint32_t BUCK_BOOST_VDDPA_POS_SET_PON_FLAG1: 8;
        uint32_t BUCK_BOOST_VDDPA_POS_SET_PON_FLAG2: 8;
    };
} AON_REG_SYSTEM_REG12X_TYPE;

/*0x4000_0030 AON_REG_SYSTEM_REG12X*/
#define AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_POF_OVER_Pos                                                          0U
#define AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_POF_OVER_Msk                                                          (0xFFUL << AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_POF_OVER_Pos)

#define AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_POF_START_Pos                                                         8U
#define AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_POF_START_Msk                                                         (0xFFUL << AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_POF_START_Pos)

#define AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG1_Pos                                                     16U
#define AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG1_Msk                                                     (0xFFUL << AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG1_Pos)

#define AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG2_Pos                                                     24U
#define AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG2_Msk                                                     (0xFFUL << AON_REG_SYSTEM_REG12X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG2_Pos)

/* 0x34     0x4000_0034
    7:0     R/W     BUCK_BOOST_VDDPA_POS_SET_PON_FLAG3                          8'b00011100
    15:8    R/W     BUCK_BOOST_VDDPA_POS_SET_PON_FLAG4                          8'b00011111
    23:16   R/W     BUCK_BOOST_VDDPA_POS_SET_POF_FLAG1                          8'b00000000
    31:24   R/W     BUCK_BOOST_VDDPA_POS_SET_POF_FLAG2                          8'b00011000
 */
typedef union _AON_REG_SYSTEM_REG13X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_BOOST_VDDPA_POS_SET_PON_FLAG3: 8;
        uint32_t BUCK_BOOST_VDDPA_POS_SET_PON_FLAG4: 8;
        uint32_t BUCK_BOOST_VDDPA_POS_SET_POF_FLAG1: 8;
        uint32_t BUCK_BOOST_VDDPA_POS_SET_POF_FLAG2: 8;
    };
} AON_REG_SYSTEM_REG13X_TYPE;

/*0x4000_0034 AON_REG_SYSTEM_REG13X*/
#define AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG3_Pos                                                     0U
#define AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG3_Msk                                                     (0xFFUL << AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG3_Pos)

#define AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG4_Pos                                                     8U
#define AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG4_Msk                                                     (0xFFUL << AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_PON_FLAG4_Pos)

#define AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_POF_FLAG1_Pos                                                     16U
#define AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_POF_FLAG1_Msk                                                     (0xFFUL << AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_POF_FLAG1_Pos)

#define AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_POF_FLAG2_Pos                                                     24U
#define AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_POF_FLAG2_Msk                                                     (0xFFUL << AON_REG_SYSTEM_REG13X_BUCK_BOOST_VDDPA_POS_SET_POF_FLAG2_Pos)

/* 0x38     0x4000_0038
    7:0     R/W     BUCK_BOOST_VDDPA_POS_SET_POF_FLAG3                          8'b00011100
    15:8    R/W     BUCK_BOOST_VDDPA_POS_SET_POF_FLAG4                          8'b00011111
    18:16   R       BUCK_BOOST_VDDPA_POS_FSM_CS                                 3'b000
    19      R       BUCK_BOOST_VDDPA_POS_POF_FLAG4                              1'b0
    20      R       BUCK_BOOST_VDDPA_POS_POF_FLAG3                              1'b0
    21      R       BUCK_BOOST_VDDPA_POS_POF_FLAG2                              1'b0
    22      R       BUCK_BOOST_VDDPA_POS_POF_FLAG1                              1'b0
    23      R       BUCK_BOOST_VDDPA_POS_PON_FLAG4                              1'b0
    24      R       BUCK_BOOST_VDDPA_POS_PON_FLAG3                              1'b0
    25      R       BUCK_BOOST_VDDPA_POS_PON_FLAG2                              1'b0
    26      R       BUCK_BOOST_VDDPA_POS_PON_FLAG1                              1'b0
    30:27   R/W     BUCK_BOOST_VDDPA_POS_DIV_CLK                                4'b0111
    31      R/W     BUCK_BOOST_VDDPA_POS_CLK_GATED                              1'b1
 */
typedef union _AON_REG_SYSTEM_REG14X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BUCK_BOOST_VDDPA_POS_SET_POF_FLAG3: 8;
        uint32_t BUCK_BOOST_VDDPA_POS_SET_POF_FLAG4: 8;
        uint32_t BUCK_BOOST_VDDPA_POS_FSM_CS: 3;
        uint32_t BUCK_BOOST_VDDPA_POS_POF_FLAG4: 1;
        uint32_t BUCK_BOOST_VDDPA_POS_POF_FLAG3: 1;
        uint32_t BUCK_BOOST_VDDPA_POS_POF_FLAG2: 1;
        uint32_t BUCK_BOOST_VDDPA_POS_POF_FLAG1: 1;
        uint32_t BUCK_BOOST_VDDPA_POS_PON_FLAG4: 1;
        uint32_t BUCK_BOOST_VDDPA_POS_PON_FLAG3: 1;
        uint32_t BUCK_BOOST_VDDPA_POS_PON_FLAG2: 1;
        uint32_t BUCK_BOOST_VDDPA_POS_PON_FLAG1: 1;
        uint32_t BUCK_BOOST_VDDPA_POS_DIV_CLK: 4;
        uint32_t BUCK_BOOST_VDDPA_POS_CLK_GATED: 1;
    };
} AON_REG_SYSTEM_REG14X_TYPE;

