rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG15X_LDO_ANA_POS_PON_WAIT_Pos                                                                   13U
#define AON_REG_SYSTEM_REG15X_LDO_ANA_POS_PON_WAIT_Msk                                                                   (0x7UL << AON_REG_SYSTEM_REG15X_LDO_ANA_POS_PON_WAIT_Pos)

#define AON_REG_SYSTEM_REG15X_LDO_ANA_POS_PON_OVER_Pos                                                                   16U
#define AON_REG_SYSTEM_REG15X_LDO_ANA_POS_PON_OVER_Msk                                                                   (0xFFUL << AON_REG_SYSTEM_REG15X_LDO_ANA_POS_PON_OVER_Pos)

#define AON_REG_SYSTEM_REG15X_LDO_ANA_POS_PON_START_Pos                                                                  24U
#define AON_REG_SYSTEM_REG15X_LDO_ANA_POS_PON_START_Msk                                                                  (0xFFUL << AON_REG_SYSTEM_REG15X_LDO_ANA_POS_PON_START_Pos)

/* 0x40     0x4000_0040
    7:0     R/W     LDO_ANA_POS_POF_OVER                                        8'b00000000
    15:8    R/W     LDO_ANA_POS_POF_START                                       8'b00111111
    23:16   R/W     LDO_ANA_POS_SET_PON_FLAG1                                   8'b00000000
    31:24   R/W     LDO_ANA_POS_SET_PON_FLAG2                                   8'b00011000
 */
typedef union _AON_REG_SYSTEM_REG16X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LDO_ANA_POS_POF_OVER: 8;
        uint32_t LDO_ANA_POS_POF_START: 8;
        uint32_t LDO_ANA_POS_SET_PON_FLAG1: 8;
        uint32_t LDO_ANA_POS_SET_PON_FLAG2: 8;
    };
} AON_REG_SYSTEM_REG16X_TYPE;

/*0x4000_0040 AON_REG_SYSTEM_REG16X*/
#define AON_REG_SYSTEM_REG16X_LDO_ANA_POS_POF_OVER_Pos                                                                   0U
#define AON_REG_SYSTEM_REG16X_LDO_ANA_POS_POF_OVER_Msk                                                                   (0xFFUL << AON_REG_SYSTEM_REG16X_LDO_ANA_POS_POF_OVER_Pos)

#define AON_REG_SYSTEM_REG16X_LDO_ANA_POS_POF_START_Pos                                                                  8U
#define AON_REG_SYSTEM_REG16X_LDO_ANA_POS_POF_START_Msk                                                                  (0xFFUL << AON_REG_SYSTEM_REG16X_LDO_ANA_POS_POF_START_Pos)

#define AON_REG_SYSTEM_REG16X_LDO_ANA_POS_SET_PON_FLAG1_Pos                                                              16U
#define AON_REG_SYSTEM_REG16X_LDO_ANA_POS_SET_PON_FLAG1_Msk                                                              (0xFFUL << AON_REG_SYSTEM_REG16X_LDO_ANA_POS_SET_PON_FLAG1_Pos)

#define AON_REG_SYSTEM_REG16X_LDO_ANA_POS_SET_PON_FLAG2_Pos                                                              24U
#define AON_REG_SYSTEM_REG16X_LDO_ANA_POS_SET_PON_FLAG2_Msk                                                              (0xFFUL << AON_REG_SYSTEM_REG16X_LDO_ANA_POS_SET_PON_FLAG2_Pos)

/* 0x44     0x4000_0044
    7:0     R/W     LDO_ANA_POS_SET_PON_FLAG3                                   8'b00011100
    15:8    R/W     LDO_ANA_POS_SET_PON_FLAG4                                   8'b00011111
    23:16   R/W     LDO_ANA_POS_SET_POF_FLAG1                                   8'b00000111
    31:24   R/W     LDO_ANA_POS_SET_POF_FLAG2                                   8'b00000110
 */
typedef union _AON_REG_SYSTEM_REG17X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LDO_ANA_POS_SET_PON_FLAG3: 8;
        uint32_t LDO_ANA_POS_SET_PON_FLAG4: 8;
        uint32_t LDO_ANA_POS_SET_POF_FLAG1: 8;
        uint32_t LDO_ANA_POS_SET_POF_FLAG2: 8;
    };
} AON_REG_SYSTEM_REG17X_TYPE;

/*0x4000_0044 AON_REG_SYSTEM_REG17X*/
#define AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_PON_FLAG3_Pos                                                              0U
#define AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_PON_FLAG3_Msk                                                              (0xFFUL << AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_PON_FLAG3_Pos)

#define AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_PON_FLAG4_Pos                                                              8U
#define AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_PON_FLAG4_Msk                                                              (0xFFUL << AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_PON_FLAG4_Pos)

#define AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_POF_FLAG1_Pos                                                              16U
#define AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_POF_FLAG1_Msk                                                              (0xFFUL << AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_POF_FLAG1_Pos)

#define AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_POF_FLAG2_Pos                                                              24U
#define AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_POF_FLAG2_Msk                                                              (0xFFUL << AON_REG_SYSTEM_REG17X_LDO_ANA_POS_SET_POF_FLAG2_Pos)

/* 0x48     0x4000_0048
    7:0     R/W     LDO_ANA_POS_SET_POF_FLAG3                                   8'b00011100
    15:8    R/W     LDO_ANA_POS_SET_POF_FLAG4                                   8'b00011111
    18:16   R       LDO_ANA_POS_FSM_CS                                          3'b000
    19      R       LDO_ANA_POS_POF_FLAG4                                       1'b0
    20      R       LDO_ANA_POS_POF_FLAG3                                       1'b0
    21      R       LDO_ANA_POS_POF_FLAG2                                       1'b0
    22      R       LDO_ANA_POS_POF_FLAG1                                       1'b0
    23      R       LDO_ANA_POS_PON_FLAG4                                       1'b0
    24      R       LDO_ANA_POS_PON_FLAG3                                       1'b0
    25      R       LDO_ANA_POS_PON_FLAG2                                       1'b0
    26      R       LDO_ANA_POS_PON_FLAG1                                       1'b0
    29:27   R/W     LDO_ANA_POS_DIV_CLK                                         3'b110
    30      R/W     LDO_ANA_POS_CLK_GATED                                       1'b1
    31      R       RESERVED                                                    1'b0
 */
typedef union _AON_REG_SYSTEM_REG18X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LDO_ANA_POS_SET_POF_FLAG3: 8;
        uint32_t LDO_ANA_POS_SET_POF_FLAG4: 8;
        uint32_t LDO_ANA_POS_FSM_CS: 3;
        uint32_t LDO_ANA_POS_POF_FLAG4: 1;
        uint32_t LDO_ANA_POS_POF_FLAG3: 1;
        uint32_t LDO_ANA_POS_POF_FLAG2: 1;
        uint32_t LDO_ANA_POS_POF_FLAG1: 1;
        uint32_t LDO_ANA_POS_PON_FLAG4: 1;
        uint32_t LDO_ANA_POS_PON_FLAG3: 1;
        uint32_t LDO_ANA_POS_PON_FLAG2: 1;
        uint32_t LDO_ANA_POS_PON_FLAG1: 1;
        uint32_t LDO_ANA_POS_DIV_CLK: 3;
        uint32_t LDO_ANA_POS_CLK_GATED: 1;
        uint32_t RESERVED: 1;
    };
} AON_REG_SYSTEM_REG18X_TYPE;

/*0x4000_0048 AON_REG_SYSTEM_REG18X*/
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_SET_POF_FLAG3_Pos                                                              0U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_SET_POF_FLAG3_Msk                                                              (0xFFUL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_SET_POF_FLAG3_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_SET_POF_FLAG4_Pos                                                              8U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_SET_POF_FLAG4_Msk                                                              (0xFFUL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_SET_POF_FLAG4_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_FSM_CS_Pos                                                                     16U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_FSM_CS_Msk                                                                     (0x7UL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_FSM_CS_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG4_Pos                                                                  19U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG4_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG4_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG3_Pos                                                                  20U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG3_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG3_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG2_Pos                                                                  21U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG2_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG2_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG1_Pos                                                                  22U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG1_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_POF_FLAG1_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG4_Pos                                                                  23U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG4_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG4_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG3_Pos                                                                  24U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG3_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG3_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG2_Pos                                                                  25U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG2_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG2_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG1_Pos                                                                  26U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG1_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_PON_FLAG1_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_DIV_CLK_Pos                                                                    27U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_DIV_CLK_Msk                                                                    (0x7UL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_DIV_CLK_Pos)

#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_CLK_GATED_Pos                                                                  30U
#define AON_REG_SYSTEM_REG18X_LDO_ANA_POS_CLK_GATED_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG18X_LDO_ANA_POS_CLK_GATED_Pos)

