rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG18X_RESERVED_Pos                                                                               31U
#define AON_REG_SYSTEM_REG18X_RESERVED_Msk                                                                               (0x1UL << AON_REG_SYSTEM_REG18X_RESERVED_Pos)

/* 0x4C     0x4000_004c
    0       R/W     LDO_PA_POS_RSTB                                             1'b0
    1       R/W     LDO_PA_POS_EN_POS                                           1'b0
    5:2     R/W     LDO_PA_POS_POF_STEP                                         4'b0001
    9:6     R/W     LDO_PA_POS_PON_STEP                                         4'b0001
    12:10   R/W     LDO_PA_POS_POF_WAIT                                         3'b000
    15:13   R/W     LDO_PA_POS_PON_WAIT                                         3'b000
    23:16   R/W     LDO_PA_POS_PON_OVER                                         8'b00111111
    31:24   R/W     LDO_PA_POS_PON_START                                        8'b00000000
 */
typedef union _AON_REG_SYSTEM_REG19X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LDO_PA_POS_RSTB: 1;
        uint32_t LDO_PA_POS_EN_POS: 1;
        uint32_t LDO_PA_POS_POF_STEP: 4;
        uint32_t LDO_PA_POS_PON_STEP: 4;
        uint32_t LDO_PA_POS_POF_WAIT: 3;
        uint32_t LDO_PA_POS_PON_WAIT: 3;
        uint32_t LDO_PA_POS_PON_OVER: 8;
        uint32_t LDO_PA_POS_PON_START: 8;
    };
} AON_REG_SYSTEM_REG19X_TYPE;

/*0x4000_004c AON_REG_SYSTEM_REG19X*/
#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_RSTB_Pos                                                                        0U
#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_RSTB_Msk                                                                        (0x1UL << AON_REG_SYSTEM_REG19X_LDO_PA_POS_RSTB_Pos)

#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_EN_POS_Pos                                                                      1U
#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_EN_POS_Msk                                                                      (0x1UL << AON_REG_SYSTEM_REG19X_LDO_PA_POS_EN_POS_Pos)

#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_POF_STEP_Pos                                                                    2U
#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_POF_STEP_Msk                                                                    (0xFUL << AON_REG_SYSTEM_REG19X_LDO_PA_POS_POF_STEP_Pos)

#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_STEP_Pos                                                                    6U
#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_STEP_Msk                                                                    (0xFUL << AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_STEP_Pos)

#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_POF_WAIT_Pos                                                                    10U
#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_POF_WAIT_Msk                                                                    (0x7UL << AON_REG_SYSTEM_REG19X_LDO_PA_POS_POF_WAIT_Pos)

#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_WAIT_Pos                                                                    13U
#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_WAIT_Msk                                                                    (0x7UL << AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_WAIT_Pos)

#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_OVER_Pos                                                                    16U
#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_OVER_Msk                                                                    (0xFFUL << AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_OVER_Pos)

#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_START_Pos                                                                   24U
#define AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_START_Msk                                                                   (0xFFUL << AON_REG_SYSTEM_REG19X_LDO_PA_POS_PON_START_Pos)

/* 0x50     0x4000_0050
    7:0     R/W     LDO_PA_POS_POF_OVER                                         8'b00000000
    15:8    R/W     LDO_PA_POS_POF_START                                        8'b00011111
    23:16   R/W     LDO_PA_POS_SET_PON_FLAG1                                    8'b00000000
    31:24   R/W     LDO_PA_POS_SET_PON_FLAG2                                    8'b00011000
 */
typedef union _AON_REG_SYSTEM_REG20X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LDO_PA_POS_POF_OVER: 8;
        uint32_t LDO_PA_POS_POF_START: 8;
        uint32_t LDO_PA_POS_SET_PON_FLAG1: 8;
        uint32_t LDO_PA_POS_SET_PON_FLAG2: 8;
    };
} AON_REG_SYSTEM_REG20X_TYPE;

/*0x4000_0050 AON_REG_SYSTEM_REG20X*/
#define AON_REG_SYSTEM_REG20X_LDO_PA_POS_POF_OVER_Pos                                                                    0U
#define AON_REG_SYSTEM_REG20X_LDO_PA_POS_POF_OVER_Msk                                                                    (0xFFUL << AON_REG_SYSTEM_REG20X_LDO_PA_POS_POF_OVER_Pos)

#define AON_REG_SYSTEM_REG20X_LDO_PA_POS_POF_START_Pos                                                                   8U
#define AON_REG_SYSTEM_REG20X_LDO_PA_POS_POF_START_Msk                                                                   (0xFFUL << AON_REG_SYSTEM_REG20X_LDO_PA_POS_POF_START_Pos)

#define AON_REG_SYSTEM_REG20X_LDO_PA_POS_SET_PON_FLAG1_Pos                                                               16U
#define AON_REG_SYSTEM_REG20X_LDO_PA_POS_SET_PON_FLAG1_Msk                                                               (0xFFUL << AON_REG_SYSTEM_REG20X_LDO_PA_POS_SET_PON_FLAG1_Pos)

#define AON_REG_SYSTEM_REG20X_LDO_PA_POS_SET_PON_FLAG2_Pos                                                               24U
#define AON_REG_SYSTEM_REG20X_LDO_PA_POS_SET_PON_FLAG2_Msk                                                               (0xFFUL << AON_REG_SYSTEM_REG20X_LDO_PA_POS_SET_PON_FLAG2_Pos)

/* 0x54     0x4000_0054
    7:0     R/W     LDO_PA_POS_SET_PON_FLAG3                                    8'b00011100
    15:8    R/W     LDO_PA_POS_SET_PON_FLAG4                                    8'b00011111
    23:16   R/W     LDO_PA_POS_SET_POF_FLAG1                                    8'b00000111
    31:24   R/W     LDO_PA_POS_SET_POF_FLAG2                                    8'b00000110
 */
typedef union _AON_REG_SYSTEM_REG21X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LDO_PA_POS_SET_PON_FLAG3: 8;
        uint32_t LDO_PA_POS_SET_PON_FLAG4: 8;
        uint32_t LDO_PA_POS_SET_POF_FLAG1: 8;
        uint32_t LDO_PA_POS_SET_POF_FLAG2: 8;
    };
} AON_REG_SYSTEM_REG21X_TYPE;

/*0x4000_0054 AON_REG_SYSTEM_REG21X*/
#define AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_PON_FLAG3_Pos                                                               0U
#define AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_PON_FLAG3_Msk                                                               (0xFFUL << AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_PON_FLAG3_Pos)

#define AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_PON_FLAG4_Pos                                                               8U
#define AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_PON_FLAG4_Msk                                                               (0xFFUL << AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_PON_FLAG4_Pos)

#define AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_POF_FLAG1_Pos                                                               16U
#define AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_POF_FLAG1_Msk                                                               (0xFFUL << AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_POF_FLAG1_Pos)

#define AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_POF_FLAG2_Pos                                                               24U
#define AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_POF_FLAG2_Msk                                                               (0xFFUL << AON_REG_SYSTEM_REG21X_LDO_PA_POS_SET_POF_FLAG2_Pos)

/* 0x58     0x4000_0058
    7:0     R/W     LDO_PA_POS_SET_POF_FLAG3                                    8'b00000001
    15:8    R/W     LDO_PA_POS_SET_POF_FLAG4                                    8'b00000000
    18:16   R       LDO_PA_POS_FSM_CS                                           3'b000
    19      R       LDO_PA_POS_POF_FLAG4                                        1'b0
    20      R       LDO_PA_POS_POF_FLAG3                                        1'b0
    21      R       LDO_PA_POS_POF_FLAG2                                        1'b0
    22      R       LDO_PA_POS_POF_FLAG1                                        1'b0
    23      R       LDO_PA_POS_PON_FLAG4                                        1'b0
    24      R       LDO_PA_POS_PON_FLAG3                                        1'b0
    25      R       LDO_PA_POS_PON_FLAG2                                        1'b0
    26      R       LDO_PA_POS_PON_FLAG1                                        1'b0
    29:27   R/W     LDO_PA_POS_DIV_CLK                                          3'b101
    30      R/W     LDO_PA_POS_CLK_GATED                                        1'b1
    31      R       RESERVED                                                    1'b0
 */
typedef union _AON_REG_SYSTEM_REG22X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LDO_PA_POS_SET_POF_FLAG3: 8;
        uint32_t LDO_PA_POS_SET_POF_FLAG4: 8;
        uint32_t LDO_PA_POS_FSM_CS: 3;
        uint32_t LDO_PA_POS_POF_FLAG4: 1;
        uint32_t LDO_PA_POS_POF_FLAG3: 1;
        uint32_t LDO_PA_POS_POF_FLAG2: 1;
        uint32_t LDO_PA_POS_POF_FLAG1: 1;
        uint32_t LDO_PA_POS_PON_FLAG4: 1;
        uint32_t LDO_PA_POS_PON_FLAG3: 1;
        uint32_t LDO_PA_POS_PON_FLAG2: 1;
        uint32_t LDO_PA_POS_PON_FLAG1: 1;
        uint32_t LDO_PA_POS_DIV_CLK: 3;
        uint32_t LDO_PA_POS_CLK_GATED: 1;
        uint32_t RESERVED: 1;
    };
} AON_REG_SYSTEM_REG22X_TYPE;

/*0x4000_0058 AON_REG_SYSTEM_REG22X*/
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_SET_POF_FLAG3_Pos                                                               0U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_SET_POF_FLAG3_Msk                                                               (0xFFUL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_SET_POF_FLAG3_Pos)

