rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_SET_POF_FLAG4_Pos                                                               8U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_SET_POF_FLAG4_Msk                                                               (0xFFUL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_SET_POF_FLAG4_Pos)

#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_FSM_CS_Pos                                                                      16U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_FSM_CS_Msk                                                                      (0x7UL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_FSM_CS_Pos)

#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG4_Pos                                                                   19U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG4_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG4_Pos)

#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG3_Pos                                                                   20U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG3_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG3_Pos)

#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG2_Pos                                                                   21U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG2_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG2_Pos)

#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG1_Pos                                                                   22U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG1_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_POF_FLAG1_Pos)

#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG4_Pos                                                                   23U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG4_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG4_Pos)

#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG3_Pos                                                                   24U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG3_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG3_Pos)

#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG2_Pos                                                                   25U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG2_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG2_Pos)

#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG1_Pos                                                                   26U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG1_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_PON_FLAG1_Pos)

#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_DIV_CLK_Pos                                                                     27U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_DIV_CLK_Msk                                                                     (0x7UL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_DIV_CLK_Pos)

#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_CLK_GATED_Pos                                                                   30U
#define AON_REG_SYSTEM_REG22X_LDO_PA_POS_CLK_GATED_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG22X_LDO_PA_POS_CLK_GATED_Pos)

#define AON_REG_SYSTEM_REG22X_RESERVED_Pos                                                                               31U
#define AON_REG_SYSTEM_REG22X_RESERVED_Msk                                                                               (0x1UL << AON_REG_SYSTEM_REG22X_RESERVED_Pos)

/* 0x5C     0x4000_005c
    0       R/W     REG_SCAN_MODE                                               1'b0
    1       R/W     SPC_DISABLE                                                 1'b0
    2       R/W     COMP_EN                                                     1'b0
    3       R/W     PLL_BYPASS                                                  1'b0
    6:4     R/W     FT_MODE                                                     3'h0
    8:7     R/W     DEBUG_EN                                                    2'h0
    11:9    R/W     OCC_DEBUG_CLK_SEL0                                          3'h0
    14:12   R/W     OCC_DEBUG_CLK_SEL1                                          3'h0
    15      R/W     FT_14PIN_CASE_EN                                            1'b0
    16      R/W     SCAN_AT_SPEED_DBG_EN_USBPHY                                 1'b0
    17      R/W     FT_14PIN_CASE2_EN                                           1'b0
    18      R/W     SCAN_TDF_40M_LV_TEST_EN                                     1'b0
    31:19   R/W     RSVD                                                        13'h0
 */
typedef union _AON_REG_SYSTEM_REG23X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG_SCAN_MODE: 1;
        uint32_t SPC_DISABLE: 1;
        uint32_t COMP_EN: 1;
        uint32_t PLL_BYPASS: 1;
        uint32_t FT_MODE: 3;
        uint32_t DEBUG_EN: 2;
        uint32_t OCC_DEBUG_CLK_SEL0: 3;
        uint32_t OCC_DEBUG_CLK_SEL1: 3;
        uint32_t FT_14PIN_CASE_EN: 1;
        uint32_t SCAN_AT_SPEED_DBG_EN_USBPHY: 1;
        uint32_t FT_14PIN_CASE2_EN: 1;
        uint32_t SCAN_TDF_40M_LV_TEST_EN: 1;
        uint32_t RSVD: 13;
    };
} AON_REG_SYSTEM_REG23X_TYPE;

/*0x4000_005c AON_REG_SYSTEM_REG23X*/
#define AON_REG_SYSTEM_REG23X_REG_SCAN_MODE_Pos                                                                          0U
#define AON_REG_SYSTEM_REG23X_REG_SCAN_MODE_Msk                                                                          (0x1UL << AON_REG_SYSTEM_REG23X_REG_SCAN_MODE_Pos)

#define AON_REG_SYSTEM_REG23X_SPC_DISABLE_Pos                                                                            1U
#define AON_REG_SYSTEM_REG23X_SPC_DISABLE_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG23X_SPC_DISABLE_Pos)

#define AON_REG_SYSTEM_REG23X_COMP_EN_Pos                                                                                2U
#define AON_REG_SYSTEM_REG23X_COMP_EN_Msk                                                                                (0x1UL << AON_REG_SYSTEM_REG23X_COMP_EN_Pos)

#define AON_REG_SYSTEM_REG23X_PLL_BYPASS_Pos                                                                             3U
#define AON_REG_SYSTEM_REG23X_PLL_BYPASS_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG23X_PLL_BYPASS_Pos)

