rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG23X_FT_MODE_Pos                                                                                4U
#define AON_REG_SYSTEM_REG23X_FT_MODE_Msk                                                                                (0x7UL << AON_REG_SYSTEM_REG23X_FT_MODE_Pos)

#define AON_REG_SYSTEM_REG23X_DEBUG_EN_Pos                                                                               7U
#define AON_REG_SYSTEM_REG23X_DEBUG_EN_Msk                                                                               (0x3UL << AON_REG_SYSTEM_REG23X_DEBUG_EN_Pos)

#define AON_REG_SYSTEM_REG23X_OCC_DEBUG_CLK_SEL0_Pos                                                                     9U
#define AON_REG_SYSTEM_REG23X_OCC_DEBUG_CLK_SEL0_Msk                                                                     (0x7UL << AON_REG_SYSTEM_REG23X_OCC_DEBUG_CLK_SEL0_Pos)

#define AON_REG_SYSTEM_REG23X_OCC_DEBUG_CLK_SEL1_Pos                                                                     12U
#define AON_REG_SYSTEM_REG23X_OCC_DEBUG_CLK_SEL1_Msk                                                                     (0x7UL << AON_REG_SYSTEM_REG23X_OCC_DEBUG_CLK_SEL1_Pos)

#define AON_REG_SYSTEM_REG23X_FT_14PIN_CASE_EN_Pos                                                                       15U
#define AON_REG_SYSTEM_REG23X_FT_14PIN_CASE_EN_Msk                                                                       (0x1UL << AON_REG_SYSTEM_REG23X_FT_14PIN_CASE_EN_Pos)

#define AON_REG_SYSTEM_REG23X_SCAN_AT_SPEED_DBG_EN_USBPHY_Pos                                                            16U
#define AON_REG_SYSTEM_REG23X_SCAN_AT_SPEED_DBG_EN_USBPHY_Msk                                                            (0x1UL << AON_REG_SYSTEM_REG23X_SCAN_AT_SPEED_DBG_EN_USBPHY_Pos)

#define AON_REG_SYSTEM_REG23X_FT_14PIN_CASE2_EN_Pos                                                                      17U
#define AON_REG_SYSTEM_REG23X_FT_14PIN_CASE2_EN_Msk                                                                      (0x1UL << AON_REG_SYSTEM_REG23X_FT_14PIN_CASE2_EN_Pos)

#define AON_REG_SYSTEM_REG23X_SCAN_TDF_40M_LV_TEST_EN_Pos                                                                18U
#define AON_REG_SYSTEM_REG23X_SCAN_TDF_40M_LV_TEST_EN_Msk                                                                (0x1UL << AON_REG_SYSTEM_REG23X_SCAN_TDF_40M_LV_TEST_EN_Pos)

#define AON_REG_SYSTEM_REG23X_RSVD_Pos                                                                                   19U
#define AON_REG_SYSTEM_REG23X_RSVD_Msk                                                                                   (0x1FFFUL << AON_REG_SYSTEM_REG23X_RSVD_Pos)

/* 0x60     0x4000_0060
    0       R/W     SDM_CLK_SRC_SEL                                             1'b0
    1       R/W     SDM32K_RSTN                                                 1'b1
    31:2    R/W     RSVD                                                        30'h0
 */
typedef union _AON_REG_SYSTEM_REG24X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SDM_CLK_SRC_SEL: 1;
        uint32_t SDM32K_RSTN: 1;
        uint32_t RSVD: 30;
    };
} AON_REG_SYSTEM_REG24X_TYPE;

/*0x4000_0060 AON_REG_SYSTEM_REG24X*/
#define AON_REG_SYSTEM_REG24X_SDM_CLK_SRC_SEL_Pos                                                                        0U
#define AON_REG_SYSTEM_REG24X_SDM_CLK_SRC_SEL_Msk                                                                        (0x1UL << AON_REG_SYSTEM_REG24X_SDM_CLK_SRC_SEL_Pos)

#define AON_REG_SYSTEM_REG24X_SDM32K_RSTN_Pos                                                                            1U
#define AON_REG_SYSTEM_REG24X_SDM32K_RSTN_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG24X_SDM32K_RSTN_Pos)

#define AON_REG_SYSTEM_REG24X_RSVD_Pos                                                                                   2U
#define AON_REG_SYSTEM_REG24X_RSVD_Msk                                                                                   (0x3FFFFFFFUL << AON_REG_SYSTEM_REG24X_RSVD_Pos)

/* 0x64     0x4000_0064
    19:0    R/W     RESERVED_1                                                  20'h0
    21:20   R/W     CACHE_AS_DATA_SRAM_EN                                       2'b0
    22      R/W     EFLASH_PC_VDD_EN                                            1'b1
    23      R       RESERVED                                                    1'b0
    24      R/W     WAIT_SPIC_PDEX_ACK                                          1'b0
    25      R       SPIC_PDEX_ACK                                               1'b0
    26      R/W     SPIC_PDEX_CMD                                               1'b0
    27      R/W     SPIC_PDEX_REQ                                               1'b0
    28      R/W     WAIT_EFLASH_ACCPEPTN                                        1'b0
    29      R       EFLASH_ACCPEPTN                                             1'b0
    30      R/W     EFLASH_REQN                                                 1'b0
    31      R/W     EFLASH_LVCTL_PCSM                                           1'b1
 */
typedef union _AON_REG_SYSTEM_REG25X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_1: 20;
        uint32_t CACHE_AS_DATA_SRAM_EN: 2;
        uint32_t EFLASH_PC_VDD_EN: 1;
        uint32_t RESERVED: 1;
        uint32_t WAIT_SPIC_PDEX_ACK: 1;
        uint32_t SPIC_PDEX_ACK: 1;
        uint32_t SPIC_PDEX_CMD: 1;
        uint32_t SPIC_PDEX_REQ: 1;
        uint32_t WAIT_EFLASH_ACCPEPTN: 1;
        uint32_t EFLASH_ACCPEPTN: 1;
        uint32_t EFLASH_REQN: 1;
        uint32_t EFLASH_LVCTL_PCSM: 1;
    };
} AON_REG_SYSTEM_REG25X_TYPE;

/*0x4000_0064 AON_REG_SYSTEM_REG25X*/
#define AON_REG_SYSTEM_REG25X_RESERVED_1_Pos                                                                             0U
#define AON_REG_SYSTEM_REG25X_RESERVED_1_Msk                                                                             (0xFFFFFUL << AON_REG_SYSTEM_REG25X_RESERVED_1_Pos)

#define AON_REG_SYSTEM_REG25X_CACHE_AS_DATA_SRAM_EN_Pos                                                                  20U
#define AON_REG_SYSTEM_REG25X_CACHE_AS_DATA_SRAM_EN_Msk                                                                  (0x3UL << AON_REG_SYSTEM_REG25X_CACHE_AS_DATA_SRAM_EN_Pos)

#define AON_REG_SYSTEM_REG25X_EFLASH_PC_VDD_EN_Pos                                                                       22U
#define AON_REG_SYSTEM_REG25X_EFLASH_PC_VDD_EN_Msk                                                                       (0x1UL << AON_REG_SYSTEM_REG25X_EFLASH_PC_VDD_EN_Pos)

#define AON_REG_SYSTEM_REG25X_RESERVED_Pos                                                                               23U
#define AON_REG_SYSTEM_REG25X_RESERVED_Msk                                                                               (0x1UL << AON_REG_SYSTEM_REG25X_RESERVED_Pos)

