rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG25X_WAIT_SPIC_PDEX_ACK_Pos                                                                     24U
#define AON_REG_SYSTEM_REG25X_WAIT_SPIC_PDEX_ACK_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG25X_WAIT_SPIC_PDEX_ACK_Pos)

#define AON_REG_SYSTEM_REG25X_SPIC_PDEX_ACK_Pos                                                                          25U
#define AON_REG_SYSTEM_REG25X_SPIC_PDEX_ACK_Msk                                                                          (0x1UL << AON_REG_SYSTEM_REG25X_SPIC_PDEX_ACK_Pos)

#define AON_REG_SYSTEM_REG25X_SPIC_PDEX_CMD_Pos                                                                          26U
#define AON_REG_SYSTEM_REG25X_SPIC_PDEX_CMD_Msk                                                                          (0x1UL << AON_REG_SYSTEM_REG25X_SPIC_PDEX_CMD_Pos)

#define AON_REG_SYSTEM_REG25X_SPIC_PDEX_REQ_Pos                                                                          27U
#define AON_REG_SYSTEM_REG25X_SPIC_PDEX_REQ_Msk                                                                          (0x1UL << AON_REG_SYSTEM_REG25X_SPIC_PDEX_REQ_Pos)

#define AON_REG_SYSTEM_REG25X_WAIT_EFLASH_ACCPEPTN_Pos                                                                   28U
#define AON_REG_SYSTEM_REG25X_WAIT_EFLASH_ACCPEPTN_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG25X_WAIT_EFLASH_ACCPEPTN_Pos)

#define AON_REG_SYSTEM_REG25X_EFLASH_ACCPEPTN_Pos                                                                        29U
#define AON_REG_SYSTEM_REG25X_EFLASH_ACCPEPTN_Msk                                                                        (0x1UL << AON_REG_SYSTEM_REG25X_EFLASH_ACCPEPTN_Pos)

#define AON_REG_SYSTEM_REG25X_EFLASH_REQN_Pos                                                                            30U
#define AON_REG_SYSTEM_REG25X_EFLASH_REQN_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG25X_EFLASH_REQN_Pos)

#define AON_REG_SYSTEM_REG25X_EFLASH_LVCTL_PCSM_Pos                                                                      31U
#define AON_REG_SYSTEM_REG25X_EFLASH_LVCTL_PCSM_Msk                                                                      (0x1UL << AON_REG_SYSTEM_REG25X_EFLASH_LVCTL_PCSM_Pos)

/* 0x68     0x4000_0068
    0       R/W     REG0X_AON_SYS_DUMMY_0                                       1'b1
    1       R/W     RESERVED_1                                                  1'b0
    2       R/W     WAIT_VDDCORE_POR_DET                                        1'b0
    11:3    R/W     REG0X_AON_SYS_DUMMY_15_3                                    9'h0
    12      R/W     FORCE_QACTIVE_PLL1                                          1'b0
    13      R       CLKEN_O_CLKCTRL_OSC10M_VPON                                 1'b1
    14      R       CLKEN_O_CLKCTRL_OSC10M                                      1'b0
    15      R       CLKEN_O_CLKCTRL_OSC128K_VPON                                1'b0
    16      R       CLKEN_O_CLKCTRL_OSC128K                                     1'b0
    31:17   R       RESERVED                                                    15'h0
 */
typedef union _AON_REG_SYSTEM_REG26X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG0X_AON_SYS_DUMMY_0: 1;
        uint32_t RESERVED_1: 1;
        uint32_t WAIT_VDDCORE_POR_DET: 1;
        uint32_t REG0X_AON_SYS_DUMMY_15_3: 9;
        uint32_t FORCE_QACTIVE_PLL1: 1;
        uint32_t CLKEN_O_CLKCTRL_OSC10M_VPON: 1;
        uint32_t CLKEN_O_CLKCTRL_OSC10M: 1;
        uint32_t CLKEN_O_CLKCTRL_OSC128K_VPON: 1;
        uint32_t CLKEN_O_CLKCTRL_OSC128K: 1;
        uint32_t RESERVED: 15;
    };
} AON_REG_SYSTEM_REG26X_TYPE;

/*0x4000_0068 AON_REG_SYSTEM_REG26X*/
#define AON_REG_SYSTEM_REG26X_REG0X_AON_SYS_DUMMY_0_Pos                                                                  0U
#define AON_REG_SYSTEM_REG26X_REG0X_AON_SYS_DUMMY_0_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG26X_REG0X_AON_SYS_DUMMY_0_Pos)

#define AON_REG_SYSTEM_REG26X_RESERVED_1_Pos                                                                             1U
#define AON_REG_SYSTEM_REG26X_RESERVED_1_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG26X_RESERVED_1_Pos)

#define AON_REG_SYSTEM_REG26X_WAIT_VDDCORE_POR_DET_Pos                                                                   2U
#define AON_REG_SYSTEM_REG26X_WAIT_VDDCORE_POR_DET_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG26X_WAIT_VDDCORE_POR_DET_Pos)

#define AON_REG_SYSTEM_REG26X_REG0X_AON_SYS_DUMMY_15_3_Pos                                                               3U
#define AON_REG_SYSTEM_REG26X_REG0X_AON_SYS_DUMMY_15_3_Msk                                                               (0x1FFUL << AON_REG_SYSTEM_REG26X_REG0X_AON_SYS_DUMMY_15_3_Pos)

#define AON_REG_SYSTEM_REG26X_FORCE_QACTIVE_PLL1_Pos                                                                     12U
#define AON_REG_SYSTEM_REG26X_FORCE_QACTIVE_PLL1_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG26X_FORCE_QACTIVE_PLL1_Pos)

#define AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC10M_VPON_Pos                                                            13U
#define AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC10M_VPON_Msk                                                            (0x1UL << AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC10M_VPON_Pos)

#define AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC10M_Pos                                                                 14U
#define AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC10M_Msk                                                                 (0x1UL << AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC10M_Pos)

#define AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC128K_VPON_Pos                                                           15U
#define AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC128K_VPON_Msk                                                           (0x1UL << AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC128K_VPON_Pos)

#define AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC128K_Pos                                                                16U
#define AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC128K_Msk                                                                (0x1UL << AON_REG_SYSTEM_REG26X_CLKEN_O_CLKCTRL_OSC128K_Pos)

