rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG26X_RESERVED_Pos                                                                               17U
#define AON_REG_SYSTEM_REG26X_RESERVED_Msk                                                                               (0x7FFFUL << AON_REG_SYSTEM_REG26X_RESERVED_Pos)

/* 0x6C     0x4000_006c
    0       R/W     LPC_DEB_SEL                                                 1'b0
    3:1     R/W     AON_DBG_SCH_PLAN_SEL                                        3'b000
    4       W1O     REG_AON_W1O_HB_FUNC_DIS                                     1'b0
    9:5     R/W     AON_DBG_SEL                                                 5'b00000
    11:10   R/W     OSC_DEB_CLK_SEL                                             2'b00
    15:12   R/W     AON_DBG_C_KOUT_POS_SEL                                      4'b0
    19:16   R/W     AON_DBG_C_KOUT_SIMO_SEL                                     4'b0000
    20      R/W     EN_RESTART_NO_CLK                                           1'b0
    21      R/W     PINMUX_AUXTEST_SEL                                          1'b0
    22      R/W     SWR_BY_CORE                                                 1'b0
    23      W1O     REG_AON_W1O_LE4M_FUNC_DIS                                   1'b0
    24      W1O     REG_AON_W1O_PAWR_FUNC_DIS                                   1'b0
    25      W1O     REG_AON_W1O_PA_FUNC_DIS                                     1'b0
    29:26   R       RO_WK_RESULT                                                4'h8
    31:30   R       RESERVED                                                    2'h0
 */
typedef union _AON_REG_SYSTEM_REG27X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPC_DEB_SEL: 1;
        uint32_t AON_DBG_SCH_PLAN_SEL: 3;
        uint32_t REG_AON_W1O_HB_FUNC_DIS: 1;
        uint32_t AON_DBG_SEL: 5;
        uint32_t OSC_DEB_CLK_SEL: 2;
        uint32_t AON_DBG_C_KOUT_POS_SEL: 4;
        uint32_t AON_DBG_C_KOUT_SIMO_SEL: 4;
        uint32_t EN_RESTART_NO_CLK: 1;
        uint32_t PINMUX_AUXTEST_SEL: 1;
        uint32_t SWR_BY_CORE: 1;
        uint32_t REG_AON_W1O_LE4M_FUNC_DIS: 1;
        uint32_t REG_AON_W1O_PAWR_FUNC_DIS: 1;
        uint32_t REG_AON_W1O_PA_FUNC_DIS: 1;
        uint32_t RO_WK_RESULT: 4;
        uint32_t RESERVED: 2;
    };
} AON_REG_SYSTEM_REG27X_TYPE;

/*0x4000_006c AON_REG_SYSTEM_REG27X*/
#define AON_REG_SYSTEM_REG27X_LPC_DEB_SEL_Pos                                                                            0U
#define AON_REG_SYSTEM_REG27X_LPC_DEB_SEL_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG27X_LPC_DEB_SEL_Pos)

#define AON_REG_SYSTEM_REG27X_AON_DBG_SCH_PLAN_SEL_Pos                                                                   1U
#define AON_REG_SYSTEM_REG27X_AON_DBG_SCH_PLAN_SEL_Msk                                                                   (0x7UL << AON_REG_SYSTEM_REG27X_AON_DBG_SCH_PLAN_SEL_Pos)

#define AON_REG_SYSTEM_REG27X_REG_AON_W1O_HB_FUNC_DIS_Pos                                                                4U
#define AON_REG_SYSTEM_REG27X_REG_AON_W1O_HB_FUNC_DIS_Msk                                                                (0x1UL << AON_REG_SYSTEM_REG27X_REG_AON_W1O_HB_FUNC_DIS_Pos)

#define AON_REG_SYSTEM_REG27X_AON_DBG_SEL_Pos                                                                            5U
#define AON_REG_SYSTEM_REG27X_AON_DBG_SEL_Msk                                                                            (0x1FUL << AON_REG_SYSTEM_REG27X_AON_DBG_SEL_Pos)

#define AON_REG_SYSTEM_REG27X_OSC_DEB_CLK_SEL_Pos                                                                        10U
#define AON_REG_SYSTEM_REG27X_OSC_DEB_CLK_SEL_Msk                                                                        (0x3UL << AON_REG_SYSTEM_REG27X_OSC_DEB_CLK_SEL_Pos)

#define AON_REG_SYSTEM_REG27X_AON_DBG_C_KOUT_POS_SEL_Pos                                                                 12U
#define AON_REG_SYSTEM_REG27X_AON_DBG_C_KOUT_POS_SEL_Msk                                                                 (0xFUL << AON_REG_SYSTEM_REG27X_AON_DBG_C_KOUT_POS_SEL_Pos)

#define AON_REG_SYSTEM_REG27X_AON_DBG_C_KOUT_SIMO_SEL_Pos                                                                16U
#define AON_REG_SYSTEM_REG27X_AON_DBG_C_KOUT_SIMO_SEL_Msk                                                                (0xFUL << AON_REG_SYSTEM_REG27X_AON_DBG_C_KOUT_SIMO_SEL_Pos)

#define AON_REG_SYSTEM_REG27X_EN_RESTART_NO_CLK_Pos                                                                      20U
#define AON_REG_SYSTEM_REG27X_EN_RESTART_NO_CLK_Msk                                                                      (0x1UL << AON_REG_SYSTEM_REG27X_EN_RESTART_NO_CLK_Pos)

#define AON_REG_SYSTEM_REG27X_PINMUX_AUXTEST_SEL_Pos                                                                     21U
#define AON_REG_SYSTEM_REG27X_PINMUX_AUXTEST_SEL_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG27X_PINMUX_AUXTEST_SEL_Pos)

#define AON_REG_SYSTEM_REG27X_SWR_BY_CORE_Pos                                                                            22U
#define AON_REG_SYSTEM_REG27X_SWR_BY_CORE_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG27X_SWR_BY_CORE_Pos)

#define AON_REG_SYSTEM_REG27X_REG_AON_W1O_LE4M_FUNC_DIS_Pos                                                              23U
#define AON_REG_SYSTEM_REG27X_REG_AON_W1O_LE4M_FUNC_DIS_Msk                                                              (0x1UL << AON_REG_SYSTEM_REG27X_REG_AON_W1O_LE4M_FUNC_DIS_Pos)

#define AON_REG_SYSTEM_REG27X_REG_AON_W1O_PAWR_FUNC_DIS_Pos                                                              24U
#define AON_REG_SYSTEM_REG27X_REG_AON_W1O_PAWR_FUNC_DIS_Msk                                                              (0x1UL << AON_REG_SYSTEM_REG27X_REG_AON_W1O_PAWR_FUNC_DIS_Pos)

#define AON_REG_SYSTEM_REG27X_REG_AON_W1O_PA_FUNC_DIS_Pos                                                                25U
#define AON_REG_SYSTEM_REG27X_REG_AON_W1O_PA_FUNC_DIS_Msk                                                                (0x1UL << AON_REG_SYSTEM_REG27X_REG_AON_W1O_PA_FUNC_DIS_Pos)

#define AON_REG_SYSTEM_REG27X_RO_WK_RESULT_Pos                                                                           26U
#define AON_REG_SYSTEM_REG27X_RO_WK_RESULT_Msk                                                                           (0xFUL << AON_REG_SYSTEM_REG27X_RO_WK_RESULT_Pos)

