rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG27X_RESERVED_Pos                                                                               30U
#define AON_REG_SYSTEM_REG27X_RESERVED_Msk                                                                               (0x3UL << AON_REG_SYSTEM_REG27X_RESERVED_Pos)

/* 0x70     0x4000_0070
    15:0    R       RESERVED_8                                                  16'h0
    20:16   R/W     RESERVED_7                                                  5'd0
    21      R/W     RESERVED_6                                                  1'b0
    22      R/W     RESERVED_5                                                  1'b0
    23      R/W     RESERVED_4                                                  1'b0
    28:24   R       RESERVED_3                                                  5'b11111
    29      R       RESERVED_2                                                  1'b0
    30      R       RESERVED_1                                                  1'b0
    31      R       RESERVED                                                    1'b0
 */
typedef union _AON_REG_SYSTEM_REG28X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_8: 16;
        uint32_t RESERVED_7: 5;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 5;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
    };
} AON_REG_SYSTEM_REG28X_TYPE;

/*0x4000_0070 AON_REG_SYSTEM_REG28X*/
#define AON_REG_SYSTEM_REG28X_RESERVED_8_Pos                                                                             0U
#define AON_REG_SYSTEM_REG28X_RESERVED_8_Msk                                                                             (0xFFFFUL << AON_REG_SYSTEM_REG28X_RESERVED_8_Pos)

#define AON_REG_SYSTEM_REG28X_RESERVED_7_Pos                                                                             16U
#define AON_REG_SYSTEM_REG28X_RESERVED_7_Msk                                                                             (0x1FUL << AON_REG_SYSTEM_REG28X_RESERVED_7_Pos)

#define AON_REG_SYSTEM_REG28X_RESERVED_6_Pos                                                                             21U
#define AON_REG_SYSTEM_REG28X_RESERVED_6_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG28X_RESERVED_6_Pos)

#define AON_REG_SYSTEM_REG28X_RESERVED_5_Pos                                                                             22U
#define AON_REG_SYSTEM_REG28X_RESERVED_5_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG28X_RESERVED_5_Pos)

#define AON_REG_SYSTEM_REG28X_RESERVED_4_Pos                                                                             23U
#define AON_REG_SYSTEM_REG28X_RESERVED_4_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG28X_RESERVED_4_Pos)

#define AON_REG_SYSTEM_REG28X_RESERVED_3_Pos                                                                             24U
#define AON_REG_SYSTEM_REG28X_RESERVED_3_Msk                                                                             (0x1FUL << AON_REG_SYSTEM_REG28X_RESERVED_3_Pos)

#define AON_REG_SYSTEM_REG28X_RESERVED_2_Pos                                                                             29U
#define AON_REG_SYSTEM_REG28X_RESERVED_2_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG28X_RESERVED_2_Pos)

#define AON_REG_SYSTEM_REG28X_RESERVED_1_Pos                                                                             30U
#define AON_REG_SYSTEM_REG28X_RESERVED_1_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG28X_RESERVED_1_Pos)

#define AON_REG_SYSTEM_REG28X_RESERVED_Pos                                                                               31U
#define AON_REG_SYSTEM_REG28X_RESERVED_Msk                                                                               (0x1UL << AON_REG_SYSTEM_REG28X_RESERVED_Pos)

/* 0x74     0x4000_0074
    0       R/W     SHORT_PULSE_WKUP                                            1'b0
    1       R/W     EN_PAD_SYSTEM_ON_WAKEUP                                     1'b0
    2       R       RESERVED_5                                                  1'b0
    3       R       WKUP_SHORT_STS_PPU                                          1'b0
    4       R       WKUP_SHORT_STS_INTR                                         1'b0
    5       R       WKUP_SHORT_STS_RAP                                          1'b0
    6       R/W1C   GPIO_INTR_PORT                                              1'b0
    7       R       WKUP_SHORT_STS_WKIE                                         1'b0
    13:8    R       RESERVED_4                                                  6'b0
    14      R       RESERVED_3                                                  1'b0
    15      R       RESERVED_2                                                  1'b1
    19:16   R       WAKEUP_GROUP_INT_EN                                         4'hF
    20      R/W     WKUP_INT_EN                                                 1'b0
    21      R/W     GPIO_PORT_INT_EN                                            1'b0
    23:22   R       RESERVED_1                                                  2'h0
    24      R/W     DUMMY74_B24                                                 1'b1
    28:25   R       RESERVED                                                    4'h0
    31:29   R/W     AON_DBG_PCK600_SEL                                          3'b00
 */
typedef union _AON_REG_SYSTEM_REG29X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SHORT_PULSE_WKUP: 1;
        uint32_t EN_PAD_SYSTEM_ON_WAKEUP: 1;
        uint32_t RESERVED_5: 1;
        uint32_t WKUP_SHORT_STS_PPU: 1;
        uint32_t WKUP_SHORT_STS_INTR: 1;
        uint32_t WKUP_SHORT_STS_RAP: 1;
        uint32_t GPIO_INTR_PORT: 1;
        uint32_t WKUP_SHORT_STS_WKIE: 1;
        uint32_t RESERVED_4: 6;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t WAKEUP_GROUP_INT_EN: 4;
        uint32_t WKUP_INT_EN: 1;
        uint32_t GPIO_PORT_INT_EN: 1;
        uint32_t RESERVED_1: 2;
        uint32_t DUMMY74_B24: 1;
        uint32_t RESERVED: 4;
        uint32_t AON_DBG_PCK600_SEL: 3;
    };
} AON_REG_SYSTEM_REG29X_TYPE;

/*0x4000_0074 AON_REG_SYSTEM_REG29X*/
#define AON_REG_SYSTEM_REG29X_SHORT_PULSE_WKUP_Pos                                                                       0U
#define AON_REG_SYSTEM_REG29X_SHORT_PULSE_WKUP_Msk                                                                       (0x1UL << AON_REG_SYSTEM_REG29X_SHORT_PULSE_WKUP_Pos)

#define AON_REG_SYSTEM_REG29X_EN_PAD_SYSTEM_ON_WAKEUP_Pos                                                                1U
#define AON_REG_SYSTEM_REG29X_EN_PAD_SYSTEM_ON_WAKEUP_Msk                                                                (0x1UL << AON_REG_SYSTEM_REG29X_EN_PAD_SYSTEM_ON_WAKEUP_Pos)

#define AON_REG_SYSTEM_REG29X_RESERVED_5_Pos                                                                             2U
#define AON_REG_SYSTEM_REG29X_RESERVED_5_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG29X_RESERVED_5_Pos)

