rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_PPU_Pos                                                                     3U
#define AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_PPU_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_PPU_Pos)

#define AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_INTR_Pos                                                                    4U
#define AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_INTR_Msk                                                                    (0x1UL << AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_INTR_Pos)

#define AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_RAP_Pos                                                                     5U
#define AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_RAP_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_RAP_Pos)

#define AON_REG_SYSTEM_REG29X_GPIO_INTR_PORT_Pos                                                                         6U
#define AON_REG_SYSTEM_REG29X_GPIO_INTR_PORT_Msk                                                                         (0x1UL << AON_REG_SYSTEM_REG29X_GPIO_INTR_PORT_Pos)

#define AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_WKIE_Pos                                                                    7U
#define AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_WKIE_Msk                                                                    (0x1UL << AON_REG_SYSTEM_REG29X_WKUP_SHORT_STS_WKIE_Pos)

#define AON_REG_SYSTEM_REG29X_RESERVED_4_Pos                                                                             8U
#define AON_REG_SYSTEM_REG29X_RESERVED_4_Msk                                                                             (0x3FUL << AON_REG_SYSTEM_REG29X_RESERVED_4_Pos)

#define AON_REG_SYSTEM_REG29X_RESERVED_3_Pos                                                                             14U
#define AON_REG_SYSTEM_REG29X_RESERVED_3_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG29X_RESERVED_3_Pos)

#define AON_REG_SYSTEM_REG29X_RESERVED_2_Pos                                                                             15U
#define AON_REG_SYSTEM_REG29X_RESERVED_2_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG29X_RESERVED_2_Pos)

#define AON_REG_SYSTEM_REG29X_WAKEUP_GROUP_INT_EN_Pos                                                                    16U
#define AON_REG_SYSTEM_REG29X_WAKEUP_GROUP_INT_EN_Msk                                                                    (0xFUL << AON_REG_SYSTEM_REG29X_WAKEUP_GROUP_INT_EN_Pos)

#define AON_REG_SYSTEM_REG29X_WKUP_INT_EN_Pos                                                                            20U
#define AON_REG_SYSTEM_REG29X_WKUP_INT_EN_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG29X_WKUP_INT_EN_Pos)

#define AON_REG_SYSTEM_REG29X_GPIO_PORT_INT_EN_Pos                                                                       21U
#define AON_REG_SYSTEM_REG29X_GPIO_PORT_INT_EN_Msk                                                                       (0x1UL << AON_REG_SYSTEM_REG29X_GPIO_PORT_INT_EN_Pos)

#define AON_REG_SYSTEM_REG29X_RESERVED_1_Pos                                                                             22U
#define AON_REG_SYSTEM_REG29X_RESERVED_1_Msk                                                                             (0x3UL << AON_REG_SYSTEM_REG29X_RESERVED_1_Pos)

#define AON_REG_SYSTEM_REG29X_DUMMY74_B24_Pos                                                                            24U
#define AON_REG_SYSTEM_REG29X_DUMMY74_B24_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG29X_DUMMY74_B24_Pos)

#define AON_REG_SYSTEM_REG29X_RESERVED_Pos                                                                               25U
#define AON_REG_SYSTEM_REG29X_RESERVED_Msk                                                                               (0xFUL << AON_REG_SYSTEM_REG29X_RESERVED_Pos)

#define AON_REG_SYSTEM_REG29X_AON_DBG_PCK600_SEL_Pos                                                                     29U
#define AON_REG_SYSTEM_REG29X_AON_DBG_PCK600_SEL_Msk                                                                     (0x7UL << AON_REG_SYSTEM_REG29X_AON_DBG_PCK600_SEL_Pos)

/* 0x78     0x4000_0078
    0       R/W     MODEM_AUTO_BUS_SW_EN                                        1'b0
    5:1     R/W     RESERVED_1                                                  5'h0
    6       R/W     SRAM_AMU_SETTING_SEL                                        1'b0
    12:7    R/W     EXTRA_DELAY_XTAL40                                          6'b000000
    20:13   R/W     EXTRA_DELAY_OSC128                                          8'b00000000
    21      R/W     SRAM_SETTING_SEL                                            1'b0
    22      R/W     LATCH_WKUP_REASON                                           1'b0
    23      R/W     EN_ENTER_SHIP_MODE                                          1'b0
    24      R/W     SCHEDULE_PLAN_INPUT_CLK_SW                                  1'b0
    25      R/W     WAIT_PAD_AUTO_SW_RET_DONE                                   1'b0
    26      R       PAD_AUTO_SW_RET_DONE                                        1'b0
    27      R/W     PAD_AUTO_SW_EN_RET                                          1'b0
    28      R/W     WAIT_PAD_AUTO_SW_PD_RET_DONE                                1'b0
    29      R       PAD_AUTO_SW_PD_RET_DONE                                     1'b0
    30      R/W     PAD_AUTO_SW_PD_EN_RET                                       1'b0
    31      R/W     RESERVED                                                    1'b0
 */
typedef union _AON_REG_SYSTEM_REG30X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t MODEM_AUTO_BUS_SW_EN: 1;
        uint32_t RESERVED_1: 5;
        uint32_t SRAM_AMU_SETTING_SEL: 1;
        uint32_t EXTRA_DELAY_XTAL40: 6;
        uint32_t EXTRA_DELAY_OSC128: 8;
        uint32_t SRAM_SETTING_SEL: 1;
        uint32_t LATCH_WKUP_REASON: 1;
        uint32_t EN_ENTER_SHIP_MODE: 1;
        uint32_t SCHEDULE_PLAN_INPUT_CLK_SW: 1;
        uint32_t WAIT_PAD_AUTO_SW_RET_DONE: 1;
        uint32_t PAD_AUTO_SW_RET_DONE: 1;
        uint32_t PAD_AUTO_SW_EN_RET: 1;
        uint32_t WAIT_PAD_AUTO_SW_PD_RET_DONE: 1;
        uint32_t PAD_AUTO_SW_PD_RET_DONE: 1;
        uint32_t PAD_AUTO_SW_PD_EN_RET: 1;
        uint32_t RESERVED: 1;
    };
} AON_REG_SYSTEM_REG30X_TYPE;

/*0x4000_0078 AON_REG_SYSTEM_REG30X*/
#define AON_REG_SYSTEM_REG30X_MODEM_AUTO_BUS_SW_EN_Pos                                                                   0U
#define AON_REG_SYSTEM_REG30X_MODEM_AUTO_BUS_SW_EN_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG30X_MODEM_AUTO_BUS_SW_EN_Pos)

#define AON_REG_SYSTEM_REG30X_RESERVED_1_Pos                                                                             1U
#define AON_REG_SYSTEM_REG30X_RESERVED_1_Msk                                                                             (0x1FUL << AON_REG_SYSTEM_REG30X_RESERVED_1_Pos)

#define AON_REG_SYSTEM_REG30X_SRAM_AMU_SETTING_SEL_Pos                                                                   6U
#define AON_REG_SYSTEM_REG30X_SRAM_AMU_SETTING_SEL_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG30X_SRAM_AMU_SETTING_SEL_Pos)

#define AON_REG_SYSTEM_REG30X_EXTRA_DELAY_XTAL40_Pos                                                                     7U
#define AON_REG_SYSTEM_REG30X_EXTRA_DELAY_XTAL40_Msk                                                                     (0x3FUL << AON_REG_SYSTEM_REG30X_EXTRA_DELAY_XTAL40_Pos)

#define AON_REG_SYSTEM_REG30X_EXTRA_DELAY_OSC128_Pos                                                                     13U
#define AON_REG_SYSTEM_REG30X_EXTRA_DELAY_OSC128_Msk                                                                     (0xFFUL << AON_REG_SYSTEM_REG30X_EXTRA_DELAY_OSC128_Pos)

