rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG30X_SRAM_SETTING_SEL_Pos                                                                       21U
#define AON_REG_SYSTEM_REG30X_SRAM_SETTING_SEL_Msk                                                                       (0x1UL << AON_REG_SYSTEM_REG30X_SRAM_SETTING_SEL_Pos)

#define AON_REG_SYSTEM_REG30X_LATCH_WKUP_REASON_Pos                                                                      22U
#define AON_REG_SYSTEM_REG30X_LATCH_WKUP_REASON_Msk                                                                      (0x1UL << AON_REG_SYSTEM_REG30X_LATCH_WKUP_REASON_Pos)

#define AON_REG_SYSTEM_REG30X_EN_ENTER_SHIP_MODE_Pos                                                                     23U
#define AON_REG_SYSTEM_REG30X_EN_ENTER_SHIP_MODE_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG30X_EN_ENTER_SHIP_MODE_Pos)

#define AON_REG_SYSTEM_REG30X_SCHEDULE_PLAN_INPUT_CLK_SW_Pos                                                             24U
#define AON_REG_SYSTEM_REG30X_SCHEDULE_PLAN_INPUT_CLK_SW_Msk                                                             (0x1UL << AON_REG_SYSTEM_REG30X_SCHEDULE_PLAN_INPUT_CLK_SW_Pos)

#define AON_REG_SYSTEM_REG30X_WAIT_PAD_AUTO_SW_RET_DONE_Pos                                                              25U
#define AON_REG_SYSTEM_REG30X_WAIT_PAD_AUTO_SW_RET_DONE_Msk                                                              (0x1UL << AON_REG_SYSTEM_REG30X_WAIT_PAD_AUTO_SW_RET_DONE_Pos)

#define AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_RET_DONE_Pos                                                                   26U
#define AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_RET_DONE_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_RET_DONE_Pos)

#define AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_EN_RET_Pos                                                                     27U
#define AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_EN_RET_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_EN_RET_Pos)

#define AON_REG_SYSTEM_REG30X_WAIT_PAD_AUTO_SW_PD_RET_DONE_Pos                                                           28U
#define AON_REG_SYSTEM_REG30X_WAIT_PAD_AUTO_SW_PD_RET_DONE_Msk                                                           (0x1UL << AON_REG_SYSTEM_REG30X_WAIT_PAD_AUTO_SW_PD_RET_DONE_Pos)

#define AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_PD_RET_DONE_Pos                                                                29U
#define AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_PD_RET_DONE_Msk                                                                (0x1UL << AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_PD_RET_DONE_Pos)

#define AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_PD_EN_RET_Pos                                                                  30U
#define AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_PD_EN_RET_Msk                                                                  (0x1UL << AON_REG_SYSTEM_REG30X_PAD_AUTO_SW_PD_EN_RET_Pos)

#define AON_REG_SYSTEM_REG30X_RESERVED_Pos                                                                               31U
#define AON_REG_SYSTEM_REG30X_RESERVED_Msk                                                                               (0x1UL << AON_REG_SYSTEM_REG30X_RESERVED_Pos)

/* 0x7C     0x4000_007c
    0       R/W     RFPD_MANUAL_ENABLE                                          1'b0
    1       R/W     RFPD_MANUAL_VALUE                                           1'b0
    3:2     R/W     RESERVED_1                                                  2'h0
    4       R/W     PA_LNA_DEBUG_MODE_EN                                        1'b0
    31:5    R/W     RESERVED                                                    27'b0
 */
typedef union _AON_REG_SYSTEM_REG31X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RFPD_MANUAL_ENABLE: 1;
        uint32_t RFPD_MANUAL_VALUE: 1;
        uint32_t RESERVED_1: 2;
        uint32_t PA_LNA_DEBUG_MODE_EN: 1;
        uint32_t RESERVED: 27;
    };
} AON_REG_SYSTEM_REG31X_TYPE;

/*0x4000_007c AON_REG_SYSTEM_REG31X*/
#define AON_REG_SYSTEM_REG31X_RFPD_MANUAL_ENABLE_Pos                                                                     0U
#define AON_REG_SYSTEM_REG31X_RFPD_MANUAL_ENABLE_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG31X_RFPD_MANUAL_ENABLE_Pos)

#define AON_REG_SYSTEM_REG31X_RFPD_MANUAL_VALUE_Pos                                                                      1U
#define AON_REG_SYSTEM_REG31X_RFPD_MANUAL_VALUE_Msk                                                                      (0x1UL << AON_REG_SYSTEM_REG31X_RFPD_MANUAL_VALUE_Pos)

#define AON_REG_SYSTEM_REG31X_RESERVED_1_Pos                                                                             2U
#define AON_REG_SYSTEM_REG31X_RESERVED_1_Msk                                                                             (0x3UL << AON_REG_SYSTEM_REG31X_RESERVED_1_Pos)

#define AON_REG_SYSTEM_REG31X_PA_LNA_DEBUG_MODE_EN_Pos                                                                   4U
#define AON_REG_SYSTEM_REG31X_PA_LNA_DEBUG_MODE_EN_Msk                                                                   (0x1UL << AON_REG_SYSTEM_REG31X_PA_LNA_DEBUG_MODE_EN_Pos)

#define AON_REG_SYSTEM_REG31X_RESERVED_Pos                                                                               5U
#define AON_REG_SYSTEM_REG31X_RESERVED_Msk                                                                               (0x7FFFFFFUL << AON_REG_SYSTEM_REG31X_RESERVED_Pos)

/* 0x80     0x4000_0080
    0       R/W     RESERVED                                                    1'b0
    1       R/W     AMU_LITE2_START_PON_DVFS_AMU_PPU_VPON                       1'b0
    2       R       AMU_LITE0_APB_CTRL_SEL                                      1'b0
    3       R       AMU_LITE1_APB_CTRL_SEL                                      1'b0
    4       R       AMU_LITE2_APB_CTRL_SEL                                      1'b0
    5       R/W     AMU_LITE0_APB_CTRL_SEL_REQ_OSC80                            1'b0
    6       R/W     AMU_LITE1_APB_CTRL_SEL_REQ_XTAL40                           1'b0
    7       R/W     AMU_LITE2_APB_CTRL_SEL_REQ_OCS10                            1'b0
    8       R       AMU_LITE0_AMU_DONE_OSC80_CG                                 1'b0
    9       R       AMU_LITE0_AMU_DONE_OSC80                                    1'b0
    10      R/W     AMU_LITE0_START_PON_AMU_OSC80_CG                            1'b0
    11      R/W     AMU_LITE0_START_POF_AMU_OSC80_CG                            1'b0
    12      R/W     AMU_LITE0_START_PON_AMU_OSC80                               1'b0
    13      R/W     AMU_LITE0_START_POF_AMU_OSC80                               1'b0
    14      R       AMU_LITE1_AMU_DONE_PLL1                                     1'b0
    15      R       AMU_LITE1_AMU_DONE_XTAL40                                   1'b0
    16      R/W     AMU_LITE1_START_PON_AMU_PLL1                                1'b0
    17      R/W     AMU_LITE1_START_POF_AMU_PLL1                                1'b0
    18      R/W     AMU_LITE1_START_PON_AMU_XTAL40                              1'b0
    19      R/W     AMU_LITE1_START_POF_AMU_XTAL40                              1'b0
    20      R       AMU_LITE2_AMU_DONE_CORE_OP1                                 1'b0
    21      R       AMU_LITE2_AMU_DONE_PPU_VCORE1                               1'b0
    22      R       AMU_LITE2_AMU_DONE_PPU_VPON                                 1'b0
    23      R       AMU_LITE2_AMU_DONE_OSC10                                    1'b0
    24      R/W     AMU_LITE2_START_PON_AMU_CORE_OP1                            1'b0
    25      R/W     AMU_LITE2_START_POF_AMU_CORE_OP1                            1'b0
    26      R/W     AMU_LITE2_START_PON_AMU_PPU_VCORE1                          1'b0
    27      R/W     AMU_LITE2_START_POF_AMU_PPU_VCORE1                          1'b0
    28      R/W     AMU_LITE2_START_PON_AMU_PPU_VPON                            1'b0
    29      R/W     AMU_LITE2_START_POF_AMU_PPU_VPON                            1'b0
    30      R/W     AMU_LITE2_START_PON_AMU_OSC10                               1'b0
    31      R/W     AMU_LITE2_START_POF_AMU_OSC10                               1'b0
 */
typedef union _AON_REG_SYSTEM_REG32X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 1;
        uint32_t AMU_LITE2_START_PON_DVFS_AMU_PPU_VPON: 1;
        uint32_t AMU_LITE0_APB_CTRL_SEL: 1;
        uint32_t AMU_LITE1_APB_CTRL_SEL: 1;
        uint32_t AMU_LITE2_APB_CTRL_SEL: 1;
        uint32_t AMU_LITE0_APB_CTRL_SEL_REQ_OSC80: 1;
        uint32_t AMU_LITE1_APB_CTRL_SEL_REQ_XTAL40: 1;
        uint32_t AMU_LITE2_APB_CTRL_SEL_REQ_OCS10: 1;
        uint32_t AMU_LITE0_AMU_DONE_OSC80_CG: 1;
        uint32_t AMU_LITE0_AMU_DONE_OSC80: 1;
        uint32_t AMU_LITE0_START_PON_AMU_OSC80_CG: 1;
        uint32_t AMU_LITE0_START_POF_AMU_OSC80_CG: 1;
        uint32_t AMU_LITE0_START_PON_AMU_OSC80: 1;
        uint32_t AMU_LITE0_START_POF_AMU_OSC80: 1;
        uint32_t AMU_LITE1_AMU_DONE_PLL1: 1;
        uint32_t AMU_LITE1_AMU_DONE_XTAL40: 1;
        uint32_t AMU_LITE1_START_PON_AMU_PLL1: 1;
        uint32_t AMU_LITE1_START_POF_AMU_PLL1: 1;
        uint32_t AMU_LITE1_START_PON_AMU_XTAL40: 1;
        uint32_t AMU_LITE1_START_POF_AMU_XTAL40: 1;
        uint32_t AMU_LITE2_AMU_DONE_CORE_OP1: 1;
        uint32_t AMU_LITE2_AMU_DONE_PPU_VCORE1: 1;
        uint32_t AMU_LITE2_AMU_DONE_PPU_VPON: 1;
        uint32_t AMU_LITE2_AMU_DONE_OSC10: 1;
        uint32_t AMU_LITE2_START_PON_AMU_CORE_OP1: 1;
        uint32_t AMU_LITE2_START_POF_AMU_CORE_OP1: 1;
        uint32_t AMU_LITE2_START_PON_AMU_PPU_VCORE1: 1;
        uint32_t AMU_LITE2_START_POF_AMU_PPU_VCORE1: 1;
        uint32_t AMU_LITE2_START_PON_AMU_PPU_VPON: 1;
        uint32_t AMU_LITE2_START_POF_AMU_PPU_VPON: 1;
        uint32_t AMU_LITE2_START_PON_AMU_OSC10: 1;
        uint32_t AMU_LITE2_START_POF_AMU_OSC10: 1;
    };
} AON_REG_SYSTEM_REG32X_TYPE;

/*0x4000_0080 AON_REG_SYSTEM_REG32X*/
#define AON_REG_SYSTEM_REG32X_RESERVED_Pos                                                                               0U
#define AON_REG_SYSTEM_REG32X_RESERVED_Msk                                                                               (0x1UL << AON_REG_SYSTEM_REG32X_RESERVED_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_DVFS_AMU_PPU_VPON_Pos                                                  1U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_DVFS_AMU_PPU_VPON_Msk                                                  (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_DVFS_AMU_PPU_VPON_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE0_APB_CTRL_SEL_Pos                                                                 2U
#define AON_REG_SYSTEM_REG32X_AMU_LITE0_APB_CTRL_SEL_Msk                                                                 (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE0_APB_CTRL_SEL_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE1_APB_CTRL_SEL_Pos                                                                 3U
#define AON_REG_SYSTEM_REG32X_AMU_LITE1_APB_CTRL_SEL_Msk                                                                 (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE1_APB_CTRL_SEL_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_APB_CTRL_SEL_Pos                                                                 4U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_APB_CTRL_SEL_Msk                                                                 (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_APB_CTRL_SEL_Pos)

