rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG32X_AMU_LITE0_APB_CTRL_SEL_REQ_OSC80_Pos                                                       5U
#define AON_REG_SYSTEM_REG32X_AMU_LITE0_APB_CTRL_SEL_REQ_OSC80_Msk                                                       (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE0_APB_CTRL_SEL_REQ_OSC80_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE1_APB_CTRL_SEL_REQ_XTAL40_Pos                                                      6U
#define AON_REG_SYSTEM_REG32X_AMU_LITE1_APB_CTRL_SEL_REQ_XTAL40_Msk                                                      (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE1_APB_CTRL_SEL_REQ_XTAL40_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_APB_CTRL_SEL_REQ_OCS10_Pos                                                       7U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_APB_CTRL_SEL_REQ_OCS10_Msk                                                       (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_APB_CTRL_SEL_REQ_OCS10_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE0_AMU_DONE_OSC80_CG_Pos                                                            8U
#define AON_REG_SYSTEM_REG32X_AMU_LITE0_AMU_DONE_OSC80_CG_Msk                                                            (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE0_AMU_DONE_OSC80_CG_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE0_AMU_DONE_OSC80_Pos                                                               9U
#define AON_REG_SYSTEM_REG32X_AMU_LITE0_AMU_DONE_OSC80_Msk                                                               (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE0_AMU_DONE_OSC80_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE0_START_PON_AMU_OSC80_CG_Pos                                                       10U
#define AON_REG_SYSTEM_REG32X_AMU_LITE0_START_PON_AMU_OSC80_CG_Msk                                                       (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE0_START_PON_AMU_OSC80_CG_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE0_START_POF_AMU_OSC80_CG_Pos                                                       11U
#define AON_REG_SYSTEM_REG32X_AMU_LITE0_START_POF_AMU_OSC80_CG_Msk                                                       (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE0_START_POF_AMU_OSC80_CG_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE0_START_PON_AMU_OSC80_Pos                                                          12U
#define AON_REG_SYSTEM_REG32X_AMU_LITE0_START_PON_AMU_OSC80_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE0_START_PON_AMU_OSC80_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE0_START_POF_AMU_OSC80_Pos                                                          13U
#define AON_REG_SYSTEM_REG32X_AMU_LITE0_START_POF_AMU_OSC80_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE0_START_POF_AMU_OSC80_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE1_AMU_DONE_PLL1_Pos                                                                14U
#define AON_REG_SYSTEM_REG32X_AMU_LITE1_AMU_DONE_PLL1_Msk                                                                (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE1_AMU_DONE_PLL1_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE1_AMU_DONE_XTAL40_Pos                                                              15U
#define AON_REG_SYSTEM_REG32X_AMU_LITE1_AMU_DONE_XTAL40_Msk                                                              (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE1_AMU_DONE_XTAL40_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE1_START_PON_AMU_PLL1_Pos                                                           16U
#define AON_REG_SYSTEM_REG32X_AMU_LITE1_START_PON_AMU_PLL1_Msk                                                           (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE1_START_PON_AMU_PLL1_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE1_START_POF_AMU_PLL1_Pos                                                           17U
#define AON_REG_SYSTEM_REG32X_AMU_LITE1_START_POF_AMU_PLL1_Msk                                                           (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE1_START_POF_AMU_PLL1_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE1_START_PON_AMU_XTAL40_Pos                                                         18U
#define AON_REG_SYSTEM_REG32X_AMU_LITE1_START_PON_AMU_XTAL40_Msk                                                         (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE1_START_PON_AMU_XTAL40_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE1_START_POF_AMU_XTAL40_Pos                                                         19U
#define AON_REG_SYSTEM_REG32X_AMU_LITE1_START_POF_AMU_XTAL40_Msk                                                         (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE1_START_POF_AMU_XTAL40_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_CORE_OP1_Pos                                                            20U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_CORE_OP1_Msk                                                            (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_CORE_OP1_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_PPU_VCORE1_Pos                                                          21U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_PPU_VCORE1_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_PPU_VCORE1_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_PPU_VPON_Pos                                                            22U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_PPU_VPON_Msk                                                            (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_PPU_VPON_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_OSC10_Pos                                                               23U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_OSC10_Msk                                                               (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_AMU_DONE_OSC10_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_CORE_OP1_Pos                                                       24U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_CORE_OP1_Msk                                                       (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_CORE_OP1_Pos)

