rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_CORE_OP1_Pos                                                       25U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_CORE_OP1_Msk                                                       (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_CORE_OP1_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_PPU_VCORE1_Pos                                                     26U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_PPU_VCORE1_Msk                                                     (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_PPU_VCORE1_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_PPU_VCORE1_Pos                                                     27U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_PPU_VCORE1_Msk                                                     (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_PPU_VCORE1_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_PPU_VPON_Pos                                                       28U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_PPU_VPON_Msk                                                       (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_PPU_VPON_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_PPU_VPON_Pos                                                       29U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_PPU_VPON_Msk                                                       (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_PPU_VPON_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_OSC10_Pos                                                          30U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_OSC10_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_START_PON_AMU_OSC10_Pos)

#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_OSC10_Pos                                                          31U
#define AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_OSC10_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG32X_AMU_LITE2_START_POF_AMU_OSC10_Pos)

/* 0x84     0x4000_0084
    1:0     R/W     RESERVED                                                    2'b0
    2       R/W     AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_FUNC_RET                1'b0
    3       R/W     AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_FULL_RET                1'b0
    4       R/W     AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_LV                        1'b0
    5       R/W     AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_HV                        1'b0
    6       R/W     AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_FUNC_RET                  1'b0
    7       R/W     AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_MEM_OFF                   1'b0
    8       R/W     AMU_LITE0_APB_CTRL_SEL_REQ_OSC80_CG                         1'b0
    9       R/W     AMU_LITE1_APB_CTRL_SEL_REQ_PLL                              1'b0
    10      R/W     AMU_LITE2_APB_CTRL_SEL_REQ_VCORE_OP1                        1'b0
    11      R/W     AMU_LITE2_APB_CTRL_SEL_REQ_VCORE_PPU                        1'b0
    12      R/W     AMU_LITE2_APB_CTRL_SEL_REQ_VPON_PPU                         1'b0
    13      R/W     AMU_LITE0_ENABLE_PON_AMU_OSC80_CG                           1'b0
    14      R/W     AMU_LITE0_ENABLE_POF_AMU_OSC80_CG                           1'b0
    15      R/W     AMU_LITE0_ENABLE_PON_AMU_OSC80                              1'b0
    16      R/W     AMU_LITE0_ENABLE_POF_AMU_OSC80                              1'b0
    17      R/W     AMU_LITE1_ENABLE_PON_AMU_PLL1                               1'b0
    18      R/W     AMU_LITE1_ENABLE_POF_AMU_PLL1                               1'b0
    19      R/W     AMU_LITE1_ENABLE_PON_AMU_XTAL40                             1'b0
    20      R/W     AMU_LITE1_ENABLE_POF_AMU_XTAL40                             1'b0
    21      R/W     AMU_LITE2_ENABLE_PON_AMU_CORE_OP1                           1'b0
    22      R/W     AMU_LITE2_ENABLE_POF_AMU_CORE_OP1                           1'b0
    23      R/W     AMU_LITE2_ENABLE_PON_AMU_PPU_VCORE1                         1'b0
    24      R/W     AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_OFF                     1'b0
    25      R/W     AMU_LITE2_ENABLE_PON_AMU_PPU_VPON                           1'b0
    26      R/W     AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_OFF                       1'b0
    27      R/W     AMU_LITE2_ENABLE_PON_AMU_OSC10                              1'b0
    28      R/W     AMU_LITE2_ENABLE_POF_AMU_OSC10                              1'b0
    29      R/W     R_AON_FEN_AMU_LITE2                                         1'b1
    30      R/W     R_AON_FEN_AMU_LITE1                                         1'b1
    31      R/W     R_AON_FEN_AMU_LITE0                                         1'b1
 */
typedef union _AON_REG_SYSTEM_REG33X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 2;
        uint32_t AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_FUNC_RET: 1;
        uint32_t AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_FULL_RET: 1;
        uint32_t AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_LV: 1;
        uint32_t AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_HV: 1;
        uint32_t AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_FUNC_RET: 1;
        uint32_t AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_MEM_OFF: 1;
        uint32_t AMU_LITE0_APB_CTRL_SEL_REQ_OSC80_CG: 1;
        uint32_t AMU_LITE1_APB_CTRL_SEL_REQ_PLL: 1;
        uint32_t AMU_LITE2_APB_CTRL_SEL_REQ_VCORE_OP1: 1;
        uint32_t AMU_LITE2_APB_CTRL_SEL_REQ_VCORE_PPU: 1;
        uint32_t AMU_LITE2_APB_CTRL_SEL_REQ_VPON_PPU: 1;
        uint32_t AMU_LITE0_ENABLE_PON_AMU_OSC80_CG: 1;
        uint32_t AMU_LITE0_ENABLE_POF_AMU_OSC80_CG: 1;
        uint32_t AMU_LITE0_ENABLE_PON_AMU_OSC80: 1;
        uint32_t AMU_LITE0_ENABLE_POF_AMU_OSC80: 1;
        uint32_t AMU_LITE1_ENABLE_PON_AMU_PLL1: 1;
        uint32_t AMU_LITE1_ENABLE_POF_AMU_PLL1: 1;
        uint32_t AMU_LITE1_ENABLE_PON_AMU_XTAL40: 1;
        uint32_t AMU_LITE1_ENABLE_POF_AMU_XTAL40: 1;
        uint32_t AMU_LITE2_ENABLE_PON_AMU_CORE_OP1: 1;
        uint32_t AMU_LITE2_ENABLE_POF_AMU_CORE_OP1: 1;
        uint32_t AMU_LITE2_ENABLE_PON_AMU_PPU_VCORE1: 1;
        uint32_t AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_OFF: 1;
        uint32_t AMU_LITE2_ENABLE_PON_AMU_PPU_VPON: 1;
        uint32_t AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_OFF: 1;
        uint32_t AMU_LITE2_ENABLE_PON_AMU_OSC10: 1;
        uint32_t AMU_LITE2_ENABLE_POF_AMU_OSC10: 1;
        uint32_t R_AON_FEN_AMU_LITE2: 1;
        uint32_t R_AON_FEN_AMU_LITE1: 1;
        uint32_t R_AON_FEN_AMU_LITE0: 1;
    };
} AON_REG_SYSTEM_REG33X_TYPE;

/*0x4000_0084 AON_REG_SYSTEM_REG33X*/
#define AON_REG_SYSTEM_REG33X_RESERVED_Pos                                                                               0U
#define AON_REG_SYSTEM_REG33X_RESERVED_Msk                                                                               (0x3UL << AON_REG_SYSTEM_REG33X_RESERVED_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_FUNC_RET_Pos                                           2U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_FUNC_RET_Msk                                           (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_FUNC_RET_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_FULL_RET_Pos                                           3U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_FULL_RET_Msk                                           (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_FULL_RET_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_LV_Pos                                                   4U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_LV_Msk                                                   (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_LV_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_HV_Pos                                                   5U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_HV_Msk                                                   (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_HV_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_FUNC_RET_Pos                                             6U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_FUNC_RET_Msk                                             (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_FUNC_RET_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_MEM_OFF_Pos                                              7U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_MEM_OFF_Msk                                              (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_MEM_OFF_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE0_APB_CTRL_SEL_REQ_OSC80_CG_Pos                                                    8U
#define AON_REG_SYSTEM_REG33X_AMU_LITE0_APB_CTRL_SEL_REQ_OSC80_CG_Msk                                                    (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE0_APB_CTRL_SEL_REQ_OSC80_CG_Pos)

