rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG33X_AMU_LITE1_APB_CTRL_SEL_REQ_PLL_Pos                                                         9U
#define AON_REG_SYSTEM_REG33X_AMU_LITE1_APB_CTRL_SEL_REQ_PLL_Msk                                                         (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE1_APB_CTRL_SEL_REQ_PLL_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_APB_CTRL_SEL_REQ_VCORE_OP1_Pos                                                   10U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_APB_CTRL_SEL_REQ_VCORE_OP1_Msk                                                   (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_APB_CTRL_SEL_REQ_VCORE_OP1_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_APB_CTRL_SEL_REQ_VCORE_PPU_Pos                                                   11U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_APB_CTRL_SEL_REQ_VCORE_PPU_Msk                                                   (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_APB_CTRL_SEL_REQ_VCORE_PPU_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_APB_CTRL_SEL_REQ_VPON_PPU_Pos                                                    12U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_APB_CTRL_SEL_REQ_VPON_PPU_Msk                                                    (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_APB_CTRL_SEL_REQ_VPON_PPU_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_PON_AMU_OSC80_CG_Pos                                                      13U
#define AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_PON_AMU_OSC80_CG_Msk                                                      (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_PON_AMU_OSC80_CG_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_POF_AMU_OSC80_CG_Pos                                                      14U
#define AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_POF_AMU_OSC80_CG_Msk                                                      (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_POF_AMU_OSC80_CG_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_PON_AMU_OSC80_Pos                                                         15U
#define AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_PON_AMU_OSC80_Msk                                                         (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_PON_AMU_OSC80_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_POF_AMU_OSC80_Pos                                                         16U
#define AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_POF_AMU_OSC80_Msk                                                         (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE0_ENABLE_POF_AMU_OSC80_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_PON_AMU_PLL1_Pos                                                          17U
#define AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_PON_AMU_PLL1_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_PON_AMU_PLL1_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_POF_AMU_PLL1_Pos                                                          18U
#define AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_POF_AMU_PLL1_Msk                                                          (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_POF_AMU_PLL1_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_PON_AMU_XTAL40_Pos                                                        19U
#define AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_PON_AMU_XTAL40_Msk                                                        (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_PON_AMU_XTAL40_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_POF_AMU_XTAL40_Pos                                                        20U
#define AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_POF_AMU_XTAL40_Msk                                                        (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE1_ENABLE_POF_AMU_XTAL40_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_CORE_OP1_Pos                                                      21U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_CORE_OP1_Msk                                                      (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_CORE_OP1_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_CORE_OP1_Pos                                                      22U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_CORE_OP1_Msk                                                      (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_CORE_OP1_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VCORE1_Pos                                                    23U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VCORE1_Msk                                                    (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VCORE1_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_OFF_Pos                                                24U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_OFF_Msk                                                (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VCORE1_OFF_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_Pos                                                      25U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_Msk                                                      (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_PPU_VPON_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_OFF_Pos                                                  26U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_OFF_Msk                                                  (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_PPU_VPON_OFF_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_OSC10_Pos                                                         27U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_OSC10_Msk                                                         (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_PON_AMU_OSC10_Pos)

#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_OSC10_Pos                                                         28U
#define AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_OSC10_Msk                                                         (0x1UL << AON_REG_SYSTEM_REG33X_AMU_LITE2_ENABLE_POF_AMU_OSC10_Pos)

#define AON_REG_SYSTEM_REG33X_R_AON_FEN_AMU_LITE2_Pos                                                                    29U
#define AON_REG_SYSTEM_REG33X_R_AON_FEN_AMU_LITE2_Msk                                                                    (0x1UL << AON_REG_SYSTEM_REG33X_R_AON_FEN_AMU_LITE2_Pos)

#define AON_REG_SYSTEM_REG33X_R_AON_FEN_AMU_LITE1_Pos                                                                    30U
#define AON_REG_SYSTEM_REG33X_R_AON_FEN_AMU_LITE1_Msk                                                                    (0x1UL << AON_REG_SYSTEM_REG33X_R_AON_FEN_AMU_LITE1_Pos)

