rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG33X_R_AON_FEN_AMU_LITE0_Pos                                                                    31U
#define AON_REG_SYSTEM_REG33X_R_AON_FEN_AMU_LITE0_Msk                                                                    (0x1UL << AON_REG_SYSTEM_REG33X_R_AON_FEN_AMU_LITE0_Pos)

/* 0x88     0x4000_0088
    0       R/W     TEST1_amu                                                   1'b0
    1       R/W     DS_low_pwr_amu                                              1'b0
    2       R/W     SD_low_pwr_amu                                              1'b0
    3       R/W     LS_low_pwr_amu                                              1'b0
    4       R/W     DS_UNK_low_pwr_amu                                          1'b0
    6:5     R/W     DS_K_low_pwr_amu                                            2'b01
    7       R/W     DS_norm_pwr_amu                                             1'b0
    8       R/W     SD_norm_pwr_amu                                             1'b0
    9       R/W     LS_norm_pwr_amu                                             1'b0
    10      R/W     DS_UNK_norm_pwr_amu                                         1'b0
    12:11   R/W     DS_K_norm_pwr_amu                                           2'b01
    15:13   R/W     RSVD_1                                                      3'b0
    16      R/W     amu_ram_vsel                                                1'b0
    31:17   R       RSVD                                                        15'b0
 */
typedef union _AON_REG_SYSTEM_REG34X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TEST1_amu: 1;
        uint32_t DS_low_pwr_amu: 1;
        uint32_t SD_low_pwr_amu: 1;
        uint32_t LS_low_pwr_amu: 1;
        uint32_t DS_UNK_low_pwr_amu: 1;
        uint32_t DS_K_low_pwr_amu: 2;
        uint32_t DS_norm_pwr_amu: 1;
        uint32_t SD_norm_pwr_amu: 1;
        uint32_t LS_norm_pwr_amu: 1;
        uint32_t DS_UNK_norm_pwr_amu: 1;
        uint32_t DS_K_norm_pwr_amu: 2;
        uint32_t RSVD_1: 3;
        uint32_t amu_ram_vsel: 1;
        uint32_t RSVD: 15;
    };
} AON_REG_SYSTEM_REG34X_TYPE;

/*0x4000_0088 AON_REG_SYSTEM_REG34X*/
#define AON_REG_SYSTEM_REG34X_TEST1_amu_Pos                                                                              0U
#define AON_REG_SYSTEM_REG34X_TEST1_amu_Msk                                                                              (0x1UL << AON_REG_SYSTEM_REG34X_TEST1_amu_Pos)

#define AON_REG_SYSTEM_REG34X_DS_low_pwr_amu_Pos                                                                         1U
#define AON_REG_SYSTEM_REG34X_DS_low_pwr_amu_Msk                                                                         (0x1UL << AON_REG_SYSTEM_REG34X_DS_low_pwr_amu_Pos)

#define AON_REG_SYSTEM_REG34X_SD_low_pwr_amu_Pos                                                                         2U
#define AON_REG_SYSTEM_REG34X_SD_low_pwr_amu_Msk                                                                         (0x1UL << AON_REG_SYSTEM_REG34X_SD_low_pwr_amu_Pos)

#define AON_REG_SYSTEM_REG34X_LS_low_pwr_amu_Pos                                                                         3U
#define AON_REG_SYSTEM_REG34X_LS_low_pwr_amu_Msk                                                                         (0x1UL << AON_REG_SYSTEM_REG34X_LS_low_pwr_amu_Pos)

#define AON_REG_SYSTEM_REG34X_DS_UNK_low_pwr_amu_Pos                                                                     4U
#define AON_REG_SYSTEM_REG34X_DS_UNK_low_pwr_amu_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG34X_DS_UNK_low_pwr_amu_Pos)

#define AON_REG_SYSTEM_REG34X_DS_K_low_pwr_amu_Pos                                                                       5U
#define AON_REG_SYSTEM_REG34X_DS_K_low_pwr_amu_Msk                                                                       (0x3UL << AON_REG_SYSTEM_REG34X_DS_K_low_pwr_amu_Pos)

#define AON_REG_SYSTEM_REG34X_DS_norm_pwr_amu_Pos                                                                        7U
#define AON_REG_SYSTEM_REG34X_DS_norm_pwr_amu_Msk                                                                        (0x1UL << AON_REG_SYSTEM_REG34X_DS_norm_pwr_amu_Pos)

#define AON_REG_SYSTEM_REG34X_SD_norm_pwr_amu_Pos                                                                        8U
#define AON_REG_SYSTEM_REG34X_SD_norm_pwr_amu_Msk                                                                        (0x1UL << AON_REG_SYSTEM_REG34X_SD_norm_pwr_amu_Pos)

#define AON_REG_SYSTEM_REG34X_LS_norm_pwr_amu_Pos                                                                        9U
#define AON_REG_SYSTEM_REG34X_LS_norm_pwr_amu_Msk                                                                        (0x1UL << AON_REG_SYSTEM_REG34X_LS_norm_pwr_amu_Pos)

#define AON_REG_SYSTEM_REG34X_DS_UNK_norm_pwr_amu_Pos                                                                    10U
#define AON_REG_SYSTEM_REG34X_DS_UNK_norm_pwr_amu_Msk                                                                    (0x1UL << AON_REG_SYSTEM_REG34X_DS_UNK_norm_pwr_amu_Pos)

#define AON_REG_SYSTEM_REG34X_DS_K_norm_pwr_amu_Pos                                                                      11U
#define AON_REG_SYSTEM_REG34X_DS_K_norm_pwr_amu_Msk                                                                      (0x3UL << AON_REG_SYSTEM_REG34X_DS_K_norm_pwr_amu_Pos)

#define AON_REG_SYSTEM_REG34X_RSVD_1_Pos                                                                                 13U
#define AON_REG_SYSTEM_REG34X_RSVD_1_Msk                                                                                 (0x7UL << AON_REG_SYSTEM_REG34X_RSVD_1_Pos)

#define AON_REG_SYSTEM_REG34X_amu_ram_vsel_Pos                                                                           16U
#define AON_REG_SYSTEM_REG34X_amu_ram_vsel_Msk                                                                           (0x1UL << AON_REG_SYSTEM_REG34X_amu_ram_vsel_Pos)

#define AON_REG_SYSTEM_REG34X_RSVD_Pos                                                                                   17U
#define AON_REG_SYSTEM_REG34X_RSVD_Msk                                                                                   (0x7FFFUL << AON_REG_SYSTEM_REG34X_RSVD_Pos)

/* 0x8C     0x4000_008c
    2:0     R/W     WPULSE_amu_lv                                               3'b000
    5:3     R/W     WA_amu_lv                                                   3'b101
    9:6     R/W     RM_amu_lv                                                   4'b0010
    10      R/W     RME_amu_lv                                                  1'b1
    12:11   R/W     RA_amu_lv                                                   2'b00
    15:13   R       RSVD_1                                                      3'b0
    18:16   R/W     WPULSE_amu_hv                                               3'b000
    21:19   R/W     WA_amu_hv                                                   3'b100
    25:22   R/W     RM_amu_hv                                                   4'b0011
    26      R/W     RME_amu_hv                                                  1'b1
    28:27   R/W     RA_amu_hv                                                   2'b00
    31:29   R       RSVD                                                        3'b0
 */
typedef union _AON_REG_SYSTEM_REG35X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WPULSE_amu_lv: 3;
        uint32_t WA_amu_lv: 3;
        uint32_t RM_amu_lv: 4;
        uint32_t RME_amu_lv: 1;
        uint32_t RA_amu_lv: 2;
        uint32_t RSVD_1: 3;
        uint32_t WPULSE_amu_hv: 3;
        uint32_t WA_amu_hv: 3;
        uint32_t RM_amu_hv: 4;
        uint32_t RME_amu_hv: 1;
        uint32_t RA_amu_hv: 2;
        uint32_t RSVD: 3;
    };
} AON_REG_SYSTEM_REG35X_TYPE;

/*0x4000_008c AON_REG_SYSTEM_REG35X*/
#define AON_REG_SYSTEM_REG35X_WPULSE_amu_lv_Pos                                                                          0U
#define AON_REG_SYSTEM_REG35X_WPULSE_amu_lv_Msk                                                                          (0x7UL << AON_REG_SYSTEM_REG35X_WPULSE_amu_lv_Pos)

#define AON_REG_SYSTEM_REG35X_WA_amu_lv_Pos                                                                              3U
#define AON_REG_SYSTEM_REG35X_WA_amu_lv_Msk                                                                              (0x7UL << AON_REG_SYSTEM_REG35X_WA_amu_lv_Pos)

