rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG35X_RM_amu_lv_Pos                                                                              6U
#define AON_REG_SYSTEM_REG35X_RM_amu_lv_Msk                                                                              (0xFUL << AON_REG_SYSTEM_REG35X_RM_amu_lv_Pos)

#define AON_REG_SYSTEM_REG35X_RME_amu_lv_Pos                                                                             10U
#define AON_REG_SYSTEM_REG35X_RME_amu_lv_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG35X_RME_amu_lv_Pos)

#define AON_REG_SYSTEM_REG35X_RA_amu_lv_Pos                                                                              11U
#define AON_REG_SYSTEM_REG35X_RA_amu_lv_Msk                                                                              (0x3UL << AON_REG_SYSTEM_REG35X_RA_amu_lv_Pos)

#define AON_REG_SYSTEM_REG35X_RSVD_1_Pos                                                                                 13U
#define AON_REG_SYSTEM_REG35X_RSVD_1_Msk                                                                                 (0x7UL << AON_REG_SYSTEM_REG35X_RSVD_1_Pos)

#define AON_REG_SYSTEM_REG35X_WPULSE_amu_hv_Pos                                                                          16U
#define AON_REG_SYSTEM_REG35X_WPULSE_amu_hv_Msk                                                                          (0x7UL << AON_REG_SYSTEM_REG35X_WPULSE_amu_hv_Pos)

#define AON_REG_SYSTEM_REG35X_WA_amu_hv_Pos                                                                              19U
#define AON_REG_SYSTEM_REG35X_WA_amu_hv_Msk                                                                              (0x7UL << AON_REG_SYSTEM_REG35X_WA_amu_hv_Pos)

#define AON_REG_SYSTEM_REG35X_RM_amu_hv_Pos                                                                              22U
#define AON_REG_SYSTEM_REG35X_RM_amu_hv_Msk                                                                              (0xFUL << AON_REG_SYSTEM_REG35X_RM_amu_hv_Pos)

#define AON_REG_SYSTEM_REG35X_RME_amu_hv_Pos                                                                             26U
#define AON_REG_SYSTEM_REG35X_RME_amu_hv_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG35X_RME_amu_hv_Pos)

#define AON_REG_SYSTEM_REG35X_RA_amu_hv_Pos                                                                              27U
#define AON_REG_SYSTEM_REG35X_RA_amu_hv_Msk                                                                              (0x3UL << AON_REG_SYSTEM_REG35X_RA_amu_hv_Pos)

#define AON_REG_SYSTEM_REG35X_RSVD_Pos                                                                                   29U
#define AON_REG_SYSTEM_REG35X_RSVD_Msk                                                                                   (0x7UL << AON_REG_SYSTEM_REG35X_RSVD_Pos)

/* 0x90     0x4000_0090
    15:0    R/W     DUMMY_SYSTEM_2                                              16'b0
    31:16   R/W     DUMMY_SYSTEM_1                                              16'b0
 */
typedef union _AON_REG_SYSTEM_REG36X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DUMMY_SYSTEM_2: 16;
        uint32_t DUMMY_SYSTEM_1: 16;
    };
} AON_REG_SYSTEM_REG36X_TYPE;

/*0x4000_0090 AON_REG_SYSTEM_REG36X*/
#define AON_REG_SYSTEM_REG36X_DUMMY_SYSTEM_2_Pos                                                                         0U
#define AON_REG_SYSTEM_REG36X_DUMMY_SYSTEM_2_Msk                                                                         (0xFFFFUL << AON_REG_SYSTEM_REG36X_DUMMY_SYSTEM_2_Pos)

#define AON_REG_SYSTEM_REG36X_DUMMY_SYSTEM_1_Pos                                                                         16U
#define AON_REG_SYSTEM_REG36X_DUMMY_SYSTEM_1_Msk                                                                         (0xFFFFUL << AON_REG_SYSTEM_REG36X_DUMMY_SYSTEM_1_Pos)

/* 0x94     0x4000_0094
    0       R/W     FORCE_AMU0_APB_RUN                                          1'b1
    1       R/W     FORCE_AMU1_APB_RUN                                          1'b1
    2       R/W     PADRV_PCUT_CTRL_SEL                                         1'b0
    4:3     R/W     TOTAL_DELAY_OSC10                                           2'b00
    8:5     R/W     TOTAL_DELAY_VPON_PPU_3                                      4'b0000
    12:9    R/W     TOTAL_DELAY_VPON_PPU_2                                      4'b0000
    16:13   R/W     TOTAL_DELAY_VPON_PPU_1                                      4'b0000
    20:17   R/W     TOTAL_DELAY_OSC80                                           4'b0000
    24:21   R/W     TOTAL_DELAY_PLL                                             4'b0000
    25      R/W     EN_BUCK_BOOST_ENLPM_SWITCH                                  1'b0
    26      R/W     SW_LDO2PWRCUT                                               1'b0
    27      R/W     POW_LDO                                                     1'b0
    28      R/W     LDO_DEBUG_VPULSE                                            1'b0
    31:29   R/W     SW_LDO_OUT                                                  3'b100
 */
typedef union _AON_REG_SYSTEM_REG37X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FORCE_AMU0_APB_RUN: 1;
        uint32_t FORCE_AMU1_APB_RUN: 1;
        uint32_t PADRV_PCUT_CTRL_SEL: 1;
        uint32_t TOTAL_DELAY_OSC10: 2;
        uint32_t TOTAL_DELAY_VPON_PPU_3: 4;
        uint32_t TOTAL_DELAY_VPON_PPU_2: 4;
        uint32_t TOTAL_DELAY_VPON_PPU_1: 4;
        uint32_t TOTAL_DELAY_OSC80: 4;
        uint32_t TOTAL_DELAY_PLL: 4;
        uint32_t EN_BUCK_BOOST_ENLPM_SWITCH: 1;
        uint32_t SW_LDO2PWRCUT: 1;
        uint32_t POW_LDO: 1;
        uint32_t LDO_DEBUG_VPULSE: 1;
        uint32_t SW_LDO_OUT: 3;
    };
} AON_REG_SYSTEM_REG37X_TYPE;

/*0x4000_0094 AON_REG_SYSTEM_REG37X*/
#define AON_REG_SYSTEM_REG37X_FORCE_AMU0_APB_RUN_Pos                                                                     0U
#define AON_REG_SYSTEM_REG37X_FORCE_AMU0_APB_RUN_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG37X_FORCE_AMU0_APB_RUN_Pos)

#define AON_REG_SYSTEM_REG37X_FORCE_AMU1_APB_RUN_Pos                                                                     1U
#define AON_REG_SYSTEM_REG37X_FORCE_AMU1_APB_RUN_Msk                                                                     (0x1UL << AON_REG_SYSTEM_REG37X_FORCE_AMU1_APB_RUN_Pos)

#define AON_REG_SYSTEM_REG37X_PADRV_PCUT_CTRL_SEL_Pos                                                                    2U
#define AON_REG_SYSTEM_REG37X_PADRV_PCUT_CTRL_SEL_Msk                                                                    (0x1UL << AON_REG_SYSTEM_REG37X_PADRV_PCUT_CTRL_SEL_Pos)

#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_OSC10_Pos                                                                      3U
#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_OSC10_Msk                                                                      (0x3UL << AON_REG_SYSTEM_REG37X_TOTAL_DELAY_OSC10_Pos)

#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_VPON_PPU_3_Pos                                                                 5U
#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_VPON_PPU_3_Msk                                                                 (0xFUL << AON_REG_SYSTEM_REG37X_TOTAL_DELAY_VPON_PPU_3_Pos)

#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_VPON_PPU_2_Pos                                                                 9U
#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_VPON_PPU_2_Msk                                                                 (0xFUL << AON_REG_SYSTEM_REG37X_TOTAL_DELAY_VPON_PPU_2_Pos)

#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_VPON_PPU_1_Pos                                                                 13U
#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_VPON_PPU_1_Msk                                                                 (0xFUL << AON_REG_SYSTEM_REG37X_TOTAL_DELAY_VPON_PPU_1_Pos)

#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_OSC80_Pos                                                                      17U
#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_OSC80_Msk                                                                      (0xFUL << AON_REG_SYSTEM_REG37X_TOTAL_DELAY_OSC80_Pos)

