rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_PLL_Pos                                                                        21U
#define AON_REG_SYSTEM_REG37X_TOTAL_DELAY_PLL_Msk                                                                        (0xFUL << AON_REG_SYSTEM_REG37X_TOTAL_DELAY_PLL_Pos)

#define AON_REG_SYSTEM_REG37X_EN_BUCK_BOOST_ENLPM_SWITCH_Pos                                                             25U
#define AON_REG_SYSTEM_REG37X_EN_BUCK_BOOST_ENLPM_SWITCH_Msk                                                             (0x1UL << AON_REG_SYSTEM_REG37X_EN_BUCK_BOOST_ENLPM_SWITCH_Pos)

#define AON_REG_SYSTEM_REG37X_SW_LDO2PWRCUT_Pos                                                                          26U
#define AON_REG_SYSTEM_REG37X_SW_LDO2PWRCUT_Msk                                                                          (0x1UL << AON_REG_SYSTEM_REG37X_SW_LDO2PWRCUT_Pos)

#define AON_REG_SYSTEM_REG37X_POW_LDO_Pos                                                                                27U
#define AON_REG_SYSTEM_REG37X_POW_LDO_Msk                                                                                (0x1UL << AON_REG_SYSTEM_REG37X_POW_LDO_Pos)

#define AON_REG_SYSTEM_REG37X_LDO_DEBUG_VPULSE_Pos                                                                       28U
#define AON_REG_SYSTEM_REG37X_LDO_DEBUG_VPULSE_Msk                                                                       (0x1UL << AON_REG_SYSTEM_REG37X_LDO_DEBUG_VPULSE_Pos)

#define AON_REG_SYSTEM_REG37X_SW_LDO_OUT_Pos                                                                             29U
#define AON_REG_SYSTEM_REG37X_SW_LDO_OUT_Msk                                                                             (0x7UL << AON_REG_SYSTEM_REG37X_SW_LDO_OUT_Pos)

/* 0x98     0x4000_0098
    0       R/W     BT_MAC_VSEL                                                 1'b0
    1       R/W     BT_MAC_CCMP_VSEL                                            1'b0
    2       R/W     BUFFER_RAM_VSEL                                             1'b0
    3       R/W     USB_RAM_VSEL                                                1'b0
    4       R/W     CAN_RAM_VSEL                                                1'b0
    5       R       CPU_RAM_VSEL                                                1'b0
    6       R/W     AUDIO_RAM_VSEL                                              1'b0
    7       R/W     BTPHY_RAM_VSEL                                              1'b0
    8       R/W     PLATFORM_ROM_VSEL                                           1'b0
    9       R/W     RETSRAM_VSEL                                                1'b0
    10      R/W     CACHE_VSEL                                                  1'b0
    31:11   R       RSVD                                                        21'h0
 */
typedef union _AON_REG_SYSTEM_REG38X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BT_MAC_VSEL: 1;
        uint32_t BT_MAC_CCMP_VSEL: 1;
        uint32_t BUFFER_RAM_VSEL: 1;
        uint32_t USB_RAM_VSEL: 1;
        uint32_t CAN_RAM_VSEL: 1;
        uint32_t CPU_RAM_VSEL: 1;
        uint32_t AUDIO_RAM_VSEL: 1;
        uint32_t BTPHY_RAM_VSEL: 1;
        uint32_t PLATFORM_ROM_VSEL: 1;
        uint32_t RETSRAM_VSEL: 1;
        uint32_t CACHE_VSEL: 1;
        uint32_t RSVD: 21;
    };
} AON_REG_SYSTEM_REG38X_TYPE;

/*0x4000_0098 AON_REG_SYSTEM_REG38X*/
#define AON_REG_SYSTEM_REG38X_BT_MAC_VSEL_Pos                                                                            0U
#define AON_REG_SYSTEM_REG38X_BT_MAC_VSEL_Msk                                                                            (0x1UL << AON_REG_SYSTEM_REG38X_BT_MAC_VSEL_Pos)

#define AON_REG_SYSTEM_REG38X_BT_MAC_CCMP_VSEL_Pos                                                                       1U
#define AON_REG_SYSTEM_REG38X_BT_MAC_CCMP_VSEL_Msk                                                                       (0x1UL << AON_REG_SYSTEM_REG38X_BT_MAC_CCMP_VSEL_Pos)

#define AON_REG_SYSTEM_REG38X_BUFFER_RAM_VSEL_Pos                                                                        2U
#define AON_REG_SYSTEM_REG38X_BUFFER_RAM_VSEL_Msk                                                                        (0x1UL << AON_REG_SYSTEM_REG38X_BUFFER_RAM_VSEL_Pos)

#define AON_REG_SYSTEM_REG38X_USB_RAM_VSEL_Pos                                                                           3U
#define AON_REG_SYSTEM_REG38X_USB_RAM_VSEL_Msk                                                                           (0x1UL << AON_REG_SYSTEM_REG38X_USB_RAM_VSEL_Pos)

#define AON_REG_SYSTEM_REG38X_CAN_RAM_VSEL_Pos                                                                           4U
#define AON_REG_SYSTEM_REG38X_CAN_RAM_VSEL_Msk                                                                           (0x1UL << AON_REG_SYSTEM_REG38X_CAN_RAM_VSEL_Pos)

#define AON_REG_SYSTEM_REG38X_CPU_RAM_VSEL_Pos                                                                           5U
#define AON_REG_SYSTEM_REG38X_CPU_RAM_VSEL_Msk                                                                           (0x1UL << AON_REG_SYSTEM_REG38X_CPU_RAM_VSEL_Pos)

#define AON_REG_SYSTEM_REG38X_AUDIO_RAM_VSEL_Pos                                                                         6U
#define AON_REG_SYSTEM_REG38X_AUDIO_RAM_VSEL_Msk                                                                         (0x1UL << AON_REG_SYSTEM_REG38X_AUDIO_RAM_VSEL_Pos)

#define AON_REG_SYSTEM_REG38X_BTPHY_RAM_VSEL_Pos                                                                         7U
#define AON_REG_SYSTEM_REG38X_BTPHY_RAM_VSEL_Msk                                                                         (0x1UL << AON_REG_SYSTEM_REG38X_BTPHY_RAM_VSEL_Pos)

#define AON_REG_SYSTEM_REG38X_PLATFORM_ROM_VSEL_Pos                                                                      8U
#define AON_REG_SYSTEM_REG38X_PLATFORM_ROM_VSEL_Msk                                                                      (0x1UL << AON_REG_SYSTEM_REG38X_PLATFORM_ROM_VSEL_Pos)

#define AON_REG_SYSTEM_REG38X_RETSRAM_VSEL_Pos                                                                           9U
#define AON_REG_SYSTEM_REG38X_RETSRAM_VSEL_Msk                                                                           (0x1UL << AON_REG_SYSTEM_REG38X_RETSRAM_VSEL_Pos)

#define AON_REG_SYSTEM_REG38X_CACHE_VSEL_Pos                                                                             10U
#define AON_REG_SYSTEM_REG38X_CACHE_VSEL_Msk                                                                             (0x1UL << AON_REG_SYSTEM_REG38X_CACHE_VSEL_Pos)

#define AON_REG_SYSTEM_REG38X_RSVD_Pos                                                                                   11U
#define AON_REG_SYSTEM_REG38X_RSVD_Msk                                                                                   (0x1FFFFFUL << AON_REG_SYSTEM_REG38X_RSVD_Pos)

/* 0xC0     0x4000_00c0
    6:0     R/W     RESERVED_3                                                  7'h0
    7       R/W     RESERVED_2                                                  1'h0
    15:8    R/W     RESERVED_1                                                  8'h0
    31:16   R/W     RESERVED                                                    16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_3: 7;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 8;
        uint32_t RESERVED: 16;
    };
} AON_REG_FW_GENERAL_REG0X_TYPE;

/*0x4000_00c0 AON_REG_FW_GENERAL_REG0X*/
#define AON_REG_FW_GENERAL_REG0X_RESERVED_3_Pos                                                                          0U
#define AON_REG_FW_GENERAL_REG0X_RESERVED_3_Msk                                                                          (0x7FUL << AON_REG_FW_GENERAL_REG0X_RESERVED_3_Pos)

