rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_FW_GENERAL_REG0X_RESERVED_2_Pos                                                                          7U
#define AON_REG_FW_GENERAL_REG0X_RESERVED_2_Msk                                                                          (0x1UL << AON_REG_FW_GENERAL_REG0X_RESERVED_2_Pos)

#define AON_REG_FW_GENERAL_REG0X_RESERVED_1_Pos                                                                          8U
#define AON_REG_FW_GENERAL_REG0X_RESERVED_1_Msk                                                                          (0xFFUL << AON_REG_FW_GENERAL_REG0X_RESERVED_1_Pos)

#define AON_REG_FW_GENERAL_REG0X_RESERVED_Pos                                                                            16U
#define AON_REG_FW_GENERAL_REG0X_RESERVED_Msk                                                                            (0xFFFFUL << AON_REG_FW_GENERAL_REG0X_RESERVED_Pos)

/* 0xC4     0x4000_00c4
    15:0    R/W     RESERVED_1                                                  16'h0
    31:16   R/W     RESERVED                                                    16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_1: 16;
        uint32_t RESERVED: 16;
    };
} AON_REG_FW_GENERAL_REG1X_TYPE;

/*0x4000_00c4 AON_REG_FW_GENERAL_REG1X*/
#define AON_REG_FW_GENERAL_REG1X_RESERVED_1_Pos                                                                          0U
#define AON_REG_FW_GENERAL_REG1X_RESERVED_1_Msk                                                                          (0xFFFFUL << AON_REG_FW_GENERAL_REG1X_RESERVED_1_Pos)

#define AON_REG_FW_GENERAL_REG1X_RESERVED_Pos                                                                            16U
#define AON_REG_FW_GENERAL_REG1X_RESERVED_Msk                                                                            (0xFFFFUL << AON_REG_FW_GENERAL_REG1X_RESERVED_Pos)

/* 0xC8     0x4000_00c8
    15:0    R/W     RESERVED_1                                                  16'h0
    31:16   R/W     RESERVED                                                    16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_1: 16;
        uint32_t RESERVED: 16;
    };
} AON_REG_FW_GENERAL_REG2X_TYPE;

/*0x4000_00c8 AON_REG_FW_GENERAL_REG2X*/
#define AON_REG_FW_GENERAL_REG2X_RESERVED_1_Pos                                                                          0U
#define AON_REG_FW_GENERAL_REG2X_RESERVED_1_Msk                                                                          (0xFFFFUL << AON_REG_FW_GENERAL_REG2X_RESERVED_1_Pos)

#define AON_REG_FW_GENERAL_REG2X_RESERVED_Pos                                                                            16U
#define AON_REG_FW_GENERAL_REG2X_RESERVED_Msk                                                                            (0xFFFFUL << AON_REG_FW_GENERAL_REG2X_RESERVED_Pos)

/* 0xCC     0x4000_00cc
    15:0    R/W     RESERVED_1                                                  16'h0
    31:16   R/W     RESERVED                                                    16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_1: 16;
        uint32_t RESERVED: 16;
    };
} AON_REG_FW_GENERAL_REG3X_TYPE;

/*0x4000_00cc AON_REG_FW_GENERAL_REG3X*/
#define AON_REG_FW_GENERAL_REG3X_RESERVED_1_Pos                                                                          0U
#define AON_REG_FW_GENERAL_REG3X_RESERVED_1_Msk                                                                          (0xFFFFUL << AON_REG_FW_GENERAL_REG3X_RESERVED_1_Pos)

#define AON_REG_FW_GENERAL_REG3X_RESERVED_Pos                                                                            16U
#define AON_REG_FW_GENERAL_REG3X_RESERVED_Msk                                                                            (0xFFFFUL << AON_REG_FW_GENERAL_REG3X_RESERVED_Pos)

/* 0xD0     0x4000_00d0
    15:0    R/W     RESERVED_1                                                  16'h0
    31:16   R/W     RESERVED                                                    16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG4X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_1: 16;
        uint32_t RESERVED: 16;
    };
} AON_REG_FW_GENERAL_REG4X_TYPE;

/*0x4000_00d0 AON_REG_FW_GENERAL_REG4X*/
#define AON_REG_FW_GENERAL_REG4X_RESERVED_1_Pos                                                                          0U
#define AON_REG_FW_GENERAL_REG4X_RESERVED_1_Msk                                                                          (0xFFFFUL << AON_REG_FW_GENERAL_REG4X_RESERVED_1_Pos)

#define AON_REG_FW_GENERAL_REG4X_RESERVED_Pos                                                                            16U
#define AON_REG_FW_GENERAL_REG4X_RESERVED_Msk                                                                            (0xFFFFUL << AON_REG_FW_GENERAL_REG4X_RESERVED_Pos)

/* 0xD4     0x4000_00d4
    15:0    R/W     FW_GP_DUMMY2                                                16'h0
    31:16   R/W     FW_GP_DUMMY1                                                16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG5X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GP_DUMMY2: 16;
        uint32_t FW_GP_DUMMY1: 16;
    };
} AON_REG_FW_GENERAL_REG5X_TYPE;

/*0x4000_00d4 AON_REG_FW_GENERAL_REG5X*/
#define AON_REG_FW_GENERAL_REG5X_FW_GP_DUMMY2_Pos                                                                        0U
#define AON_REG_FW_GENERAL_REG5X_FW_GP_DUMMY2_Msk                                                                        (0xFFFFUL << AON_REG_FW_GENERAL_REG5X_FW_GP_DUMMY2_Pos)

#define AON_REG_FW_GENERAL_REG5X_FW_GP_DUMMY1_Pos                                                                        16U
#define AON_REG_FW_GENERAL_REG5X_FW_GP_DUMMY1_Msk                                                                        (0xFFFFUL << AON_REG_FW_GENERAL_REG5X_FW_GP_DUMMY1_Pos)

/* 0xD8     0x4000_00d8
    0       R/W     IS_PASSWORD_HCI_CMD                 1'h0
    1       R/W     IS_OTA_MODE                         1'h0
    2       R/W     IS_FT_MODE                          1'h0
    3       R/W     IS_HCI_MODE                         1'h0
    4       R/W     IS_AIRPLANE_MODE                    1'h0
    5       R/W     IS_RESPONSE_HCI_CMD                 1'h0
    6       R/W     IS_RXI300_DISABLE                   1'h0
    15:7    R/W     FW_GP_1_2                           10'h0
    31:16   R/W     FW_GP_1_1                           16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG6X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t IS_PASSWORD_HCI_CMD: 1;
        uint32_t IS_OTA_MODE: 1;
        uint32_t IS_FT_MODE: 1;
        uint32_t IS_HCI_MODE: 1;
        uint32_t IS_AIRPLANE_MODE: 1;
        uint32_t IS_RESPONSE_HCI_CMD: 1;
        uint32_t IS_RXI300_DISABLE: 1;
        uint32_t FW_GP_1_2: 9;
        uint32_t FW_GP_1_1: 16;
    };
} AON_REG_FW_GENERAL_REG6X_TYPE;

/*0x4000_00d8 AON_REG_FW_GENERAL_REG6X*/
#define AON_REG_FW_GENERAL_REG6X_IS_PASSWORD_HCI_CMD_Pos                             0U
#define AON_REG_FW_GENERAL_REG6X_IS_PASSWORD_HCI_CMD_Msk                             (0x1UL << AON_REG_FW_GENERAL_REG6X_IS_PASSWORD_HCI_CMD_Pos)

#define AON_REG_FW_GENERAL_REG6X_IS_OTA_MODE_Pos                                     1U
#define AON_REG_FW_GENERAL_REG6X_IS_OTA_MODE_Msk                                     (0x1UL << AON_REG_FW_GENERAL_REG6X_IS_OTA_MODE_Pos)

#define AON_REG_FW_GENERAL_REG6X_IS_FT_MODE_Pos                                      2U
#define AON_REG_FW_GENERAL_REG6X_IS_FT_MODE_Msk                                      (0x1UL << AON_REG_FW_GENERAL_REG6X_IS_FT_MODE_Pos)

#define AON_REG_FW_GENERAL_REG6X_IS_HCI_MODE_Pos                                     3U
#define AON_REG_FW_GENERAL_REG6X_IS_HCI_MODE_Msk                                     (0x1UL << AON_REG_FW_GENERAL_REG6X_IS_HCI_MODE_Pos)

