rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_FW_GENERAL_REG6X_IS_AIRPLANE_MODE_Pos                                4U
#define AON_REG_FW_GENERAL_REG6X_IS_AIRPLANE_MODE_Msk                                (0x1UL << AON_REG_FW_GENERAL_REG6X_IS_AIRPLANE_MODE_Pos)

#define AON_REG_FW_GENERAL_REG6X_IS_RESPONSE_HCI_CMD_Pos                             5U
#define AON_REG_FW_GENERAL_REG6X_IS_RESPONSE_HCI_CMD_Msk                             (0x1UL << AON_REG_FW_GENERAL_REG6X_IS_RESPONSE_HCI_CMD_Pos)

#define AON_REG_FW_GENERAL_REG6X_IS_RXI300_DISABLE_Pos                               6U
#define AON_REG_FW_GENERAL_REG6X_IS_RXI300_DISABLE_Msk                               (0x1UL << AON_REG_FW_GENERAL_REG6X_IS_RXI300_DISABLE_Pos)

#define AON_REG_FW_GENERAL_REG6X_FW_GP_1_2_Pos                                       7U
#define AON_REG_FW_GENERAL_REG6X_FW_GP_1_2_Msk                                       (0x1FFUL << AON_REG_FW_GENERAL_REG6X_FW_GP_1_2_Pos)

#define AON_REG_FW_GENERAL_REG6X_FW_GP_1_1_Pos                                       16U
#define AON_REG_FW_GENERAL_REG6X_FW_GP_1_1_Msk                                       (0xFFFFUL << AON_REG_FW_GENERAL_REG6X_FW_GP_1_1_Pos)

/* 0xDC     0x4000_00dc
    31:0    R/W     DEBUG_AUTHENTICATION_0              32'h0
 */
typedef union _AON_REG_DEBUG_AUTHENTICATION0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEBUG_AUTHENTICATION_0;
    };
} AON_REG_DEBUG_AUTHENTICATION0_TYPE;

/*0x4000_00dc AON_REG_DEBUG_AUTHENTICATION0*/
#define AON_REG_DEBUG_AUTHENTICATION0_DEBUG_AUTHENTICATION_0_Pos                     0U
#define AON_REG_DEBUG_AUTHENTICATION0_DEBUG_AUTHENTICATION_0_Msk                     (0xFFFFFFFFUL << AON_REG_DEBUG_AUTHENTICATION0_DEBUG_AUTHENTICATION_0_Pos)

/* 0xE0     0x4000_00e0
    31:0    R/W     DEBUG_AUTHENTICATION_1              32'h0
 */
typedef union _AON_REG_DEBUG_AUTHENTICATION1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEBUG_AUTHENTICATION_1;
    };
} AON_REG_DEBUG_AUTHENTICATION1_TYPE;

/*0x4000_00e0 AON_REG_DEBUG_AUTHENTICATION1*/
#define AON_REG_DEBUG_AUTHENTICATION1_DEBUG_AUTHENTICATION_1_Pos                     0U
#define AON_REG_DEBUG_AUTHENTICATION1_DEBUG_AUTHENTICATION_1_Msk                     (0xFFFFFFFFUL << AON_REG_DEBUG_AUTHENTICATION1_DEBUG_AUTHENTICATION_1_Pos)

/* 0xE4     0x4000_00e4
    31:0    R/W     DEBUG_AUTHENTICATION_2              32'h0
 */
typedef union _AON_REG_DEBUG_AUTHENTICATION2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEBUG_AUTHENTICATION_2;
    };
} AON_REG_DEBUG_AUTHENTICATION2_TYPE;

/*0x4000_00e4 AON_REG_DEBUG_AUTHENTICATION2*/
#define AON_REG_DEBUG_AUTHENTICATION2_DEBUG_AUTHENTICATION_2_Pos                     0U
#define AON_REG_DEBUG_AUTHENTICATION2_DEBUG_AUTHENTICATION_2_Msk                     (0xFFFFFFFFUL << AON_REG_DEBUG_AUTHENTICATION2_DEBUG_AUTHENTICATION_2_Pos)

/* 0xE8     0x4000_00e8
    31:0    R/W     DEBUG_AUTHENTICATION_3              32'h0
 */
typedef union _AON_REG_DEBUG_AUTHENTICATION3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEBUG_AUTHENTICATION_3;
    };
} AON_REG_DEBUG_AUTHENTICATION3_TYPE;

/*0x4000_00e8 AON_REG_DEBUG_AUTHENTICATION3*/
#define AON_REG_DEBUG_AUTHENTICATION3_DEBUG_AUTHENTICATION_3_Pos                     0U
#define AON_REG_DEBUG_AUTHENTICATION3_DEBUG_AUTHENTICATION_3_Msk                     (0xFFFFFFFFUL << AON_REG_DEBUG_AUTHENTICATION3_DEBUG_AUTHENTICATION_3_Pos)

/* 0xEC     0x4000_00ec
    15:0    R/W     FW_GP_1_12                                                  16'h0
    31:16   R/W     FW_GP_1_11                                                  16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG11X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_GP_1_12: 16;
        uint32_t FW_GP_1_11: 16;
    };
} AON_REG_FW_GENERAL_REG11X_TYPE;

/*0x4000_00ec AON_REG_FW_GENERAL_REG11X*/
#define AON_REG_FW_GENERAL_REG11X_FW_GP_1_12_Pos                                                                         0U
#define AON_REG_FW_GENERAL_REG11X_FW_GP_1_12_Msk                                                                         (0xFFFFUL << AON_REG_FW_GENERAL_REG11X_FW_GP_1_12_Pos)

#define AON_REG_FW_GENERAL_REG11X_FW_GP_1_11_Pos                                                                         16U
#define AON_REG_FW_GENERAL_REG11X_FW_GP_1_11_Msk                                                                         (0xFFFFUL << AON_REG_FW_GENERAL_REG11X_FW_GP_1_11_Pos)

/* 0xF0     0x4000_00f0
    11:0    R       RTC_PRE_SCALE_CNTR_AON_11_0                                 12'h0
    14:12   R       RESERVED                                                    3'd0
    15      R/W1C   RTC_ALL_CNTR_AON_W1C                                        1'b0
    31:16   R/W     FW_GP_1_13                                                  16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG12X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PRE_SCALE_CNTR_AON_11_0: 12;
        uint32_t RESERVED: 3;
        uint32_t RTC_ALL_CNTR_AON_W1C: 1;
        uint32_t FW_GP_1_13: 16;
    };
} AON_REG_FW_GENERAL_REG12X_TYPE;

/*0x4000_00f0 AON_REG_FW_GENERAL_REG12X*/
#define AON_REG_FW_GENERAL_REG12X_RTC_PRE_SCALE_CNTR_AON_11_0_Pos                                                        0U
#define AON_REG_FW_GENERAL_REG12X_RTC_PRE_SCALE_CNTR_AON_11_0_Msk                                                        (0xFFFUL << AON_REG_FW_GENERAL_REG12X_RTC_PRE_SCALE_CNTR_AON_11_0_Pos)

#define AON_REG_FW_GENERAL_REG12X_RESERVED_Pos                                                                           12U
#define AON_REG_FW_GENERAL_REG12X_RESERVED_Msk                                                                           (0x7UL << AON_REG_FW_GENERAL_REG12X_RESERVED_Pos)

#define AON_REG_FW_GENERAL_REG12X_RTC_ALL_CNTR_AON_W1C_Pos                                                               15U
#define AON_REG_FW_GENERAL_REG12X_RTC_ALL_CNTR_AON_W1C_Msk                                                               (0x1UL << AON_REG_FW_GENERAL_REG12X_RTC_ALL_CNTR_AON_W1C_Pos)

#define AON_REG_FW_GENERAL_REG12X_FW_GP_1_13_Pos                                                                         16U
#define AON_REG_FW_GENERAL_REG12X_FW_GP_1_13_Msk                                                                         (0xFFFFUL << AON_REG_FW_GENERAL_REG12X_FW_GP_1_13_Pos)

/* 0xF4     0x4000_00f4
    31:0    R       RTC_CNTR_AON_31_0                                           32'h0
 */
typedef union _AON_REG_FW_GENERAL_REG13X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CNTR_AON_31_0;
    };
} AON_REG_FW_GENERAL_REG13X_TYPE;

/*0x4000_00f4 AON_REG_FW_GENERAL_REG13X*/
#define AON_REG_FW_GENERAL_REG13X_RTC_CNTR_AON_31_0_Pos                                                                  0U
#define AON_REG_FW_GENERAL_REG13X_RTC_CNTR_AON_31_0_Msk                                                                  (0xFFFFFFFFUL << AON_REG_FW_GENERAL_REG13X_RTC_CNTR_AON_31_0_Pos)

