rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0xF8     0x4000_00f8
    0       W1O     IS_DISABLE_HCI_RAM_PATCH            1'h0
    1       W1O     IS_DISABLE_HCI_FLASH_ACCESS         1'h0
    2       W1O     IS_DISABLE_HCI_SYSTEM_ACCESS        1'h0
    3       W1O     IS_DISABLE_HCI_OTP_ACCESS           1'h0
    4       W1O     IS_DISABLE_HCI_READ_CHIP_INFO       1'h0
    5       W1O     IS_DISABLE_HCI_MAC_RF_ACCESS        1'h0
    6       W1O     IS_DISABLE_HCI_WIFI_COEXIST_FUNC    1'h0
    7       W1O     IS_DISABLE_HCI_SET_UART_BAUDRATE    1'h0
    8       W1O     IS_DISABLE_HCI_RF_DBG_FUNC          1'h0
    9       W1O     IS_DISABLE_HCI_BT_EXTENSION         1'h0
    10      W1O     IS_DISABLE_HCI_BT_DBG_FUNC          1'h0
    11      W1O     IS_DISABLE_HCI_BT_TEST              1'h0
    12      W1O     IS_DISABLE_HCI_RF_TEST              1'h0
    13      W1O     IS_DISABLE_HCI_PM_TEST              1'h0
    14      W1O     IS_DISABLE_HCI_MODEM_RF_ACCESS      1'h0
    15      W1O     IS_OTP_INVALID                      1'h0
    16      W1O     IS_DEBUG_AUTHENTICATION_INVALID     1'h0
    17      W1O     IS_ENABLE_OTP_READ_PROTECT          1'h0
    18      W1O     IS_ENABLE_OTP_WRITE_PROTECT         1'h0
    19      W1O     IS_ENABLE_IMAGE_AUTH_WHEN_RESUME    1'h0
    20      W1O     IS_OTP_READ_PROTECT_LOCK            1'h0
    21      W1O     IS_OTP_WRITE_PROTECT_LOCK           1'h0
    31:22   W1O     FW_GP_2_1                           10'h0
 */
typedef union _AON_REG_FW_GENERAL_REG14X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t IS_DISABLE_HCI_RAM_PATCH: 1;
        uint32_t IS_DISABLE_HCI_FLASH_ACCESS: 1;
        uint32_t IS_DISABLE_HCI_SYSTEM_ACCESS: 1;
        uint32_t IS_DISABLE_HCI_OTP_ACCESS: 1;
        uint32_t IS_DISABLE_HCI_READ_CHIP_INFO: 1;
        uint32_t IS_DISABLE_HCI_MAC_RF_ACCESS: 1;
        uint32_t IS_DISABLE_HCI_WIFI_COEXIST_FUNC: 1;
        uint32_t IS_DISABLE_HCI_SET_UART_BAUDRATE: 1;
        uint32_t IS_DISABLE_HCI_RF_DBG_FUNC: 1;
        uint32_t IS_DISABLE_HCI_BT_EXTENSION: 1;
        uint32_t IS_DISABLE_HCI_BT_DBG_FUNC: 1;
        uint32_t IS_DISABLE_HCI_BT_TEST: 1;
        uint32_t IS_DISABLE_HCI_RF_TEST: 1;
        uint32_t IS_DISABLE_HCI_PM_TEST: 1;
        uint32_t IS_DISABLE_HCI_MODEM_RF_ACCESS: 1;
        uint32_t IS_OTP_INVALID: 1;
        uint32_t IS_DEBUG_AUTHENTICATION_INVALID: 1;
        uint32_t IS_ENABLE_OTP_READ_PROTECT: 1;
        uint32_t IS_ENABLE_OTP_WRITE_PROTECT: 1;
        uint32_t IS_ENABLE_IMAGE_AUTH_WHEN_RESUME: 1;
        uint32_t IS_OTP_READ_PROTECT_LOCK: 1;
        uint32_t IS_OTP_WRITE_PROTECT_LOCK: 1;
        uint32_t FW_GP_2_1: 10;
    };
} AON_REG_FW_GENERAL_REG14X_TYPE;

/*0x4000_00f8 AON_REG_FW_GENERAL_REG14X*/
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_RAM_PATCH_Pos                       0U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_RAM_PATCH_Msk                       (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_RAM_PATCH_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_FLASH_ACCESS_Pos                    1U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_FLASH_ACCESS_Msk                    (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_FLASH_ACCESS_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_SYSTEM_ACCESS_Pos                   2U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_SYSTEM_ACCESS_Msk                   (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_SYSTEM_ACCESS_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_OTP_ACCESS_Pos                      3U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_OTP_ACCESS_Msk                      (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_OTP_ACCESS_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_READ_CHIP_INFO_Pos                  4U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_READ_CHIP_INFO_Msk                  (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_READ_CHIP_INFO_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_MAC_RF_ACCESS_Pos                   5U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_MAC_RF_ACCESS_Msk                   (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_MAC_RF_ACCESS_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_WIFI_COEXIST_FUNC_Pos               6U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_WIFI_COEXIST_FUNC_Msk               (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_WIFI_COEXIST_FUNC_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_SET_UART_BAUDRATE_Pos               7U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_SET_UART_BAUDRATE_Msk               (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_SET_UART_BAUDRATE_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_RF_DBG_FUNC_Pos                     8U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_RF_DBG_FUNC_Msk                     (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_RF_DBG_FUNC_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_BT_EXTENSION_Pos                    9U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_BT_EXTENSION_Msk                    (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_BT_EXTENSION_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_BT_DBG_FUNC_Pos                     10U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_BT_DBG_FUNC_Msk                     (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_BT_DBG_FUNC_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_BT_TEST_Pos                         11U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_BT_TEST_Msk                         (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_BT_TEST_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_RF_TEST_Pos                         12U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_RF_TEST_Msk                         (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_RF_TEST_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_PM_TEST_Pos                         13U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_PM_TEST_Msk                         (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_PM_TEST_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_MODEM_RF_ACCESS_Pos                 14U
#define AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_MODEM_RF_ACCESS_Msk                 (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DISABLE_HCI_MODEM_RF_ACCESS_Pos)

