rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_FW_GENERAL_REG14X_IS_OTP_INVALID_Pos                                 15U
#define AON_REG_FW_GENERAL_REG14X_IS_OTP_INVALID_Msk                                 (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_OTP_INVALID_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_DEBUG_AUTHENTICATION_INVALID_Pos                16U
#define AON_REG_FW_GENERAL_REG14X_IS_DEBUG_AUTHENTICATION_INVALID_Msk                (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_DEBUG_AUTHENTICATION_INVALID_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_ENABLE_OTP_READ_PROTECT_Pos                     17U
#define AON_REG_FW_GENERAL_REG14X_IS_ENABLE_OTP_READ_PROTECT_Msk                     (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_ENABLE_OTP_READ_PROTECT_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_ENABLE_OTP_WRITE_PROTECT_Pos                    18U
#define AON_REG_FW_GENERAL_REG14X_IS_ENABLE_OTP_WRITE_PROTECT_Msk                    (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_ENABLE_OTP_WRITE_PROTECT_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_ENABLE_IMAGE_AUTH_WHEN_RESUME_Pos               19U
#define AON_REG_FW_GENERAL_REG14X_IS_ENABLE_IMAGE_AUTH_WHEN_RESUME_Msk               (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_ENABLE_IMAGE_AUTH_WHEN_RESUME_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_OTP_READ_PROTECT_LOCK_Pos                       20U
#define AON_REG_FW_GENERAL_REG14X_IS_OTP_READ_PROTECT_LOCK_Msk                       (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_OTP_READ_PROTECT_LOCK_Pos)

#define AON_REG_FW_GENERAL_REG14X_IS_OTP_WRITE_PROTECT_LOCK_Pos                      21U
#define AON_REG_FW_GENERAL_REG14X_IS_OTP_WRITE_PROTECT_LOCK_Msk                      (0x1UL << AON_REG_FW_GENERAL_REG14X_IS_OTP_WRITE_PROTECT_LOCK_Pos)

#define AON_REG_FW_GENERAL_REG14X_FW_GP_2_1_Pos                                      22U
#define AON_REG_FW_GENERAL_REG14X_FW_GP_2_1_Msk                                      (0x3FFUL << AON_REG_FW_GENERAL_REG14X_FW_GP_2_1_Pos)

/* 0xFC     0x4000_00fc
    0       R/W     AON_BOOT_DONE                       1'h0
    1       R/W     PON_BOOT_DONE                       1'h0
    15:2    R/W     FW_GP_2_4                           14'h0
    31:16   R/W     FW_GP_2_3                           16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG15X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t AON_BOOT_DONE: 1;
        uint32_t PON_BOOT_DONE: 1;
        uint32_t FW_GP_2_4: 14;
        uint32_t FW_GP_2_3: 16;
    };
} AON_REG_FW_GENERAL_REG15X_TYPE;

/*0x4000_00fc AON_REG_FW_GENERAL_REG15X*/
#define AON_REG_FW_GENERAL_REG15X_AON_BOOT_DONE_Pos                                  0U
#define AON_REG_FW_GENERAL_REG15X_AON_BOOT_DONE_Msk                                  (0x1UL << AON_REG_FW_GENERAL_REG15X_AON_BOOT_DONE_Pos)

#define AON_REG_FW_GENERAL_REG15X_PON_BOOT_DONE_Pos                                  1U
#define AON_REG_FW_GENERAL_REG15X_PON_BOOT_DONE_Msk                                  (0x1UL << AON_REG_FW_GENERAL_REG15X_PON_BOOT_DONE_Pos)

#define AON_REG_FW_GENERAL_REG15X_FW_GP_2_4_Pos                                      2U
#define AON_REG_FW_GENERAL_REG15X_FW_GP_2_4_Msk                                      (0x3FFFUL << AON_REG_FW_GENERAL_REG15X_FW_GP_2_4_Pos)

#define AON_REG_FW_GENERAL_REG15X_FW_GP_2_3_Pos                                      16U
#define AON_REG_FW_GENERAL_REG15X_FW_GP_2_3_Msk                                      (0xFFFFUL << AON_REG_FW_GENERAL_REG15X_FW_GP_2_3_Pos)

/* 0x100    0x4000_0100
    7:0     R/W     SYS_RESET_REASON                    8'h0
    15:8    R/W     APP_GP_2                            8'h0
    31:16   R/W     APP_GP_1                            16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG16X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SYS_RESET_REASON: 8;
        uint32_t APP_GP_2: 8;
        uint32_t APP_GP_1: 16;
    };
} AON_REG_FW_GENERAL_REG16X_TYPE;

/*0x4000_0100 AON_REG_FW_GENERAL_REG16X*/
#define AON_REG_FW_GENERAL_REG16X_SYS_RESET_REASON_Pos                               0U
#define AON_REG_FW_GENERAL_REG16X_SYS_RESET_REASON_Msk                               (0xFFUL << AON_REG_FW_GENERAL_REG16X_SYS_RESET_REASON_Pos)

#define AON_REG_FW_GENERAL_REG16X_APP_GP_2_Pos                                       8U
#define AON_REG_FW_GENERAL_REG16X_APP_GP_2_Msk                                       (0xFFUL << AON_REG_FW_GENERAL_REG16X_APP_GP_2_Pos)

#define AON_REG_FW_GENERAL_REG16X_APP_GP_1_Pos                                       16U
#define AON_REG_FW_GENERAL_REG16X_APP_GP_1_Msk                                       (0xFFFFUL << AON_REG_FW_GENERAL_REG16X_APP_GP_1_Pos)

/* 0x104    0x4000_0104
    15:0    R/W     APP_GP_4                                                    16'h0
    31:16   R/W     APP_GP_3                                                    16'h0
 */
typedef union _AON_REG_FW_GENERAL_REG17X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t APP_GP_4: 16;
        uint32_t APP_GP_3: 16;
    };
} AON_REG_FW_GENERAL_REG17X_TYPE;

/*0x4000_0104 AON_REG_FW_GENERAL_REG17X*/
#define AON_REG_FW_GENERAL_REG17X_APP_GP_4_Pos                                                                           0U
#define AON_REG_FW_GENERAL_REG17X_APP_GP_4_Msk                                                                           (0xFFFFUL << AON_REG_FW_GENERAL_REG17X_APP_GP_4_Pos)

#define AON_REG_FW_GENERAL_REG17X_APP_GP_3_Pos                                                                           16U
#define AON_REG_FW_GENERAL_REG17X_APP_GP_3_Msk                                                                           (0xFFFFUL << AON_REG_FW_GENERAL_REG17X_APP_GP_3_Pos)

/* 0x120    0x4000_0120
    0       R/W     PAD_P0_O_0                                                  1'b0
    1       R/W     PAD_P0_E_0                                                  1'b0
    2       R/W     PAD_P0_PU_EN_0                                              1'b1
    3       R/W     AON_PAD_P0_PD_0                                             1'b0
    4       R/W     PAD_P0_PUPDC_0                                              1'b0
    5       R/W     PAD_P0_WKEN_0                                               1'b0
    6       R/W     PAD_P0_WKPOL_0                                              1'b0
    7       R/W     PAD_P0_SHDN_0                                               1'b1
    8       R/W     PAD_P0_DEB_0                                                1'b0
    9       R/W     PAD_P0_RAP_WKEN_0                                           1'b0
    10      R/W     PAD_P0_PPU_WKEN_0                                           1'b0
    11      R/W     RESERVED_3                                                  1'b0
    13:12   R       RESERVED_2                                                  2'b00
    15:14   R/W     PAD_P0_AON_MUX_0                                            2'b00
    16      R/W     PAD_P0_O_1                                                  1'b0
    17      R/W     PAD_P0_E_1                                                  1'b0
    18      R/W     PAD_P0_PU_EN_1                                              1'b1
    19      R/W     AON_PAD_P0_PD_1                                             1'b1
    20      R/W     PAD_P0_PUPDC_1                                              1'b0
    21      R/W     PAD_P0_WKEN_1                                               1'b0
    22      R/W     PAD_P0_WKPOL_1                                              1'b0
    23      R/W     PAD_P0_SHDN_1                                               1'b1
    24      R/W     PAD_P0_DEB_1                                                1'b0
    25      R/W     PAD_P0_RAP_WKEN_1                                           1'b0
    26      R/W     PAD_P0_PPU_WKEN_1                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    29:28   R       RESERVED                                                    2'b00
    31:30   R/W     PAD_P0_AON_MUX_1                                            2'b00
 */
typedef union _AON_REG_PAD_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P0_O_0: 1;
        uint32_t PAD_P0_E_0: 1;
        uint32_t PAD_P0_PU_EN_0: 1;
        uint32_t AON_PAD_P0_PD_0: 1;
        uint32_t PAD_P0_PUPDC_0: 1;
        uint32_t PAD_P0_WKEN_0: 1;
        uint32_t PAD_P0_WKPOL_0: 1;
        uint32_t PAD_P0_SHDN_0: 1;
        uint32_t PAD_P0_DEB_0: 1;
        uint32_t PAD_P0_RAP_WKEN_0: 1;
        uint32_t PAD_P0_PPU_WKEN_0: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t PAD_P0_AON_MUX_0: 2;
        uint32_t PAD_P0_O_1: 1;
        uint32_t PAD_P0_E_1: 1;
        uint32_t PAD_P0_PU_EN_1: 1;
        uint32_t AON_PAD_P0_PD_1: 1;
        uint32_t PAD_P0_PUPDC_1: 1;
        uint32_t PAD_P0_WKEN_1: 1;
        uint32_t PAD_P0_WKPOL_1: 1;
        uint32_t PAD_P0_SHDN_1: 1;
        uint32_t PAD_P0_DEB_1: 1;
        uint32_t PAD_P0_RAP_WKEN_1: 1;
        uint32_t PAD_P0_PPU_WKEN_1: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t PAD_P0_AON_MUX_1: 2;
    };
} AON_REG_PAD_REG0X_TYPE;

/*0x4000_0120 AON_REG_PAD_REG0X*/
#define AON_REG_PAD_REG0X_PAD_P0_O_0_Pos                                                                                 0U
#define AON_REG_PAD_REG0X_PAD_P0_O_0_Msk                                                                                 (0x1UL << AON_REG_PAD_REG0X_PAD_P0_O_0_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_E_0_Pos                                                                                 1U
#define AON_REG_PAD_REG0X_PAD_P0_E_0_Msk                                                                                 (0x1UL << AON_REG_PAD_REG0X_PAD_P0_E_0_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_PU_EN_0_Pos                                                                             2U
#define AON_REG_PAD_REG0X_PAD_P0_PU_EN_0_Msk                                                                             (0x1UL << AON_REG_PAD_REG0X_PAD_P0_PU_EN_0_Pos)

#define AON_REG_PAD_REG0X_AON_PAD_P0_PD_0_Pos                                                                            3U
#define AON_REG_PAD_REG0X_AON_PAD_P0_PD_0_Msk                                                                            (0x1UL << AON_REG_PAD_REG0X_AON_PAD_P0_PD_0_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_PUPDC_0_Pos                                                                             4U
#define AON_REG_PAD_REG0X_PAD_P0_PUPDC_0_Msk                                                                             (0x1UL << AON_REG_PAD_REG0X_PAD_P0_PUPDC_0_Pos)

