rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG0X_PAD_P0_WKEN_0_Pos                                                                              5U
#define AON_REG_PAD_REG0X_PAD_P0_WKEN_0_Msk                                                                              (0x1UL << AON_REG_PAD_REG0X_PAD_P0_WKEN_0_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_WKPOL_0_Pos                                                                             6U
#define AON_REG_PAD_REG0X_PAD_P0_WKPOL_0_Msk                                                                             (0x1UL << AON_REG_PAD_REG0X_PAD_P0_WKPOL_0_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_SHDN_0_Pos                                                                              7U
#define AON_REG_PAD_REG0X_PAD_P0_SHDN_0_Msk                                                                              (0x1UL << AON_REG_PAD_REG0X_PAD_P0_SHDN_0_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_DEB_0_Pos                                                                               8U
#define AON_REG_PAD_REG0X_PAD_P0_DEB_0_Msk                                                                               (0x1UL << AON_REG_PAD_REG0X_PAD_P0_DEB_0_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_RAP_WKEN_0_Pos                                                                          9U
#define AON_REG_PAD_REG0X_PAD_P0_RAP_WKEN_0_Msk                                                                          (0x1UL << AON_REG_PAD_REG0X_PAD_P0_RAP_WKEN_0_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_PPU_WKEN_0_Pos                                                                          10U
#define AON_REG_PAD_REG0X_PAD_P0_PPU_WKEN_0_Msk                                                                          (0x1UL << AON_REG_PAD_REG0X_PAD_P0_PPU_WKEN_0_Pos)

#define AON_REG_PAD_REG0X_RESERVED_3_Pos                                                                                 11U
#define AON_REG_PAD_REG0X_RESERVED_3_Msk                                                                                 (0x1UL << AON_REG_PAD_REG0X_RESERVED_3_Pos)

#define AON_REG_PAD_REG0X_RESERVED_2_Pos                                                                                 12U
#define AON_REG_PAD_REG0X_RESERVED_2_Msk                                                                                 (0x3UL << AON_REG_PAD_REG0X_RESERVED_2_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_AON_MUX_0_Pos                                                                           14U
#define AON_REG_PAD_REG0X_PAD_P0_AON_MUX_0_Msk                                                                           (0x3UL << AON_REG_PAD_REG0X_PAD_P0_AON_MUX_0_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_O_1_Pos                                                                                 16U
#define AON_REG_PAD_REG0X_PAD_P0_O_1_Msk                                                                                 (0x1UL << AON_REG_PAD_REG0X_PAD_P0_O_1_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_E_1_Pos                                                                                 17U
#define AON_REG_PAD_REG0X_PAD_P0_E_1_Msk                                                                                 (0x1UL << AON_REG_PAD_REG0X_PAD_P0_E_1_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_PU_EN_1_Pos                                                                             18U
#define AON_REG_PAD_REG0X_PAD_P0_PU_EN_1_Msk                                                                             (0x1UL << AON_REG_PAD_REG0X_PAD_P0_PU_EN_1_Pos)

#define AON_REG_PAD_REG0X_AON_PAD_P0_PD_1_Pos                                                                            19U
#define AON_REG_PAD_REG0X_AON_PAD_P0_PD_1_Msk                                                                            (0x1UL << AON_REG_PAD_REG0X_AON_PAD_P0_PD_1_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_PUPDC_1_Pos                                                                             20U
#define AON_REG_PAD_REG0X_PAD_P0_PUPDC_1_Msk                                                                             (0x1UL << AON_REG_PAD_REG0X_PAD_P0_PUPDC_1_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_WKEN_1_Pos                                                                              21U
#define AON_REG_PAD_REG0X_PAD_P0_WKEN_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG0X_PAD_P0_WKEN_1_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_WKPOL_1_Pos                                                                             22U
#define AON_REG_PAD_REG0X_PAD_P0_WKPOL_1_Msk                                                                             (0x1UL << AON_REG_PAD_REG0X_PAD_P0_WKPOL_1_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_SHDN_1_Pos                                                                              23U
#define AON_REG_PAD_REG0X_PAD_P0_SHDN_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG0X_PAD_P0_SHDN_1_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_DEB_1_Pos                                                                               24U
#define AON_REG_PAD_REG0X_PAD_P0_DEB_1_Msk                                                                               (0x1UL << AON_REG_PAD_REG0X_PAD_P0_DEB_1_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_RAP_WKEN_1_Pos                                                                          25U
#define AON_REG_PAD_REG0X_PAD_P0_RAP_WKEN_1_Msk                                                                          (0x1UL << AON_REG_PAD_REG0X_PAD_P0_RAP_WKEN_1_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_PPU_WKEN_1_Pos                                                                          26U
#define AON_REG_PAD_REG0X_PAD_P0_PPU_WKEN_1_Msk                                                                          (0x1UL << AON_REG_PAD_REG0X_PAD_P0_PPU_WKEN_1_Pos)

#define AON_REG_PAD_REG0X_RESERVED_1_Pos                                                                                 27U
#define AON_REG_PAD_REG0X_RESERVED_1_Msk                                                                                 (0x1UL << AON_REG_PAD_REG0X_RESERVED_1_Pos)

#define AON_REG_PAD_REG0X_RESERVED_Pos                                                                                   28U
#define AON_REG_PAD_REG0X_RESERVED_Msk                                                                                   (0x3UL << AON_REG_PAD_REG0X_RESERVED_Pos)

#define AON_REG_PAD_REG0X_PAD_P0_AON_MUX_1_Pos                                                                           30U
#define AON_REG_PAD_REG0X_PAD_P0_AON_MUX_1_Msk                                                                           (0x3UL << AON_REG_PAD_REG0X_PAD_P0_AON_MUX_1_Pos)

