rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x124    0x4000_0124
    0       R/W     PAD_P0_O_2                                                  1'b0
    1       R/W     PAD_P0_E_2                                                  1'b0
    2       R/W     PAD_P0_PU_EN_2                                              1'b1
    3       R/W     AON_PAD_P0_PD_2                                             1'b0
    4       R/W     PAD_P0_PUPDC_2                                              1'b0
    5       R/W     PAD_P0_WKEN_2                                               1'b0
    6       R/W     PAD_P0_WKPOL_2                                              1'b0
    7       R/W     PAD_P0_SHDN_2                                               1'b1
    8       R/W     PAD_P0_DEB_2                                                1'b0
    9       R/W     PAD_P0_RAP_WKEN_2                                           1'b0
    10      R/W     PAD_P0_PPU_WKEN_2                                           1'b0
    11      R/W     RESERVED_3                                                  1'b0
    13:12   R       RESERVED_2                                                  2'b00
    15:14   R/W     PAD_P0_AON_MUX_2                                            2'b00
    16      R/W     PAD_P0_O_3                                                  1'b0
    17      R/W     PAD_P0_E_3                                                  1'b0
    18      R/W     PAD_P0_PU_EN_3                                              1'b1
    19      R/W     AON_PAD_P0_PD_3                                             1'b0
    20      R/W     PAD_P0_PUPDC_3                                              1'b0
    21      R/W     PAD_P0_WKEN_3                                               1'b0
    22      R/W     PAD_P0_WKPOL_3                                              1'b0
    23      R/W     PAD_P0_SHDN_3                                               1'b1
    24      R/W     PAD_P0_DEB_3                                                1'b0
    25      R/W     PAD_P0_RAP_WKEN_3                                           1'b0
    26      R/W     PAD_P0_PPU_WKEN_3                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    28      R       RESERVED                                                    1'b0
    29      R       PAD_P0_I_3                                                  1'b0
    31:30   R/W     PAD_P0_AON_MUX_3                                            2'b00
 */
typedef union _AON_REG_PAD_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P0_O_2: 1;
        uint32_t PAD_P0_E_2: 1;
        uint32_t PAD_P0_PU_EN_2: 1;
        uint32_t AON_PAD_P0_PD_2: 1;
        uint32_t PAD_P0_PUPDC_2: 1;
        uint32_t PAD_P0_WKEN_2: 1;
        uint32_t PAD_P0_WKPOL_2: 1;
        uint32_t PAD_P0_SHDN_2: 1;
        uint32_t PAD_P0_DEB_2: 1;
        uint32_t PAD_P0_RAP_WKEN_2: 1;
        uint32_t PAD_P0_PPU_WKEN_2: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t PAD_P0_AON_MUX_2: 2;
        uint32_t PAD_P0_O_3: 1;
        uint32_t PAD_P0_E_3: 1;
        uint32_t PAD_P0_PU_EN_3: 1;
        uint32_t AON_PAD_P0_PD_3: 1;
        uint32_t PAD_P0_PUPDC_3: 1;
        uint32_t PAD_P0_WKEN_3: 1;
        uint32_t PAD_P0_WKPOL_3: 1;
        uint32_t PAD_P0_SHDN_3: 1;
        uint32_t PAD_P0_DEB_3: 1;
        uint32_t PAD_P0_RAP_WKEN_3: 1;
        uint32_t PAD_P0_PPU_WKEN_3: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t PAD_P0_I_3: 1;
        uint32_t PAD_P0_AON_MUX_3: 2;
    };
} AON_REG_PAD_REG1X_TYPE;

/*0x4000_0124 AON_REG_PAD_REG1X*/
#define AON_REG_PAD_REG1X_PAD_P0_O_2_Pos                                                                                 0U
#define AON_REG_PAD_REG1X_PAD_P0_O_2_Msk                                                                                 (0x1UL << AON_REG_PAD_REG1X_PAD_P0_O_2_Pos)

#define AON_REG_PAD_REG1X_PAD_P0_E_2_Pos                                                                                 1U
#define AON_REG_PAD_REG1X_PAD_P0_E_2_Msk                                                                                 (0x1UL << AON_REG_PAD_REG1X_PAD_P0_E_2_Pos)

#define AON_REG_PAD_REG1X_PAD_P0_PU_EN_2_Pos                                                                             2U
#define AON_REG_PAD_REG1X_PAD_P0_PU_EN_2_Msk                                                                             (0x1UL << AON_REG_PAD_REG1X_PAD_P0_PU_EN_2_Pos)

#define AON_REG_PAD_REG1X_AON_PAD_P0_PD_2_Pos                                                                            3U
#define AON_REG_PAD_REG1X_AON_PAD_P0_PD_2_Msk                                                                            (0x1UL << AON_REG_PAD_REG1X_AON_PAD_P0_PD_2_Pos)

#define AON_REG_PAD_REG1X_PAD_P0_PUPDC_2_Pos                                                                             4U
#define AON_REG_PAD_REG1X_PAD_P0_PUPDC_2_Msk                                                                             (0x1UL << AON_REG_PAD_REG1X_PAD_P0_PUPDC_2_Pos)

#define AON_REG_PAD_REG1X_PAD_P0_WKEN_2_Pos                                                                              5U
#define AON_REG_PAD_REG1X_PAD_P0_WKEN_2_Msk                                                                              (0x1UL << AON_REG_PAD_REG1X_PAD_P0_WKEN_2_Pos)

#define AON_REG_PAD_REG1X_PAD_P0_WKPOL_2_Pos                                                                             6U
#define AON_REG_PAD_REG1X_PAD_P0_WKPOL_2_Msk                                                                             (0x1UL << AON_REG_PAD_REG1X_PAD_P0_WKPOL_2_Pos)

#define AON_REG_PAD_REG1X_PAD_P0_SHDN_2_Pos                                                                              7U
#define AON_REG_PAD_REG1X_PAD_P0_SHDN_2_Msk                                                                              (0x1UL << AON_REG_PAD_REG1X_PAD_P0_SHDN_2_Pos)

#define AON_REG_PAD_REG1X_PAD_P0_DEB_2_Pos                                                                               8U
#define AON_REG_PAD_REG1X_PAD_P0_DEB_2_Msk                                                                               (0x1UL << AON_REG_PAD_REG1X_PAD_P0_DEB_2_Pos)

#define AON_REG_PAD_REG1X_PAD_P0_RAP_WKEN_2_Pos                                                                          9U
#define AON_REG_PAD_REG1X_PAD_P0_RAP_WKEN_2_Msk                                                                          (0x1UL << AON_REG_PAD_REG1X_PAD_P0_RAP_WKEN_2_Pos)

#define AON_REG_PAD_REG1X_PAD_P0_PPU_WKEN_2_Pos                                                                          10U
#define AON_REG_PAD_REG1X_PAD_P0_PPU_WKEN_2_Msk                                                                          (0x1UL << AON_REG_PAD_REG1X_PAD_P0_PPU_WKEN_2_Pos)

#define AON_REG_PAD_REG1X_RESERVED_3_Pos                                                                                 11U
#define AON_REG_PAD_REG1X_RESERVED_3_Msk                                                                                 (0x1UL << AON_REG_PAD_REG1X_RESERVED_3_Pos)

