rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0128 AON_REG_PAD_REG2X*/
#define AON_REG_PAD_REG2X_PAD_P0_O_4_Pos                                                                                 0U
#define AON_REG_PAD_REG2X_PAD_P0_O_4_Msk                                                                                 (0x1UL << AON_REG_PAD_REG2X_PAD_P0_O_4_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_E_4_Pos                                                                                 1U
#define AON_REG_PAD_REG2X_PAD_P0_E_4_Msk                                                                                 (0x1UL << AON_REG_PAD_REG2X_PAD_P0_E_4_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_PU_EN_4_Pos                                                                             2U
#define AON_REG_PAD_REG2X_PAD_P0_PU_EN_4_Msk                                                                             (0x1UL << AON_REG_PAD_REG2X_PAD_P0_PU_EN_4_Pos)

#define AON_REG_PAD_REG2X_AON_PAD_P0_PD_4_Pos                                                                            3U
#define AON_REG_PAD_REG2X_AON_PAD_P0_PD_4_Msk                                                                            (0x1UL << AON_REG_PAD_REG2X_AON_PAD_P0_PD_4_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_PUPDC_4_Pos                                                                             4U
#define AON_REG_PAD_REG2X_PAD_P0_PUPDC_4_Msk                                                                             (0x1UL << AON_REG_PAD_REG2X_PAD_P0_PUPDC_4_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_WKEN_4_Pos                                                                              5U
#define AON_REG_PAD_REG2X_PAD_P0_WKEN_4_Msk                                                                              (0x1UL << AON_REG_PAD_REG2X_PAD_P0_WKEN_4_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_WKPOL_4_Pos                                                                             6U
#define AON_REG_PAD_REG2X_PAD_P0_WKPOL_4_Msk                                                                             (0x1UL << AON_REG_PAD_REG2X_PAD_P0_WKPOL_4_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_SHDN_4_Pos                                                                              7U
#define AON_REG_PAD_REG2X_PAD_P0_SHDN_4_Msk                                                                              (0x1UL << AON_REG_PAD_REG2X_PAD_P0_SHDN_4_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_DEB_4_Pos                                                                               8U
#define AON_REG_PAD_REG2X_PAD_P0_DEB_4_Msk                                                                               (0x1UL << AON_REG_PAD_REG2X_PAD_P0_DEB_4_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_RAP_WKEN_4_Pos                                                                          9U
#define AON_REG_PAD_REG2X_PAD_P0_RAP_WKEN_4_Msk                                                                          (0x1UL << AON_REG_PAD_REG2X_PAD_P0_RAP_WKEN_4_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_PPU_WKEN_4_Pos                                                                          10U
#define AON_REG_PAD_REG2X_PAD_P0_PPU_WKEN_4_Msk                                                                          (0x1UL << AON_REG_PAD_REG2X_PAD_P0_PPU_WKEN_4_Pos)

#define AON_REG_PAD_REG2X_RESERVED_3_Pos                                                                                 11U
#define AON_REG_PAD_REG2X_RESERVED_3_Msk                                                                                 (0x1UL << AON_REG_PAD_REG2X_RESERVED_3_Pos)

#define AON_REG_PAD_REG2X_RESERVED_2_Pos                                                                                 12U
#define AON_REG_PAD_REG2X_RESERVED_2_Msk                                                                                 (0x3UL << AON_REG_PAD_REG2X_RESERVED_2_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_AON_MUX_4_Pos                                                                           14U
#define AON_REG_PAD_REG2X_PAD_P0_AON_MUX_4_Msk                                                                           (0x3UL << AON_REG_PAD_REG2X_PAD_P0_AON_MUX_4_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_O_5_Pos                                                                                 16U
#define AON_REG_PAD_REG2X_PAD_P0_O_5_Msk                                                                                 (0x1UL << AON_REG_PAD_REG2X_PAD_P0_O_5_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_E_5_Pos                                                                                 17U
#define AON_REG_PAD_REG2X_PAD_P0_E_5_Msk                                                                                 (0x1UL << AON_REG_PAD_REG2X_PAD_P0_E_5_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_PU_EN_5_Pos                                                                             18U
#define AON_REG_PAD_REG2X_PAD_P0_PU_EN_5_Msk                                                                             (0x1UL << AON_REG_PAD_REG2X_PAD_P0_PU_EN_5_Pos)

#define AON_REG_PAD_REG2X_AON_PAD_P0_PD_5_Pos                                                                            19U
#define AON_REG_PAD_REG2X_AON_PAD_P0_PD_5_Msk                                                                            (0x1UL << AON_REG_PAD_REG2X_AON_PAD_P0_PD_5_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_PUPDC_5_Pos                                                                             20U
#define AON_REG_PAD_REG2X_PAD_P0_PUPDC_5_Msk                                                                             (0x1UL << AON_REG_PAD_REG2X_PAD_P0_PUPDC_5_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_WKEN_5_Pos                                                                              21U
#define AON_REG_PAD_REG2X_PAD_P0_WKEN_5_Msk                                                                              (0x1UL << AON_REG_PAD_REG2X_PAD_P0_WKEN_5_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_WKPOL_5_Pos                                                                             22U
#define AON_REG_PAD_REG2X_PAD_P0_WKPOL_5_Msk                                                                             (0x1UL << AON_REG_PAD_REG2X_PAD_P0_WKPOL_5_Pos)

