rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG2X_PAD_P0_SHDN_5_Pos                                                                              23U
#define AON_REG_PAD_REG2X_PAD_P0_SHDN_5_Msk                                                                              (0x1UL << AON_REG_PAD_REG2X_PAD_P0_SHDN_5_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_DEB_5_Pos                                                                               24U
#define AON_REG_PAD_REG2X_PAD_P0_DEB_5_Msk                                                                               (0x1UL << AON_REG_PAD_REG2X_PAD_P0_DEB_5_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_RAP_WKEN_5_Pos                                                                          25U
#define AON_REG_PAD_REG2X_PAD_P0_RAP_WKEN_5_Msk                                                                          (0x1UL << AON_REG_PAD_REG2X_PAD_P0_RAP_WKEN_5_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_PPU_WKEN_5_Pos                                                                          26U
#define AON_REG_PAD_REG2X_PAD_P0_PPU_WKEN_5_Msk                                                                          (0x1UL << AON_REG_PAD_REG2X_PAD_P0_PPU_WKEN_5_Pos)

#define AON_REG_PAD_REG2X_RESERVED_1_Pos                                                                                 27U
#define AON_REG_PAD_REG2X_RESERVED_1_Msk                                                                                 (0x1UL << AON_REG_PAD_REG2X_RESERVED_1_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_E2_AUX_5_Pos                                                                            28U
#define AON_REG_PAD_REG2X_PAD_P0_E2_AUX_5_Msk                                                                            (0x1UL << AON_REG_PAD_REG2X_PAD_P0_E2_AUX_5_Pos)

#define AON_REG_PAD_REG2X_RESERVED_Pos                                                                                   29U
#define AON_REG_PAD_REG2X_RESERVED_Msk                                                                                   (0x1UL << AON_REG_PAD_REG2X_RESERVED_Pos)

#define AON_REG_PAD_REG2X_PAD_P0_AON_MUX_5_Pos                                                                           30U
#define AON_REG_PAD_REG2X_PAD_P0_AON_MUX_5_Msk                                                                           (0x3UL << AON_REG_PAD_REG2X_PAD_P0_AON_MUX_5_Pos)

/* 0x12C    0x4000_012c
    0       R/W     PAD_P0_O_6                                                  1'b0
    1       R/W     PAD_P0_E_6                                                  1'b0
    2       R/W     PAD_P0_PU_EN_6                                              1'b1
    3       R/W     AON_PAD_P0_PD_6                                             1'b1
    4       R/W     PAD_P0_PUPDC_6                                              1'b0
    5       R/W     PAD_P0_WKEN_6                                               1'b0
    6       R/W     PAD_P0_WKPOL_6                                              1'b0
    7       R/W     PAD_P0_SHDN_6                                               1'b1
    8       R/W     PAD_P0_DEB_6                                                1'b0
    9       R/W     PAD_P0_RAP_WKEN_6                                           1'b0
    10      R/W     PAD_P0_PPU_WKEN_6                                           1'b0
    11      R/W     RESERVED_3                                                  1'b0
    13:12   R       RESERVED_2                                                  2'b00
    15:14   R/W     PAD_P0_AON_MUX_6                                            2'b00
    16      R/W     PAD_P0_O_7                                                  1'b0
    17      R/W     PAD_P0_E_7                                                  1'b0
    18      R/W     PAD_P0_PU_EN_7                                              1'b1
    19      R/W     AON_PAD_P0_PD_7                                             1'b1
    20      R/W     PAD_P0_PUPDC_7                                              1'b0
    21      R/W     PAD_P0_WKEN_7                                               1'b0
    22      R/W     PAD_P0_WKPOL_7                                              1'b0
    23      R/W     PAD_P0_SHDN_7                                               1'b1
    24      R/W     PAD_P0_DEB_7                                                1'b0
    25      R/W     PAD_P0_RAP_WKEN_7                                           1'b0
    26      R/W     PAD_P0_PPU_WKEN_7                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    29:28   R       RESERVED                                                    2'b00
    31:30   R/W     PAD_P0_AON_MUX_7                                            2'b00
 */
typedef union _AON_REG_PAD_REG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P0_O_6: 1;
        uint32_t PAD_P0_E_6: 1;
        uint32_t PAD_P0_PU_EN_6: 1;
        uint32_t AON_PAD_P0_PD_6: 1;
        uint32_t PAD_P0_PUPDC_6: 1;
        uint32_t PAD_P0_WKEN_6: 1;
        uint32_t PAD_P0_WKPOL_6: 1;
        uint32_t PAD_P0_SHDN_6: 1;
        uint32_t PAD_P0_DEB_6: 1;
        uint32_t PAD_P0_RAP_WKEN_6: 1;
        uint32_t PAD_P0_PPU_WKEN_6: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t PAD_P0_AON_MUX_6: 2;
        uint32_t PAD_P0_O_7: 1;
        uint32_t PAD_P0_E_7: 1;
        uint32_t PAD_P0_PU_EN_7: 1;
        uint32_t AON_PAD_P0_PD_7: 1;
        uint32_t PAD_P0_PUPDC_7: 1;
        uint32_t PAD_P0_WKEN_7: 1;
        uint32_t PAD_P0_WKPOL_7: 1;
        uint32_t PAD_P0_SHDN_7: 1;
        uint32_t PAD_P0_DEB_7: 1;
        uint32_t PAD_P0_RAP_WKEN_7: 1;
        uint32_t PAD_P0_PPU_WKEN_7: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t PAD_P0_AON_MUX_7: 2;
    };
} AON_REG_PAD_REG3X_TYPE;

/*0x4000_012c AON_REG_PAD_REG3X*/
#define AON_REG_PAD_REG3X_PAD_P0_O_6_Pos                                                                                 0U
#define AON_REG_PAD_REG3X_PAD_P0_O_6_Msk                                                                                 (0x1UL << AON_REG_PAD_REG3X_PAD_P0_O_6_Pos)

#define AON_REG_PAD_REG3X_PAD_P0_E_6_Pos                                                                                 1U
#define AON_REG_PAD_REG3X_PAD_P0_E_6_Msk                                                                                 (0x1UL << AON_REG_PAD_REG3X_PAD_P0_E_6_Pos)

#define AON_REG_PAD_REG3X_PAD_P0_PU_EN_6_Pos                                                                             2U
#define AON_REG_PAD_REG3X_PAD_P0_PU_EN_6_Msk                                                                             (0x1UL << AON_REG_PAD_REG3X_PAD_P0_PU_EN_6_Pos)

#define AON_REG_PAD_REG3X_AON_PAD_P0_PD_6_Pos                                                                            3U
#define AON_REG_PAD_REG3X_AON_PAD_P0_PD_6_Msk                                                                            (0x1UL << AON_REG_PAD_REG3X_AON_PAD_P0_PD_6_Pos)

#define AON_REG_PAD_REG3X_PAD_P0_PUPDC_6_Pos                                                                             4U
#define AON_REG_PAD_REG3X_PAD_P0_PUPDC_6_Msk                                                                             (0x1UL << AON_REG_PAD_REG3X_PAD_P0_PUPDC_6_Pos)

#define AON_REG_PAD_REG3X_PAD_P0_WKEN_6_Pos                                                                              5U
#define AON_REG_PAD_REG3X_PAD_P0_WKEN_6_Msk                                                                              (0x1UL << AON_REG_PAD_REG3X_PAD_P0_WKEN_6_Pos)

#define AON_REG_PAD_REG3X_PAD_P0_WKPOL_6_Pos                                                                             6U
#define AON_REG_PAD_REG3X_PAD_P0_WKPOL_6_Msk                                                                             (0x1UL << AON_REG_PAD_REG3X_PAD_P0_WKPOL_6_Pos)

