rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG4X_PAD_P1_RAP_WKEN_0_Pos                                                                          9U
#define AON_REG_PAD_REG4X_PAD_P1_RAP_WKEN_0_Msk                                                                          (0x1UL << AON_REG_PAD_REG4X_PAD_P1_RAP_WKEN_0_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_PPU_WKEN_0_Pos                                                                          10U
#define AON_REG_PAD_REG4X_PAD_P1_PPU_WKEN_0_Msk                                                                          (0x1UL << AON_REG_PAD_REG4X_PAD_P1_PPU_WKEN_0_Pos)

#define AON_REG_PAD_REG4X_RESERVED_3_Pos                                                                                 11U
#define AON_REG_PAD_REG4X_RESERVED_3_Msk                                                                                 (0x1UL << AON_REG_PAD_REG4X_RESERVED_3_Pos)

#define AON_REG_PAD_REG4X_RESERVED_2_Pos                                                                                 12U
#define AON_REG_PAD_REG4X_RESERVED_2_Msk                                                                                 (0x3UL << AON_REG_PAD_REG4X_RESERVED_2_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_AON_MUX_0_Pos                                                                           14U
#define AON_REG_PAD_REG4X_PAD_P1_AON_MUX_0_Msk                                                                           (0x3UL << AON_REG_PAD_REG4X_PAD_P1_AON_MUX_0_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_O_1_Pos                                                                                 16U
#define AON_REG_PAD_REG4X_PAD_P1_O_1_Msk                                                                                 (0x1UL << AON_REG_PAD_REG4X_PAD_P1_O_1_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_E_1_Pos                                                                                 17U
#define AON_REG_PAD_REG4X_PAD_P1_E_1_Msk                                                                                 (0x1UL << AON_REG_PAD_REG4X_PAD_P1_E_1_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_PU_EN_1_Pos                                                                             18U
#define AON_REG_PAD_REG4X_PAD_P1_PU_EN_1_Msk                                                                             (0x1UL << AON_REG_PAD_REG4X_PAD_P1_PU_EN_1_Pos)

#define AON_REG_PAD_REG4X_AON_PAD_P1_PD_1_Pos                                                                            19U
#define AON_REG_PAD_REG4X_AON_PAD_P1_PD_1_Msk                                                                            (0x1UL << AON_REG_PAD_REG4X_AON_PAD_P1_PD_1_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_PUPDC_1_Pos                                                                             20U
#define AON_REG_PAD_REG4X_PAD_P1_PUPDC_1_Msk                                                                             (0x1UL << AON_REG_PAD_REG4X_PAD_P1_PUPDC_1_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_WKEN_1_Pos                                                                              21U
#define AON_REG_PAD_REG4X_PAD_P1_WKEN_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG4X_PAD_P1_WKEN_1_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_WKPOL_1_Pos                                                                             22U
#define AON_REG_PAD_REG4X_PAD_P1_WKPOL_1_Msk                                                                             (0x1UL << AON_REG_PAD_REG4X_PAD_P1_WKPOL_1_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_SHDN_1_Pos                                                                              23U
#define AON_REG_PAD_REG4X_PAD_P1_SHDN_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG4X_PAD_P1_SHDN_1_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_DEB_1_Pos                                                                               24U
#define AON_REG_PAD_REG4X_PAD_P1_DEB_1_Msk                                                                               (0x1UL << AON_REG_PAD_REG4X_PAD_P1_DEB_1_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_RAP_WKEN_1_Pos                                                                          25U
#define AON_REG_PAD_REG4X_PAD_P1_RAP_WKEN_1_Msk                                                                          (0x1UL << AON_REG_PAD_REG4X_PAD_P1_RAP_WKEN_1_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_PPU_WKEN_1_Pos                                                                          26U
#define AON_REG_PAD_REG4X_PAD_P1_PPU_WKEN_1_Msk                                                                          (0x1UL << AON_REG_PAD_REG4X_PAD_P1_PPU_WKEN_1_Pos)

#define AON_REG_PAD_REG4X_RESERVED_1_Pos                                                                                 27U
#define AON_REG_PAD_REG4X_RESERVED_1_Msk                                                                                 (0x1UL << AON_REG_PAD_REG4X_RESERVED_1_Pos)

#define AON_REG_PAD_REG4X_RESERVED_Pos                                                                                   28U
#define AON_REG_PAD_REG4X_RESERVED_Msk                                                                                   (0x3UL << AON_REG_PAD_REG4X_RESERVED_Pos)

#define AON_REG_PAD_REG4X_PAD_P1_AON_MUX_1_Pos                                                                           30U
#define AON_REG_PAD_REG4X_PAD_P1_AON_MUX_1_Msk                                                                           (0x3UL << AON_REG_PAD_REG4X_PAD_P1_AON_MUX_1_Pos)

/* 0x134    0x4000_0134
    0       R/W     PAD_P1_O_6                                                  1'b0
    1       R/W     PAD_P1_E_6                                                  1'b0
    2       R/W     PAD_P1_PU_EN_6                                              1'b1
    3       R/W     AON_PAD_P1_PD_6                                             1'b1
    4       R/W     PAD_P1_PUPDC_6                                              1'b0
    5       R/W     PAD_P1_WKEN_6                                               1'b0
    6       R/W     PAD_P1_WKPOL_6                                              1'b0
    7       R/W     PAD_P1_SHDN_6                                               1'b1
    8       R/W     PAD_P1_DEB_6                                                1'b0
    9       R/W     PAD_P1_RAP_WKEN_6                                           1'b0
    10      R/W     PAD_P1_PPU_WKEN_6                                           1'b0
    11      R/W     RESERVED_3                                                  1'b0
    13:12   R       RESERVED_2                                                  2'b00
    15:14   R/W     PAD_P1_AON_MUX_6                                            2'b00
    16      R/W     PAD_P1_O_7                                                  1'b0
    17      R/W     PAD_P1_E_7                                                  1'b0
    18      R/W     PAD_P1_PU_EN_7                                              1'b1
    19      R/W     AON_PAD_P1_PD_7                                             1'b1
    20      R/W     PAD_P1_PUPDC_7                                              1'b0
    21      R/W     PAD_P1_WKEN_7                                               1'b0
    22      R/W     PAD_P1_WKPOL_7                                              1'b0
    23      R/W     PAD_P1_SHDN_7                                               1'b1
    24      R/W     PAD_P1_DEB_7                                                1'b0
    25      R/W     PAD_P1_RAP_WKEN_7                                           1'b0
    26      R/W     PAD_P1_PPU_WKEN_7                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    29:28   R       RESERVED                                                    2'b00
    31:30   R/W     PAD_P1_AON_MUX_7                                            2'b00
 */
typedef union _AON_REG_PAD_REG5X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P1_O_6: 1;
        uint32_t PAD_P1_E_6: 1;
        uint32_t PAD_P1_PU_EN_6: 1;
        uint32_t AON_PAD_P1_PD_6: 1;
        uint32_t PAD_P1_PUPDC_6: 1;
        uint32_t PAD_P1_WKEN_6: 1;
        uint32_t PAD_P1_WKPOL_6: 1;
        uint32_t PAD_P1_SHDN_6: 1;
        uint32_t PAD_P1_DEB_6: 1;
        uint32_t PAD_P1_RAP_WKEN_6: 1;
        uint32_t PAD_P1_PPU_WKEN_6: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t PAD_P1_AON_MUX_6: 2;
        uint32_t PAD_P1_O_7: 1;
        uint32_t PAD_P1_E_7: 1;
        uint32_t PAD_P1_PU_EN_7: 1;
        uint32_t AON_PAD_P1_PD_7: 1;
        uint32_t PAD_P1_PUPDC_7: 1;
        uint32_t PAD_P1_WKEN_7: 1;
        uint32_t PAD_P1_WKPOL_7: 1;
        uint32_t PAD_P1_SHDN_7: 1;
        uint32_t PAD_P1_DEB_7: 1;
        uint32_t PAD_P1_RAP_WKEN_7: 1;
        uint32_t PAD_P1_PPU_WKEN_7: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t PAD_P1_AON_MUX_7: 2;
    };
} AON_REG_PAD_REG5X_TYPE;

