rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0134 AON_REG_PAD_REG5X*/
#define AON_REG_PAD_REG5X_PAD_P1_O_6_Pos                                                                                 0U
#define AON_REG_PAD_REG5X_PAD_P1_O_6_Msk                                                                                 (0x1UL << AON_REG_PAD_REG5X_PAD_P1_O_6_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_E_6_Pos                                                                                 1U
#define AON_REG_PAD_REG5X_PAD_P1_E_6_Msk                                                                                 (0x1UL << AON_REG_PAD_REG5X_PAD_P1_E_6_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_PU_EN_6_Pos                                                                             2U
#define AON_REG_PAD_REG5X_PAD_P1_PU_EN_6_Msk                                                                             (0x1UL << AON_REG_PAD_REG5X_PAD_P1_PU_EN_6_Pos)

#define AON_REG_PAD_REG5X_AON_PAD_P1_PD_6_Pos                                                                            3U
#define AON_REG_PAD_REG5X_AON_PAD_P1_PD_6_Msk                                                                            (0x1UL << AON_REG_PAD_REG5X_AON_PAD_P1_PD_6_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_PUPDC_6_Pos                                                                             4U
#define AON_REG_PAD_REG5X_PAD_P1_PUPDC_6_Msk                                                                             (0x1UL << AON_REG_PAD_REG5X_PAD_P1_PUPDC_6_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_WKEN_6_Pos                                                                              5U
#define AON_REG_PAD_REG5X_PAD_P1_WKEN_6_Msk                                                                              (0x1UL << AON_REG_PAD_REG5X_PAD_P1_WKEN_6_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_WKPOL_6_Pos                                                                             6U
#define AON_REG_PAD_REG5X_PAD_P1_WKPOL_6_Msk                                                                             (0x1UL << AON_REG_PAD_REG5X_PAD_P1_WKPOL_6_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_SHDN_6_Pos                                                                              7U
#define AON_REG_PAD_REG5X_PAD_P1_SHDN_6_Msk                                                                              (0x1UL << AON_REG_PAD_REG5X_PAD_P1_SHDN_6_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_DEB_6_Pos                                                                               8U
#define AON_REG_PAD_REG5X_PAD_P1_DEB_6_Msk                                                                               (0x1UL << AON_REG_PAD_REG5X_PAD_P1_DEB_6_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_RAP_WKEN_6_Pos                                                                          9U
#define AON_REG_PAD_REG5X_PAD_P1_RAP_WKEN_6_Msk                                                                          (0x1UL << AON_REG_PAD_REG5X_PAD_P1_RAP_WKEN_6_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_PPU_WKEN_6_Pos                                                                          10U
#define AON_REG_PAD_REG5X_PAD_P1_PPU_WKEN_6_Msk                                                                          (0x1UL << AON_REG_PAD_REG5X_PAD_P1_PPU_WKEN_6_Pos)

#define AON_REG_PAD_REG5X_RESERVED_3_Pos                                                                                 11U
#define AON_REG_PAD_REG5X_RESERVED_3_Msk                                                                                 (0x1UL << AON_REG_PAD_REG5X_RESERVED_3_Pos)

#define AON_REG_PAD_REG5X_RESERVED_2_Pos                                                                                 12U
#define AON_REG_PAD_REG5X_RESERVED_2_Msk                                                                                 (0x3UL << AON_REG_PAD_REG5X_RESERVED_2_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_AON_MUX_6_Pos                                                                           14U
#define AON_REG_PAD_REG5X_PAD_P1_AON_MUX_6_Msk                                                                           (0x3UL << AON_REG_PAD_REG5X_PAD_P1_AON_MUX_6_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_O_7_Pos                                                                                 16U
#define AON_REG_PAD_REG5X_PAD_P1_O_7_Msk                                                                                 (0x1UL << AON_REG_PAD_REG5X_PAD_P1_O_7_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_E_7_Pos                                                                                 17U
#define AON_REG_PAD_REG5X_PAD_P1_E_7_Msk                                                                                 (0x1UL << AON_REG_PAD_REG5X_PAD_P1_E_7_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_PU_EN_7_Pos                                                                             18U
#define AON_REG_PAD_REG5X_PAD_P1_PU_EN_7_Msk                                                                             (0x1UL << AON_REG_PAD_REG5X_PAD_P1_PU_EN_7_Pos)

#define AON_REG_PAD_REG5X_AON_PAD_P1_PD_7_Pos                                                                            19U
#define AON_REG_PAD_REG5X_AON_PAD_P1_PD_7_Msk                                                                            (0x1UL << AON_REG_PAD_REG5X_AON_PAD_P1_PD_7_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_PUPDC_7_Pos                                                                             20U
#define AON_REG_PAD_REG5X_PAD_P1_PUPDC_7_Msk                                                                             (0x1UL << AON_REG_PAD_REG5X_PAD_P1_PUPDC_7_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_WKEN_7_Pos                                                                              21U
#define AON_REG_PAD_REG5X_PAD_P1_WKEN_7_Msk                                                                              (0x1UL << AON_REG_PAD_REG5X_PAD_P1_WKEN_7_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_WKPOL_7_Pos                                                                             22U
#define AON_REG_PAD_REG5X_PAD_P1_WKPOL_7_Msk                                                                             (0x1UL << AON_REG_PAD_REG5X_PAD_P1_WKPOL_7_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_SHDN_7_Pos                                                                              23U
#define AON_REG_PAD_REG5X_PAD_P1_SHDN_7_Msk                                                                              (0x1UL << AON_REG_PAD_REG5X_PAD_P1_SHDN_7_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_DEB_7_Pos                                                                               24U
#define AON_REG_PAD_REG5X_PAD_P1_DEB_7_Msk                                                                               (0x1UL << AON_REG_PAD_REG5X_PAD_P1_DEB_7_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_RAP_WKEN_7_Pos                                                                          25U
#define AON_REG_PAD_REG5X_PAD_P1_RAP_WKEN_7_Msk                                                                          (0x1UL << AON_REG_PAD_REG5X_PAD_P1_RAP_WKEN_7_Pos)

#define AON_REG_PAD_REG5X_PAD_P1_PPU_WKEN_7_Pos                                                                          26U
#define AON_REG_PAD_REG5X_PAD_P1_PPU_WKEN_7_Msk                                                                          (0x1UL << AON_REG_PAD_REG5X_PAD_P1_PPU_WKEN_7_Pos)

#define AON_REG_PAD_REG5X_RESERVED_1_Pos                                                                                 27U
#define AON_REG_PAD_REG5X_RESERVED_1_Msk                                                                                 (0x1UL << AON_REG_PAD_REG5X_RESERVED_1_Pos)

#define AON_REG_PAD_REG5X_RESERVED_Pos                                                                                   28U
#define AON_REG_PAD_REG5X_RESERVED_Msk                                                                                   (0x3UL << AON_REG_PAD_REG5X_RESERVED_Pos)

