rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG7X_PAD_P2_DEB_2_Pos                                                                               8U
#define AON_REG_PAD_REG7X_PAD_P2_DEB_2_Msk                                                                               (0x1UL << AON_REG_PAD_REG7X_PAD_P2_DEB_2_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_RAP_WKEN_2_Pos                                                                          9U
#define AON_REG_PAD_REG7X_PAD_P2_RAP_WKEN_2_Msk                                                                          (0x1UL << AON_REG_PAD_REG7X_PAD_P2_RAP_WKEN_2_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_PPU_WKEN_2_Pos                                                                          10U
#define AON_REG_PAD_REG7X_PAD_P2_PPU_WKEN_2_Msk                                                                          (0x1UL << AON_REG_PAD_REG7X_PAD_P2_PPU_WKEN_2_Pos)

#define AON_REG_PAD_REG7X_RESERVED_3_Pos                                                                                 11U
#define AON_REG_PAD_REG7X_RESERVED_3_Msk                                                                                 (0x1UL << AON_REG_PAD_REG7X_RESERVED_3_Pos)

#define AON_REG_PAD_REG7X_DUMMY_PAD2_Pos                                                                                 12U
#define AON_REG_PAD_REG7X_DUMMY_PAD2_Msk                                                                                 (0x1UL << AON_REG_PAD_REG7X_DUMMY_PAD2_Pos)

#define AON_REG_PAD_REG7X_RESERVED_2_Pos                                                                                 13U
#define AON_REG_PAD_REG7X_RESERVED_2_Msk                                                                                 (0x1UL << AON_REG_PAD_REG7X_RESERVED_2_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_AON_MUX_2_Pos                                                                           14U
#define AON_REG_PAD_REG7X_PAD_P2_AON_MUX_2_Msk                                                                           (0x3UL << AON_REG_PAD_REG7X_PAD_P2_AON_MUX_2_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_O_3_Pos                                                                                 16U
#define AON_REG_PAD_REG7X_PAD_P2_O_3_Msk                                                                                 (0x1UL << AON_REG_PAD_REG7X_PAD_P2_O_3_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_E_3_Pos                                                                                 17U
#define AON_REG_PAD_REG7X_PAD_P2_E_3_Msk                                                                                 (0x1UL << AON_REG_PAD_REG7X_PAD_P2_E_3_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_PU_EN_3_Pos                                                                             18U
#define AON_REG_PAD_REG7X_PAD_P2_PU_EN_3_Msk                                                                             (0x1UL << AON_REG_PAD_REG7X_PAD_P2_PU_EN_3_Pos)

#define AON_REG_PAD_REG7X_AON_PAD_P2_PD_3_Pos                                                                            19U
#define AON_REG_PAD_REG7X_AON_PAD_P2_PD_3_Msk                                                                            (0x1UL << AON_REG_PAD_REG7X_AON_PAD_P2_PD_3_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_PUPDC_3_Pos                                                                             20U
#define AON_REG_PAD_REG7X_PAD_P2_PUPDC_3_Msk                                                                             (0x1UL << AON_REG_PAD_REG7X_PAD_P2_PUPDC_3_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_WKEN_3_Pos                                                                              21U
#define AON_REG_PAD_REG7X_PAD_P2_WKEN_3_Msk                                                                              (0x1UL << AON_REG_PAD_REG7X_PAD_P2_WKEN_3_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_WKPOL_3_Pos                                                                             22U
#define AON_REG_PAD_REG7X_PAD_P2_WKPOL_3_Msk                                                                             (0x1UL << AON_REG_PAD_REG7X_PAD_P2_WKPOL_3_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_SHDN_3_Pos                                                                              23U
#define AON_REG_PAD_REG7X_PAD_P2_SHDN_3_Msk                                                                              (0x1UL << AON_REG_PAD_REG7X_PAD_P2_SHDN_3_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_DEB_3_Pos                                                                               24U
#define AON_REG_PAD_REG7X_PAD_P2_DEB_3_Msk                                                                               (0x1UL << AON_REG_PAD_REG7X_PAD_P2_DEB_3_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_RAP_WKEN_3_Pos                                                                          25U
#define AON_REG_PAD_REG7X_PAD_P2_RAP_WKEN_3_Msk                                                                          (0x1UL << AON_REG_PAD_REG7X_PAD_P2_RAP_WKEN_3_Pos)

#define AON_REG_PAD_REG7X_PAD_P2_PPU_WKEN_3_Pos                                                                          26U
#define AON_REG_PAD_REG7X_PAD_P2_PPU_WKEN_3_Msk                                                                          (0x1UL << AON_REG_PAD_REG7X_PAD_P2_PPU_WKEN_3_Pos)

#define AON_REG_PAD_REG7X_RESERVED_1_Pos                                                                                 27U
#define AON_REG_PAD_REG7X_RESERVED_1_Msk                                                                                 (0x1UL << AON_REG_PAD_REG7X_RESERVED_1_Pos)

#define AON_REG_PAD_REG7X_DUMMY_PAD3_Pos                                                                                 28U
#define AON_REG_PAD_REG7X_DUMMY_PAD3_Msk                                                                                 (0x1UL << AON_REG_PAD_REG7X_DUMMY_PAD3_Pos)

#define AON_REG_PAD_REG7X_RESERVED_Pos                                                                                   29U
#define AON_REG_PAD_REG7X_RESERVED_Msk                                                                                   (0x1UL << AON_REG_PAD_REG7X_RESERVED_Pos)

