rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG7X_PAD_P2_AON_MUX_3_Pos                                                                           30U
#define AON_REG_PAD_REG7X_PAD_P2_AON_MUX_3_Msk                                                                           (0x3UL << AON_REG_PAD_REG7X_PAD_P2_AON_MUX_3_Pos)

/* 0x140    0x4000_0140
    0       R/W     PAD_P2_O_4                                                  1'b0
    1       R/W     PAD_P2_E_4                                                  1'b0
    2       R/W     PAD_P2_PU_EN_4                                              1'b1
    3       R/W     AON_PAD_P2_PD_4                                             1'b1
    4       R/W     PAD_P2_PUPDC_4                                              1'b0
    5       R/W     PAD_P2_WKEN_4                                               1'b0
    6       R/W     PAD_P2_WKPOL_4                                              1'b0
    7       R/W     PAD_P2_SHDN_4                                               1'b1
    8       R/W     PAD_P2_DEB_4                                                1'b0
    9       R/W     PAD_P2_RAP_WKEN_4                                           1'b0
    10      R/W     PAD_P2_PPU_WKEN_4                                           1'b0
    11      R/W     RESERVED_3                                                  1'b0
    12      R/W     DUMMY_PAD4                                                  1'b0
    13      R       RESERVED_2                                                  1'b0
    15:14   R/W     PAD_P2_AON_MUX_4                                            2'b00
    16      R/W     PAD_P2_O_5                                                  1'b0
    17      R/W     PAD_P2_E_5                                                  1'b0
    18      R/W     PAD_P2_PU_EN_5                                              1'b1
    19      R/W     AON_PAD_P2_PD_5                                             1'b1
    20      R/W     PAD_P2_PUPDC_5                                              1'b0
    21      R/W     PAD_P2_WKEN_5                                               1'b0
    22      R/W     PAD_P2_WKPOL_5                                              1'b0
    23      R/W     PAD_P2_SHDN_5                                               1'b1
    24      R/W     PAD_P2_DEB_5                                                1'b0
    25      R/W     PAD_P2_RAP_WKEN_5                                           1'b0
    26      R/W     PAD_P2_PPU_WKEN_5                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    28      R/W     DUMMY_PAD5                                                  1'b0
    29      R       RESERVED                                                    1'b0
    31:30   R/W     PAD_P2_AON_MUX_5                                            2'b00
 */
typedef union _AON_REG_PAD_REG8X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P2_O_4: 1;
        uint32_t PAD_P2_E_4: 1;
        uint32_t PAD_P2_PU_EN_4: 1;
        uint32_t AON_PAD_P2_PD_4: 1;
        uint32_t PAD_P2_PUPDC_4: 1;
        uint32_t PAD_P2_WKEN_4: 1;
        uint32_t PAD_P2_WKPOL_4: 1;
        uint32_t PAD_P2_SHDN_4: 1;
        uint32_t PAD_P2_DEB_4: 1;
        uint32_t PAD_P2_RAP_WKEN_4: 1;
        uint32_t PAD_P2_PPU_WKEN_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t DUMMY_PAD4: 1;
        uint32_t RESERVED_2: 1;
        uint32_t PAD_P2_AON_MUX_4: 2;
        uint32_t PAD_P2_O_5: 1;
        uint32_t PAD_P2_E_5: 1;
        uint32_t PAD_P2_PU_EN_5: 1;
        uint32_t AON_PAD_P2_PD_5: 1;
        uint32_t PAD_P2_PUPDC_5: 1;
        uint32_t PAD_P2_WKEN_5: 1;
        uint32_t PAD_P2_WKPOL_5: 1;
        uint32_t PAD_P2_SHDN_5: 1;
        uint32_t PAD_P2_DEB_5: 1;
        uint32_t PAD_P2_RAP_WKEN_5: 1;
        uint32_t PAD_P2_PPU_WKEN_5: 1;
        uint32_t RESERVED_1: 1;
        uint32_t DUMMY_PAD5: 1;
        uint32_t RESERVED: 1;
        uint32_t PAD_P2_AON_MUX_5: 2;
    };
} AON_REG_PAD_REG8X_TYPE;

/*0x4000_0140 AON_REG_PAD_REG8X*/
#define AON_REG_PAD_REG8X_PAD_P2_O_4_Pos                                                                                 0U
#define AON_REG_PAD_REG8X_PAD_P2_O_4_Msk                                                                                 (0x1UL << AON_REG_PAD_REG8X_PAD_P2_O_4_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_E_4_Pos                                                                                 1U
#define AON_REG_PAD_REG8X_PAD_P2_E_4_Msk                                                                                 (0x1UL << AON_REG_PAD_REG8X_PAD_P2_E_4_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_PU_EN_4_Pos                                                                             2U
#define AON_REG_PAD_REG8X_PAD_P2_PU_EN_4_Msk                                                                             (0x1UL << AON_REG_PAD_REG8X_PAD_P2_PU_EN_4_Pos)

#define AON_REG_PAD_REG8X_AON_PAD_P2_PD_4_Pos                                                                            3U
#define AON_REG_PAD_REG8X_AON_PAD_P2_PD_4_Msk                                                                            (0x1UL << AON_REG_PAD_REG8X_AON_PAD_P2_PD_4_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_PUPDC_4_Pos                                                                             4U
#define AON_REG_PAD_REG8X_PAD_P2_PUPDC_4_Msk                                                                             (0x1UL << AON_REG_PAD_REG8X_PAD_P2_PUPDC_4_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_WKEN_4_Pos                                                                              5U
#define AON_REG_PAD_REG8X_PAD_P2_WKEN_4_Msk                                                                              (0x1UL << AON_REG_PAD_REG8X_PAD_P2_WKEN_4_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_WKPOL_4_Pos                                                                             6U
#define AON_REG_PAD_REG8X_PAD_P2_WKPOL_4_Msk                                                                             (0x1UL << AON_REG_PAD_REG8X_PAD_P2_WKPOL_4_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_SHDN_4_Pos                                                                              7U
#define AON_REG_PAD_REG8X_PAD_P2_SHDN_4_Msk                                                                              (0x1UL << AON_REG_PAD_REG8X_PAD_P2_SHDN_4_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_DEB_4_Pos                                                                               8U
#define AON_REG_PAD_REG8X_PAD_P2_DEB_4_Msk                                                                               (0x1UL << AON_REG_PAD_REG8X_PAD_P2_DEB_4_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_RAP_WKEN_4_Pos                                                                          9U
#define AON_REG_PAD_REG8X_PAD_P2_RAP_WKEN_4_Msk                                                                          (0x1UL << AON_REG_PAD_REG8X_PAD_P2_RAP_WKEN_4_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_PPU_WKEN_4_Pos                                                                          10U
#define AON_REG_PAD_REG8X_PAD_P2_PPU_WKEN_4_Msk                                                                          (0x1UL << AON_REG_PAD_REG8X_PAD_P2_PPU_WKEN_4_Pos)

#define AON_REG_PAD_REG8X_RESERVED_3_Pos                                                                                 11U
#define AON_REG_PAD_REG8X_RESERVED_3_Msk                                                                                 (0x1UL << AON_REG_PAD_REG8X_RESERVED_3_Pos)

#define AON_REG_PAD_REG8X_DUMMY_PAD4_Pos                                                                                 12U
#define AON_REG_PAD_REG8X_DUMMY_PAD4_Msk                                                                                 (0x1UL << AON_REG_PAD_REG8X_DUMMY_PAD4_Pos)

