rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG8X_RESERVED_2_Pos                                                                                 13U
#define AON_REG_PAD_REG8X_RESERVED_2_Msk                                                                                 (0x1UL << AON_REG_PAD_REG8X_RESERVED_2_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_AON_MUX_4_Pos                                                                           14U
#define AON_REG_PAD_REG8X_PAD_P2_AON_MUX_4_Msk                                                                           (0x3UL << AON_REG_PAD_REG8X_PAD_P2_AON_MUX_4_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_O_5_Pos                                                                                 16U
#define AON_REG_PAD_REG8X_PAD_P2_O_5_Msk                                                                                 (0x1UL << AON_REG_PAD_REG8X_PAD_P2_O_5_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_E_5_Pos                                                                                 17U
#define AON_REG_PAD_REG8X_PAD_P2_E_5_Msk                                                                                 (0x1UL << AON_REG_PAD_REG8X_PAD_P2_E_5_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_PU_EN_5_Pos                                                                             18U
#define AON_REG_PAD_REG8X_PAD_P2_PU_EN_5_Msk                                                                             (0x1UL << AON_REG_PAD_REG8X_PAD_P2_PU_EN_5_Pos)

#define AON_REG_PAD_REG8X_AON_PAD_P2_PD_5_Pos                                                                            19U
#define AON_REG_PAD_REG8X_AON_PAD_P2_PD_5_Msk                                                                            (0x1UL << AON_REG_PAD_REG8X_AON_PAD_P2_PD_5_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_PUPDC_5_Pos                                                                             20U
#define AON_REG_PAD_REG8X_PAD_P2_PUPDC_5_Msk                                                                             (0x1UL << AON_REG_PAD_REG8X_PAD_P2_PUPDC_5_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_WKEN_5_Pos                                                                              21U
#define AON_REG_PAD_REG8X_PAD_P2_WKEN_5_Msk                                                                              (0x1UL << AON_REG_PAD_REG8X_PAD_P2_WKEN_5_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_WKPOL_5_Pos                                                                             22U
#define AON_REG_PAD_REG8X_PAD_P2_WKPOL_5_Msk                                                                             (0x1UL << AON_REG_PAD_REG8X_PAD_P2_WKPOL_5_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_SHDN_5_Pos                                                                              23U
#define AON_REG_PAD_REG8X_PAD_P2_SHDN_5_Msk                                                                              (0x1UL << AON_REG_PAD_REG8X_PAD_P2_SHDN_5_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_DEB_5_Pos                                                                               24U
#define AON_REG_PAD_REG8X_PAD_P2_DEB_5_Msk                                                                               (0x1UL << AON_REG_PAD_REG8X_PAD_P2_DEB_5_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_RAP_WKEN_5_Pos                                                                          25U
#define AON_REG_PAD_REG8X_PAD_P2_RAP_WKEN_5_Msk                                                                          (0x1UL << AON_REG_PAD_REG8X_PAD_P2_RAP_WKEN_5_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_PPU_WKEN_5_Pos                                                                          26U
#define AON_REG_PAD_REG8X_PAD_P2_PPU_WKEN_5_Msk                                                                          (0x1UL << AON_REG_PAD_REG8X_PAD_P2_PPU_WKEN_5_Pos)

#define AON_REG_PAD_REG8X_RESERVED_1_Pos                                                                                 27U
#define AON_REG_PAD_REG8X_RESERVED_1_Msk                                                                                 (0x1UL << AON_REG_PAD_REG8X_RESERVED_1_Pos)

#define AON_REG_PAD_REG8X_DUMMY_PAD5_Pos                                                                                 28U
#define AON_REG_PAD_REG8X_DUMMY_PAD5_Msk                                                                                 (0x1UL << AON_REG_PAD_REG8X_DUMMY_PAD5_Pos)

#define AON_REG_PAD_REG8X_RESERVED_Pos                                                                                   29U
#define AON_REG_PAD_REG8X_RESERVED_Msk                                                                                   (0x1UL << AON_REG_PAD_REG8X_RESERVED_Pos)

#define AON_REG_PAD_REG8X_PAD_P2_AON_MUX_5_Pos                                                                           30U
#define AON_REG_PAD_REG8X_PAD_P2_AON_MUX_5_Msk                                                                           (0x3UL << AON_REG_PAD_REG8X_PAD_P2_AON_MUX_5_Pos)

/* 0x144    0x4000_0144
    0       R/W     PAD_P2_O_6                                                  1'b0
    1       R/W     PAD_P2_E_6                                                  1'b0
    2       R/W     PAD_P2_PU_EN_6                                              1'b1
    3       R/W     AON_PAD_P2_PD_6                                             1'b1
    4       R/W     PAD_P2_PUPDC_6                                              1'b0
    5       R/W     PAD_P2_WKEN_6                                               1'b0
    6       R/W     PAD_P2_WKPOL_6                                              1'b0
    7       R/W     PAD_P2_SHDN_6                                               1'b1
    8       R/W     PAD_P2_DEB_6                                                1'b0
    9       R/W     PAD_P2_RAP_WKEN_6                                           1'b0
    10      R/W     PAD_P2_PPU_WKEN_6                                           1'b0
    11      R/W     RESERVED_3                                                  1'b0
    12      R/W     DUMMY_PAD6                                                  1'b0
    13      R       RESERVED_2                                                  1'b0
    15:14   R/W     PAD_P2_AON_MUX_6                                            2'b00
    16      R/W     PAD_P2_O_7                                                  1'b0
    17      R/W     PAD_P2_E_7                                                  1'b0
    18      R/W     PAD_P2_PU_EN_7                                              1'b1
    19      R/W     AON_PAD_P2_PD_7                                             1'b1
    20      R/W     PAD_P2_PUPDC_7                                              1'b0
    21      R/W     PAD_P2_WKEN_7                                               1'b0
    22      R/W     PAD_P2_WKPOL_7                                              1'b0
    23      R/W     PAD_P2_SHDN_7                                               1'b1
    24      R/W     PAD_P2_DEB_7                                                1'b0
    25      R/W     PAD_P2_RAP_WKEN_7                                           1'b0
    26      R/W     PAD_P2_PPU_WKEN_7                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    28      R/W     DUMMY_PAD7                                                  1'b0
    29      R       RESERVED                                                    1'b0
    31:30   R/W     PAD_P2_AON_MUX_7                                            2'b00
 */
typedef union _AON_REG_PAD_REG9X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P2_O_6: 1;
        uint32_t PAD_P2_E_6: 1;
        uint32_t PAD_P2_PU_EN_6: 1;
        uint32_t AON_PAD_P2_PD_6: 1;
        uint32_t PAD_P2_PUPDC_6: 1;
        uint32_t PAD_P2_WKEN_6: 1;
        uint32_t PAD_P2_WKPOL_6: 1;
        uint32_t PAD_P2_SHDN_6: 1;
        uint32_t PAD_P2_DEB_6: 1;
        uint32_t PAD_P2_RAP_WKEN_6: 1;
        uint32_t PAD_P2_PPU_WKEN_6: 1;
        uint32_t RESERVED_3: 1;
        uint32_t DUMMY_PAD6: 1;
        uint32_t RESERVED_2: 1;
        uint32_t PAD_P2_AON_MUX_6: 2;
        uint32_t PAD_P2_O_7: 1;
        uint32_t PAD_P2_E_7: 1;
        uint32_t PAD_P2_PU_EN_7: 1;
        uint32_t AON_PAD_P2_PD_7: 1;
        uint32_t PAD_P2_PUPDC_7: 1;
        uint32_t PAD_P2_WKEN_7: 1;
        uint32_t PAD_P2_WKPOL_7: 1;
        uint32_t PAD_P2_SHDN_7: 1;
        uint32_t PAD_P2_DEB_7: 1;
        uint32_t PAD_P2_RAP_WKEN_7: 1;
        uint32_t PAD_P2_PPU_WKEN_7: 1;
        uint32_t RESERVED_1: 1;
        uint32_t DUMMY_PAD7: 1;
        uint32_t RESERVED: 1;
        uint32_t PAD_P2_AON_MUX_7: 2;
    };
} AON_REG_PAD_REG9X_TYPE;

