rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG9X_PAD_P2_WKPOL_7_Pos                                                                             22U
#define AON_REG_PAD_REG9X_PAD_P2_WKPOL_7_Msk                                                                             (0x1UL << AON_REG_PAD_REG9X_PAD_P2_WKPOL_7_Pos)

#define AON_REG_PAD_REG9X_PAD_P2_SHDN_7_Pos                                                                              23U
#define AON_REG_PAD_REG9X_PAD_P2_SHDN_7_Msk                                                                              (0x1UL << AON_REG_PAD_REG9X_PAD_P2_SHDN_7_Pos)

#define AON_REG_PAD_REG9X_PAD_P2_DEB_7_Pos                                                                               24U
#define AON_REG_PAD_REG9X_PAD_P2_DEB_7_Msk                                                                               (0x1UL << AON_REG_PAD_REG9X_PAD_P2_DEB_7_Pos)

#define AON_REG_PAD_REG9X_PAD_P2_RAP_WKEN_7_Pos                                                                          25U
#define AON_REG_PAD_REG9X_PAD_P2_RAP_WKEN_7_Msk                                                                          (0x1UL << AON_REG_PAD_REG9X_PAD_P2_RAP_WKEN_7_Pos)

#define AON_REG_PAD_REG9X_PAD_P2_PPU_WKEN_7_Pos                                                                          26U
#define AON_REG_PAD_REG9X_PAD_P2_PPU_WKEN_7_Msk                                                                          (0x1UL << AON_REG_PAD_REG9X_PAD_P2_PPU_WKEN_7_Pos)

#define AON_REG_PAD_REG9X_RESERVED_1_Pos                                                                                 27U
#define AON_REG_PAD_REG9X_RESERVED_1_Msk                                                                                 (0x1UL << AON_REG_PAD_REG9X_RESERVED_1_Pos)

#define AON_REG_PAD_REG9X_DUMMY_PAD7_Pos                                                                                 28U
#define AON_REG_PAD_REG9X_DUMMY_PAD7_Msk                                                                                 (0x1UL << AON_REG_PAD_REG9X_DUMMY_PAD7_Pos)

#define AON_REG_PAD_REG9X_RESERVED_Pos                                                                                   29U
#define AON_REG_PAD_REG9X_RESERVED_Msk                                                                                   (0x1UL << AON_REG_PAD_REG9X_RESERVED_Pos)

#define AON_REG_PAD_REG9X_PAD_P2_AON_MUX_7_Pos                                                                           30U
#define AON_REG_PAD_REG9X_PAD_P2_AON_MUX_7_Msk                                                                           (0x3UL << AON_REG_PAD_REG9X_PAD_P2_AON_MUX_7_Pos)

/* 0x148    0x4000_0148
    0       R/W     PAD_P3_O_0                                                  1'b0
    1       R/W     PAD_P3_E_0                                                  1'b0
    2       R/W     PAD_P3_PU_EN_0                                              1'b1
    3       R/W     AON_PAD_P3_PD_0                                             1'b0
    4       R/W     PAD_P3_PUPDC_0                                              1'b0
    5       R/W     PAD_P3_WKEN_0                                               1'b0
    6       R/W     PAD_P3_WKPOL_0                                              1'b0
    7       R/W     PAD_P3_SHDN_0                                               1'b1
    8       R/W     PAD_P3_DEB_0                                                1'b0
    9       R/W     PAD_P3_RAP_WKEN_0                                           1'b0
    10      R/W     PAD_P3_PPU_WKEN_0                                           1'b0
    11      R/W     RESERVED_3                                                  1'b0
    13:12   R       RESERVED_2                                                  2'b00
    15:14   R/W     PAD_P3_AON_MUX_0                                            2'b00
    16      R/W     PAD_P3_O_1                                                  1'b0
    17      R/W     PAD_P3_E_1                                                  1'b0
    18      R/W     PAD_P3_PU_EN_1                                              1'b1
    19      R/W     AON_PAD_P3_PD_1                                             1'b0
    20      R/W     PAD_P3_PUPDC_1                                              1'b0
    21      R/W     PAD_P3_WKEN_1                                               1'b0
    22      R/W     PAD_P3_WKPOL_1                                              1'b0
    23      R/W     PAD_P3_SHDN_1                                               1'b1
    24      R/W     PAD_P3_DEB_1                                                1'b0
    25      R/W     PAD_P3_RAP_WKEN_1                                           1'b0
    26      R/W     PAD_P3_PPU_WKEN_1                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    29:28   R       RESERVED                                                    2'b00
    31:30   R/W     PAD_P3_AON_MUX_1                                            2'b00
 */
typedef union _AON_REG_PAD_REG10X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P3_O_0: 1;
        uint32_t PAD_P3_E_0: 1;
        uint32_t PAD_P3_PU_EN_0: 1;
        uint32_t AON_PAD_P3_PD_0: 1;
        uint32_t PAD_P3_PUPDC_0: 1;
        uint32_t PAD_P3_WKEN_0: 1;
        uint32_t PAD_P3_WKPOL_0: 1;
        uint32_t PAD_P3_SHDN_0: 1;
        uint32_t PAD_P3_DEB_0: 1;
        uint32_t PAD_P3_RAP_WKEN_0: 1;
        uint32_t PAD_P3_PPU_WKEN_0: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t PAD_P3_AON_MUX_0: 2;
        uint32_t PAD_P3_O_1: 1;
        uint32_t PAD_P3_E_1: 1;
        uint32_t PAD_P3_PU_EN_1: 1;
        uint32_t AON_PAD_P3_PD_1: 1;
        uint32_t PAD_P3_PUPDC_1: 1;
        uint32_t PAD_P3_WKEN_1: 1;
        uint32_t PAD_P3_WKPOL_1: 1;
        uint32_t PAD_P3_SHDN_1: 1;
        uint32_t PAD_P3_DEB_1: 1;
        uint32_t PAD_P3_RAP_WKEN_1: 1;
        uint32_t PAD_P3_PPU_WKEN_1: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t PAD_P3_AON_MUX_1: 2;
    };
} AON_REG_PAD_REG10X_TYPE;

/*0x4000_0148 AON_REG_PAD_REG10X*/
#define AON_REG_PAD_REG10X_PAD_P3_O_0_Pos                                                                                0U
#define AON_REG_PAD_REG10X_PAD_P3_O_0_Msk                                                                                (0x1UL << AON_REG_PAD_REG10X_PAD_P3_O_0_Pos)

