rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG11X_PAD_P3_PPU_WKEN_2_Pos                                                                         10U
#define AON_REG_PAD_REG11X_PAD_P3_PPU_WKEN_2_Msk                                                                         (0x1UL << AON_REG_PAD_REG11X_PAD_P3_PPU_WKEN_2_Pos)

#define AON_REG_PAD_REG11X_RESERVED_3_Pos                                                                                11U
#define AON_REG_PAD_REG11X_RESERVED_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG11X_RESERVED_3_Pos)

#define AON_REG_PAD_REG11X_RESERVED_2_Pos                                                                                12U
#define AON_REG_PAD_REG11X_RESERVED_2_Msk                                                                                (0x3UL << AON_REG_PAD_REG11X_RESERVED_2_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_AON_MUX_2_Pos                                                                          14U
#define AON_REG_PAD_REG11X_PAD_P3_AON_MUX_2_Msk                                                                          (0x3UL << AON_REG_PAD_REG11X_PAD_P3_AON_MUX_2_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_O_3_Pos                                                                                16U
#define AON_REG_PAD_REG11X_PAD_P3_O_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG11X_PAD_P3_O_3_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_E_3_Pos                                                                                17U
#define AON_REG_PAD_REG11X_PAD_P3_E_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG11X_PAD_P3_E_3_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_PU_EN_3_Pos                                                                            18U
#define AON_REG_PAD_REG11X_PAD_P3_PU_EN_3_Msk                                                                            (0x1UL << AON_REG_PAD_REG11X_PAD_P3_PU_EN_3_Pos)

#define AON_REG_PAD_REG11X_AON_PAD_P3_PD_3_Pos                                                                           19U
#define AON_REG_PAD_REG11X_AON_PAD_P3_PD_3_Msk                                                                           (0x1UL << AON_REG_PAD_REG11X_AON_PAD_P3_PD_3_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_PUPDC_3_Pos                                                                            20U
#define AON_REG_PAD_REG11X_PAD_P3_PUPDC_3_Msk                                                                            (0x1UL << AON_REG_PAD_REG11X_PAD_P3_PUPDC_3_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_WKEN_3_Pos                                                                             21U
#define AON_REG_PAD_REG11X_PAD_P3_WKEN_3_Msk                                                                             (0x1UL << AON_REG_PAD_REG11X_PAD_P3_WKEN_3_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_WKPOL_3_Pos                                                                            22U
#define AON_REG_PAD_REG11X_PAD_P3_WKPOL_3_Msk                                                                            (0x1UL << AON_REG_PAD_REG11X_PAD_P3_WKPOL_3_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_SHDN_3_Pos                                                                             23U
#define AON_REG_PAD_REG11X_PAD_P3_SHDN_3_Msk                                                                             (0x1UL << AON_REG_PAD_REG11X_PAD_P3_SHDN_3_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_DEB_3_Pos                                                                              24U
#define AON_REG_PAD_REG11X_PAD_P3_DEB_3_Msk                                                                              (0x1UL << AON_REG_PAD_REG11X_PAD_P3_DEB_3_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_RAP_WKEN_3_Pos                                                                         25U
#define AON_REG_PAD_REG11X_PAD_P3_RAP_WKEN_3_Msk                                                                         (0x1UL << AON_REG_PAD_REG11X_PAD_P3_RAP_WKEN_3_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_PPU_WKEN_3_Pos                                                                         26U
#define AON_REG_PAD_REG11X_PAD_P3_PPU_WKEN_3_Msk                                                                         (0x1UL << AON_REG_PAD_REG11X_PAD_P3_PPU_WKEN_3_Pos)

#define AON_REG_PAD_REG11X_RESERVED_1_Pos                                                                                27U
#define AON_REG_PAD_REG11X_RESERVED_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG11X_RESERVED_1_Pos)

#define AON_REG_PAD_REG11X_RESERVED_Pos                                                                                  28U
#define AON_REG_PAD_REG11X_RESERVED_Msk                                                                                  (0x3UL << AON_REG_PAD_REG11X_RESERVED_Pos)

#define AON_REG_PAD_REG11X_PAD_P3_AON_MUX_3_Pos                                                                          30U
#define AON_REG_PAD_REG11X_PAD_P3_AON_MUX_3_Msk                                                                          (0x3UL << AON_REG_PAD_REG11X_PAD_P3_AON_MUX_3_Pos)

/* 0x150    0x4000_0150
    0       R/W     PAD_P3_O_4                                                  1'b0
    1       R/W     PAD_P3_E_4                                                  1'b0
    2       R/W     PAD_P3_PU_EN_4                                              1'b1
    3       R/W     AON_PAD_P3_PD_4                                             1'b1
    4       R/W     PAD_P3_PUPDC_4                                              1'b0
    5       R/W     PAD_P3_WKEN_4                                               1'b0
    6       R/W     PAD_P3_WKPOL_4                                              1'b0
    7       R/W     PAD_P3_SHDN_4                                               1'b1
    8       R/W     PAD_P3_DEB_4                                                1'b0
    9       R/W     PAD_P3_RAP_WKEN_4                                           1'b0
    10      R/W     PAD_P3_PPU_WKEN_4                                           1'b0
    11      R/W     RESERVED_3                                                  1'b0
    13:12   R       RESERVED_2                                                  2'b00
    15:14   R/W     PAD_P3_AON_MUX_4                                            2'b00
    16      R/W     PAD_P3_O_5                                                  1'b0
    17      R/W     PAD_P3_E_5                                                  1'b0
    18      R/W     PAD_P3_PU_EN_5                                              1'b1
    19      R/W     AON_PAD_P3_PD_5                                             1'b1
    20      R/W     PAD_P3_PUPDC_5                                              1'b0
    21      R/W     PAD_P3_WKEN_5                                               1'b0
    22      R/W     PAD_P3_WKPOL_5                                              1'b0
    23      R/W     PAD_P3_SHDN_5                                               1'b1
    24      R/W     PAD_P3_DEB_5                                                1'b0
    25      R/W     PAD_P3_RAP_WKEN_5                                           1'b0
    26      R/W     PAD_P3_PPU_WKEN_5                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    29:28   R       RESERVED                                                    2'b00
    31:30   R/W     PAD_P3_AON_MUX_5                                            2'b00
 */
typedef union _AON_REG_PAD_REG12X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P3_O_4: 1;
        uint32_t PAD_P3_E_4: 1;
        uint32_t PAD_P3_PU_EN_4: 1;
        uint32_t AON_PAD_P3_PD_4: 1;
        uint32_t PAD_P3_PUPDC_4: 1;
        uint32_t PAD_P3_WKEN_4: 1;
        uint32_t PAD_P3_WKPOL_4: 1;
        uint32_t PAD_P3_SHDN_4: 1;
        uint32_t PAD_P3_DEB_4: 1;
        uint32_t PAD_P3_RAP_WKEN_4: 1;
        uint32_t PAD_P3_PPU_WKEN_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t PAD_P3_AON_MUX_4: 2;
        uint32_t PAD_P3_O_5: 1;
        uint32_t PAD_P3_E_5: 1;
        uint32_t PAD_P3_PU_EN_5: 1;
        uint32_t AON_PAD_P3_PD_5: 1;
        uint32_t PAD_P3_PUPDC_5: 1;
        uint32_t PAD_P3_WKEN_5: 1;
        uint32_t PAD_P3_WKPOL_5: 1;
        uint32_t PAD_P3_SHDN_5: 1;
        uint32_t PAD_P3_DEB_5: 1;
        uint32_t PAD_P3_RAP_WKEN_5: 1;
        uint32_t PAD_P3_PPU_WKEN_5: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t PAD_P3_AON_MUX_5: 2;
    };
} AON_REG_PAD_REG12X_TYPE;

/*0x4000_0150 AON_REG_PAD_REG12X*/
#define AON_REG_PAD_REG12X_PAD_P3_O_4_Pos                                                                                0U
#define AON_REG_PAD_REG12X_PAD_P3_O_4_Msk                                                                                (0x1UL << AON_REG_PAD_REG12X_PAD_P3_O_4_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_E_4_Pos                                                                                1U
#define AON_REG_PAD_REG12X_PAD_P3_E_4_Msk                                                                                (0x1UL << AON_REG_PAD_REG12X_PAD_P3_E_4_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_PU_EN_4_Pos                                                                            2U
#define AON_REG_PAD_REG12X_PAD_P3_PU_EN_4_Msk                                                                            (0x1UL << AON_REG_PAD_REG12X_PAD_P3_PU_EN_4_Pos)

#define AON_REG_PAD_REG12X_AON_PAD_P3_PD_4_Pos                                                                           3U
#define AON_REG_PAD_REG12X_AON_PAD_P3_PD_4_Msk                                                                           (0x1UL << AON_REG_PAD_REG12X_AON_PAD_P3_PD_4_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_PUPDC_4_Pos                                                                            4U
#define AON_REG_PAD_REG12X_PAD_P3_PUPDC_4_Msk                                                                            (0x1UL << AON_REG_PAD_REG12X_PAD_P3_PUPDC_4_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_WKEN_4_Pos                                                                             5U
#define AON_REG_PAD_REG12X_PAD_P3_WKEN_4_Msk                                                                             (0x1UL << AON_REG_PAD_REG12X_PAD_P3_WKEN_4_Pos)

