rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG12X_PAD_P3_WKPOL_4_Pos                                                                            6U
#define AON_REG_PAD_REG12X_PAD_P3_WKPOL_4_Msk                                                                            (0x1UL << AON_REG_PAD_REG12X_PAD_P3_WKPOL_4_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_SHDN_4_Pos                                                                             7U
#define AON_REG_PAD_REG12X_PAD_P3_SHDN_4_Msk                                                                             (0x1UL << AON_REG_PAD_REG12X_PAD_P3_SHDN_4_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_DEB_4_Pos                                                                              8U
#define AON_REG_PAD_REG12X_PAD_P3_DEB_4_Msk                                                                              (0x1UL << AON_REG_PAD_REG12X_PAD_P3_DEB_4_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_RAP_WKEN_4_Pos                                                                         9U
#define AON_REG_PAD_REG12X_PAD_P3_RAP_WKEN_4_Msk                                                                         (0x1UL << AON_REG_PAD_REG12X_PAD_P3_RAP_WKEN_4_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_PPU_WKEN_4_Pos                                                                         10U
#define AON_REG_PAD_REG12X_PAD_P3_PPU_WKEN_4_Msk                                                                         (0x1UL << AON_REG_PAD_REG12X_PAD_P3_PPU_WKEN_4_Pos)

#define AON_REG_PAD_REG12X_RESERVED_3_Pos                                                                                11U
#define AON_REG_PAD_REG12X_RESERVED_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG12X_RESERVED_3_Pos)

#define AON_REG_PAD_REG12X_RESERVED_2_Pos                                                                                12U
#define AON_REG_PAD_REG12X_RESERVED_2_Msk                                                                                (0x3UL << AON_REG_PAD_REG12X_RESERVED_2_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_AON_MUX_4_Pos                                                                          14U
#define AON_REG_PAD_REG12X_PAD_P3_AON_MUX_4_Msk                                                                          (0x3UL << AON_REG_PAD_REG12X_PAD_P3_AON_MUX_4_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_O_5_Pos                                                                                16U
#define AON_REG_PAD_REG12X_PAD_P3_O_5_Msk                                                                                (0x1UL << AON_REG_PAD_REG12X_PAD_P3_O_5_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_E_5_Pos                                                                                17U
#define AON_REG_PAD_REG12X_PAD_P3_E_5_Msk                                                                                (0x1UL << AON_REG_PAD_REG12X_PAD_P3_E_5_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_PU_EN_5_Pos                                                                            18U
#define AON_REG_PAD_REG12X_PAD_P3_PU_EN_5_Msk                                                                            (0x1UL << AON_REG_PAD_REG12X_PAD_P3_PU_EN_5_Pos)

#define AON_REG_PAD_REG12X_AON_PAD_P3_PD_5_Pos                                                                           19U
#define AON_REG_PAD_REG12X_AON_PAD_P3_PD_5_Msk                                                                           (0x1UL << AON_REG_PAD_REG12X_AON_PAD_P3_PD_5_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_PUPDC_5_Pos                                                                            20U
#define AON_REG_PAD_REG12X_PAD_P3_PUPDC_5_Msk                                                                            (0x1UL << AON_REG_PAD_REG12X_PAD_P3_PUPDC_5_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_WKEN_5_Pos                                                                             21U
#define AON_REG_PAD_REG12X_PAD_P3_WKEN_5_Msk                                                                             (0x1UL << AON_REG_PAD_REG12X_PAD_P3_WKEN_5_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_WKPOL_5_Pos                                                                            22U
#define AON_REG_PAD_REG12X_PAD_P3_WKPOL_5_Msk                                                                            (0x1UL << AON_REG_PAD_REG12X_PAD_P3_WKPOL_5_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_SHDN_5_Pos                                                                             23U
#define AON_REG_PAD_REG12X_PAD_P3_SHDN_5_Msk                                                                             (0x1UL << AON_REG_PAD_REG12X_PAD_P3_SHDN_5_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_DEB_5_Pos                                                                              24U
#define AON_REG_PAD_REG12X_PAD_P3_DEB_5_Msk                                                                              (0x1UL << AON_REG_PAD_REG12X_PAD_P3_DEB_5_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_RAP_WKEN_5_Pos                                                                         25U
#define AON_REG_PAD_REG12X_PAD_P3_RAP_WKEN_5_Msk                                                                         (0x1UL << AON_REG_PAD_REG12X_PAD_P3_RAP_WKEN_5_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_PPU_WKEN_5_Pos                                                                         26U
#define AON_REG_PAD_REG12X_PAD_P3_PPU_WKEN_5_Msk                                                                         (0x1UL << AON_REG_PAD_REG12X_PAD_P3_PPU_WKEN_5_Pos)

#define AON_REG_PAD_REG12X_RESERVED_1_Pos                                                                                27U
#define AON_REG_PAD_REG12X_RESERVED_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG12X_RESERVED_1_Pos)

#define AON_REG_PAD_REG12X_RESERVED_Pos                                                                                  28U
#define AON_REG_PAD_REG12X_RESERVED_Msk                                                                                  (0x3UL << AON_REG_PAD_REG12X_RESERVED_Pos)

#define AON_REG_PAD_REG12X_PAD_P3_AON_MUX_5_Pos                                                                          30U
#define AON_REG_PAD_REG12X_PAD_P3_AON_MUX_5_Msk                                                                          (0x3UL << AON_REG_PAD_REG12X_PAD_P3_AON_MUX_5_Pos)

