rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x154    0x4000_0154
    0       R/W     PAD_P3_O_6                                                  1'b0
    1       R/W     PAD_P3_E_6                                                  1'b0
    2       R/W     PAD_P3_PU_EN_6                                              1'b1
    3       R/W     AON_PAD_P3_PD_6                                             1'b1
    4       R/W     PAD_P3_PUPDC_6                                              1'b0
    5       R/W     PAD_P3_WKEN_6                                               1'b0
    6       R/W     PAD_P3_WKPOL_6                                              1'b0
    7       R/W     PAD_P3_SHDN_6                                               1'b1
    8       R/W     PAD_P3_DEB_6                                                1'b0
    9       R/W     PAD_P3_RAP_WKEN_6                                           1'b0
    10      R/W     PAD_P3_PPU_WKEN_6                                           1'b0
    11      R/W     RESERVED_2                                                  1'b0
    13:12   R       RESERVED_1                                                  2'b00
    15:14   R/W     PAD_P3_AON_MUX_6                                            2'b00
    31:16   R       RESERVED                                                    16'h0
 */
typedef union _AON_REG_PAD_REG13X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P3_O_6: 1;
        uint32_t PAD_P3_E_6: 1;
        uint32_t PAD_P3_PU_EN_6: 1;
        uint32_t AON_PAD_P3_PD_6: 1;
        uint32_t PAD_P3_PUPDC_6: 1;
        uint32_t PAD_P3_WKEN_6: 1;
        uint32_t PAD_P3_WKPOL_6: 1;
        uint32_t PAD_P3_SHDN_6: 1;
        uint32_t PAD_P3_DEB_6: 1;
        uint32_t PAD_P3_RAP_WKEN_6: 1;
        uint32_t PAD_P3_PPU_WKEN_6: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 2;
        uint32_t PAD_P3_AON_MUX_6: 2;
        uint32_t RESERVED: 16;
    };
} AON_REG_PAD_REG13X_TYPE;

/*0x4000_0154 AON_REG_PAD_REG13X*/
#define AON_REG_PAD_REG13X_PAD_P3_O_6_Pos                                                                                0U
#define AON_REG_PAD_REG13X_PAD_P3_O_6_Msk                                                                                (0x1UL << AON_REG_PAD_REG13X_PAD_P3_O_6_Pos)

#define AON_REG_PAD_REG13X_PAD_P3_E_6_Pos                                                                                1U
#define AON_REG_PAD_REG13X_PAD_P3_E_6_Msk                                                                                (0x1UL << AON_REG_PAD_REG13X_PAD_P3_E_6_Pos)

#define AON_REG_PAD_REG13X_PAD_P3_PU_EN_6_Pos                                                                            2U
#define AON_REG_PAD_REG13X_PAD_P3_PU_EN_6_Msk                                                                            (0x1UL << AON_REG_PAD_REG13X_PAD_P3_PU_EN_6_Pos)

#define AON_REG_PAD_REG13X_AON_PAD_P3_PD_6_Pos                                                                           3U
#define AON_REG_PAD_REG13X_AON_PAD_P3_PD_6_Msk                                                                           (0x1UL << AON_REG_PAD_REG13X_AON_PAD_P3_PD_6_Pos)

#define AON_REG_PAD_REG13X_PAD_P3_PUPDC_6_Pos                                                                            4U
#define AON_REG_PAD_REG13X_PAD_P3_PUPDC_6_Msk                                                                            (0x1UL << AON_REG_PAD_REG13X_PAD_P3_PUPDC_6_Pos)

#define AON_REG_PAD_REG13X_PAD_P3_WKEN_6_Pos                                                                             5U
#define AON_REG_PAD_REG13X_PAD_P3_WKEN_6_Msk                                                                             (0x1UL << AON_REG_PAD_REG13X_PAD_P3_WKEN_6_Pos)

#define AON_REG_PAD_REG13X_PAD_P3_WKPOL_6_Pos                                                                            6U
#define AON_REG_PAD_REG13X_PAD_P3_WKPOL_6_Msk                                                                            (0x1UL << AON_REG_PAD_REG13X_PAD_P3_WKPOL_6_Pos)

#define AON_REG_PAD_REG13X_PAD_P3_SHDN_6_Pos                                                                             7U
#define AON_REG_PAD_REG13X_PAD_P3_SHDN_6_Msk                                                                             (0x1UL << AON_REG_PAD_REG13X_PAD_P3_SHDN_6_Pos)

#define AON_REG_PAD_REG13X_PAD_P3_DEB_6_Pos                                                                              8U
#define AON_REG_PAD_REG13X_PAD_P3_DEB_6_Msk                                                                              (0x1UL << AON_REG_PAD_REG13X_PAD_P3_DEB_6_Pos)

#define AON_REG_PAD_REG13X_PAD_P3_RAP_WKEN_6_Pos                                                                         9U
#define AON_REG_PAD_REG13X_PAD_P3_RAP_WKEN_6_Msk                                                                         (0x1UL << AON_REG_PAD_REG13X_PAD_P3_RAP_WKEN_6_Pos)

#define AON_REG_PAD_REG13X_PAD_P3_PPU_WKEN_6_Pos                                                                         10U
#define AON_REG_PAD_REG13X_PAD_P3_PPU_WKEN_6_Msk                                                                         (0x1UL << AON_REG_PAD_REG13X_PAD_P3_PPU_WKEN_6_Pos)

#define AON_REG_PAD_REG13X_RESERVED_2_Pos                                                                                11U
#define AON_REG_PAD_REG13X_RESERVED_2_Msk                                                                                (0x1UL << AON_REG_PAD_REG13X_RESERVED_2_Pos)

#define AON_REG_PAD_REG13X_RESERVED_1_Pos                                                                                12U
#define AON_REG_PAD_REG13X_RESERVED_1_Msk                                                                                (0x3UL << AON_REG_PAD_REG13X_RESERVED_1_Pos)

#define AON_REG_PAD_REG13X_PAD_P3_AON_MUX_6_Pos                                                                          14U
#define AON_REG_PAD_REG13X_PAD_P3_AON_MUX_6_Msk                                                                          (0x3UL << AON_REG_PAD_REG13X_PAD_P3_AON_MUX_6_Pos)

