rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG13X_RESERVED_Pos                                                                                  16U
#define AON_REG_PAD_REG13X_RESERVED_Msk                                                                                  (0xFFFFUL << AON_REG_PAD_REG13X_RESERVED_Pos)

/* 0x158    0x4000_0158
    0       R/W     PAD_P4_O_0                                                  1'b0
    1       R/W     PAD_P4_E_0                                                  1'b0
    2       R/W     PAD_P4_PU_EN_0                                              1'b1
    3       R/W     AON_PAD_P4_PD_0                                             1'b1
    4       R/W     PAD_P4_PUPDC_0                                              1'b0
    5       R/W     PAD_P4_WKEN_0                                               1'b0
    6       R/W     PAD_P4_WKPOL_0                                              1'b0
    7       R/W     PAD_P4_SHDN_0                                               1'b1
    8       R/W     PAD_P4_DEB_0                                                1'b0
    9       R/W     PAD_P4_RAP_WKEN_0                                           1'b0
    10      R/W     PAD_P4_PPU_WKEN_0                                           1'b0
    11      R/W     RESERVED_3                                                  1'b0
    13:12   R       RESERVED_2                                                  2'b00
    15:14   R/W     PAD_P4_AON_MUX_0                                            2'b00
    16      R/W     PAD_P4_O_1                                                  1'b0
    17      R/W     PAD_P4_E_1                                                  1'b0
    18      R/W     PAD_P4_PU_EN_1                                              1'b1
    19      R/W     AON_PAD_P4_PD_1                                             1'b1
    20      R/W     PAD_P4_PUPDC_1                                              1'b0
    21      R/W     PAD_P4_WKEN_1                                               1'b0
    22      R/W     PAD_P4_WKPOL_1                                              1'b0
    23      R/W     PAD_P4_SHDN_1                                               1'b1
    24      R/W     PAD_P4_DEB_1                                                1'b0
    25      R/W     PAD_P4_RAP_WKEN_1                                           1'b0
    26      R/W     PAD_P4_PPU_WKEN_1                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    29:28   R       RESERVED                                                    2'b00
    31:30   R/W     PAD_P4_AON_MUX_1                                            2'b00
 */
typedef union _AON_REG_PAD_REG14X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P4_O_0: 1;
        uint32_t PAD_P4_E_0: 1;
        uint32_t PAD_P4_PU_EN_0: 1;
        uint32_t AON_PAD_P4_PD_0: 1;
        uint32_t PAD_P4_PUPDC_0: 1;
        uint32_t PAD_P4_WKEN_0: 1;
        uint32_t PAD_P4_WKPOL_0: 1;
        uint32_t PAD_P4_SHDN_0: 1;
        uint32_t PAD_P4_DEB_0: 1;
        uint32_t PAD_P4_RAP_WKEN_0: 1;
        uint32_t PAD_P4_PPU_WKEN_0: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t PAD_P4_AON_MUX_0: 2;
        uint32_t PAD_P4_O_1: 1;
        uint32_t PAD_P4_E_1: 1;
        uint32_t PAD_P4_PU_EN_1: 1;
        uint32_t AON_PAD_P4_PD_1: 1;
        uint32_t PAD_P4_PUPDC_1: 1;
        uint32_t PAD_P4_WKEN_1: 1;
        uint32_t PAD_P4_WKPOL_1: 1;
        uint32_t PAD_P4_SHDN_1: 1;
        uint32_t PAD_P4_DEB_1: 1;
        uint32_t PAD_P4_RAP_WKEN_1: 1;
        uint32_t PAD_P4_PPU_WKEN_1: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t PAD_P4_AON_MUX_1: 2;
    };
} AON_REG_PAD_REG14X_TYPE;

/*0x4000_0158 AON_REG_PAD_REG14X*/
#define AON_REG_PAD_REG14X_PAD_P4_O_0_Pos                                                                                0U
#define AON_REG_PAD_REG14X_PAD_P4_O_0_Msk                                                                                (0x1UL << AON_REG_PAD_REG14X_PAD_P4_O_0_Pos)

#define AON_REG_PAD_REG14X_PAD_P4_E_0_Pos                                                                                1U
#define AON_REG_PAD_REG14X_PAD_P4_E_0_Msk                                                                                (0x1UL << AON_REG_PAD_REG14X_PAD_P4_E_0_Pos)

#define AON_REG_PAD_REG14X_PAD_P4_PU_EN_0_Pos                                                                            2U
#define AON_REG_PAD_REG14X_PAD_P4_PU_EN_0_Msk                                                                            (0x1UL << AON_REG_PAD_REG14X_PAD_P4_PU_EN_0_Pos)

#define AON_REG_PAD_REG14X_AON_PAD_P4_PD_0_Pos                                                                           3U
#define AON_REG_PAD_REG14X_AON_PAD_P4_PD_0_Msk                                                                           (0x1UL << AON_REG_PAD_REG14X_AON_PAD_P4_PD_0_Pos)

#define AON_REG_PAD_REG14X_PAD_P4_PUPDC_0_Pos                                                                            4U
#define AON_REG_PAD_REG14X_PAD_P4_PUPDC_0_Msk                                                                            (0x1UL << AON_REG_PAD_REG14X_PAD_P4_PUPDC_0_Pos)

#define AON_REG_PAD_REG14X_PAD_P4_WKEN_0_Pos                                                                             5U
#define AON_REG_PAD_REG14X_PAD_P4_WKEN_0_Msk                                                                             (0x1UL << AON_REG_PAD_REG14X_PAD_P4_WKEN_0_Pos)

#define AON_REG_PAD_REG14X_PAD_P4_WKPOL_0_Pos                                                                            6U
#define AON_REG_PAD_REG14X_PAD_P4_WKPOL_0_Msk                                                                            (0x1UL << AON_REG_PAD_REG14X_PAD_P4_WKPOL_0_Pos)

#define AON_REG_PAD_REG14X_PAD_P4_SHDN_0_Pos                                                                             7U
#define AON_REG_PAD_REG14X_PAD_P4_SHDN_0_Msk                                                                             (0x1UL << AON_REG_PAD_REG14X_PAD_P4_SHDN_0_Pos)

