rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG15X_PAD_P4_E_2_Pos                                                                                1U
#define AON_REG_PAD_REG15X_PAD_P4_E_2_Msk                                                                                (0x1UL << AON_REG_PAD_REG15X_PAD_P4_E_2_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_PU_EN_2_Pos                                                                            2U
#define AON_REG_PAD_REG15X_PAD_P4_PU_EN_2_Msk                                                                            (0x1UL << AON_REG_PAD_REG15X_PAD_P4_PU_EN_2_Pos)

#define AON_REG_PAD_REG15X_AON_PAD_P4_PD_2_Pos                                                                           3U
#define AON_REG_PAD_REG15X_AON_PAD_P4_PD_2_Msk                                                                           (0x1UL << AON_REG_PAD_REG15X_AON_PAD_P4_PD_2_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_PUPDC_2_Pos                                                                            4U
#define AON_REG_PAD_REG15X_PAD_P4_PUPDC_2_Msk                                                                            (0x1UL << AON_REG_PAD_REG15X_PAD_P4_PUPDC_2_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_WKEN_2_Pos                                                                             5U
#define AON_REG_PAD_REG15X_PAD_P4_WKEN_2_Msk                                                                             (0x1UL << AON_REG_PAD_REG15X_PAD_P4_WKEN_2_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_WKPOL_2_Pos                                                                            6U
#define AON_REG_PAD_REG15X_PAD_P4_WKPOL_2_Msk                                                                            (0x1UL << AON_REG_PAD_REG15X_PAD_P4_WKPOL_2_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_SHDN_2_Pos                                                                             7U
#define AON_REG_PAD_REG15X_PAD_P4_SHDN_2_Msk                                                                             (0x1UL << AON_REG_PAD_REG15X_PAD_P4_SHDN_2_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_DEB_2_Pos                                                                              8U
#define AON_REG_PAD_REG15X_PAD_P4_DEB_2_Msk                                                                              (0x1UL << AON_REG_PAD_REG15X_PAD_P4_DEB_2_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_RAP_WKEN_2_Pos                                                                         9U
#define AON_REG_PAD_REG15X_PAD_P4_RAP_WKEN_2_Msk                                                                         (0x1UL << AON_REG_PAD_REG15X_PAD_P4_RAP_WKEN_2_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_PPU_WKEN_2_Pos                                                                         10U
#define AON_REG_PAD_REG15X_PAD_P4_PPU_WKEN_2_Msk                                                                         (0x1UL << AON_REG_PAD_REG15X_PAD_P4_PPU_WKEN_2_Pos)

#define AON_REG_PAD_REG15X_RESERVED_3_Pos                                                                                11U
#define AON_REG_PAD_REG15X_RESERVED_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG15X_RESERVED_3_Pos)

#define AON_REG_PAD_REG15X_RESERVED_2_Pos                                                                                12U
#define AON_REG_PAD_REG15X_RESERVED_2_Msk                                                                                (0x3UL << AON_REG_PAD_REG15X_RESERVED_2_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_AON_MUX_2_Pos                                                                          14U
#define AON_REG_PAD_REG15X_PAD_P4_AON_MUX_2_Msk                                                                          (0x3UL << AON_REG_PAD_REG15X_PAD_P4_AON_MUX_2_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_O_3_Pos                                                                                16U
#define AON_REG_PAD_REG15X_PAD_P4_O_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG15X_PAD_P4_O_3_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_E_3_Pos                                                                                17U
#define AON_REG_PAD_REG15X_PAD_P4_E_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG15X_PAD_P4_E_3_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_PU_EN_3_Pos                                                                            18U
#define AON_REG_PAD_REG15X_PAD_P4_PU_EN_3_Msk                                                                            (0x1UL << AON_REG_PAD_REG15X_PAD_P4_PU_EN_3_Pos)

#define AON_REG_PAD_REG15X_AON_PAD_P4_PD_3_Pos                                                                           19U
#define AON_REG_PAD_REG15X_AON_PAD_P4_PD_3_Msk                                                                           (0x1UL << AON_REG_PAD_REG15X_AON_PAD_P4_PD_3_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_PUPDC_3_Pos                                                                            20U
#define AON_REG_PAD_REG15X_PAD_P4_PUPDC_3_Msk                                                                            (0x1UL << AON_REG_PAD_REG15X_PAD_P4_PUPDC_3_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_WKEN_3_Pos                                                                             21U
#define AON_REG_PAD_REG15X_PAD_P4_WKEN_3_Msk                                                                             (0x1UL << AON_REG_PAD_REG15X_PAD_P4_WKEN_3_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_WKPOL_3_Pos                                                                            22U
#define AON_REG_PAD_REG15X_PAD_P4_WKPOL_3_Msk                                                                            (0x1UL << AON_REG_PAD_REG15X_PAD_P4_WKPOL_3_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_SHDN_3_Pos                                                                             23U
#define AON_REG_PAD_REG15X_PAD_P4_SHDN_3_Msk                                                                             (0x1UL << AON_REG_PAD_REG15X_PAD_P4_SHDN_3_Pos)

