rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG15X_PAD_P4_DEB_3_Pos                                                                              24U
#define AON_REG_PAD_REG15X_PAD_P4_DEB_3_Msk                                                                              (0x1UL << AON_REG_PAD_REG15X_PAD_P4_DEB_3_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_RAP_WKEN_3_Pos                                                                         25U
#define AON_REG_PAD_REG15X_PAD_P4_RAP_WKEN_3_Msk                                                                         (0x1UL << AON_REG_PAD_REG15X_PAD_P4_RAP_WKEN_3_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_PPU_WKEN_3_Pos                                                                         26U
#define AON_REG_PAD_REG15X_PAD_P4_PPU_WKEN_3_Msk                                                                         (0x1UL << AON_REG_PAD_REG15X_PAD_P4_PPU_WKEN_3_Pos)

#define AON_REG_PAD_REG15X_RESERVED_1_Pos                                                                                27U
#define AON_REG_PAD_REG15X_RESERVED_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG15X_RESERVED_1_Pos)

#define AON_REG_PAD_REG15X_RESERVED_Pos                                                                                  28U
#define AON_REG_PAD_REG15X_RESERVED_Msk                                                                                  (0x3UL << AON_REG_PAD_REG15X_RESERVED_Pos)

#define AON_REG_PAD_REG15X_PAD_P4_AON_MUX_3_Pos                                                                          30U
#define AON_REG_PAD_REG15X_PAD_P4_AON_MUX_3_Msk                                                                          (0x3UL << AON_REG_PAD_REG15X_PAD_P4_AON_MUX_3_Pos)

/* 0x160    0x4000_0160
    0       R/W     PAD_P5_O_1                                                  1'b0
    1       R/W     PAD_P5_E_1                                                  1'b0
    2       R/W     PAD_P5_PU_EN_1                                              1'b1
    3       R/W     AON_PAD_P5_PD_1                                             1'b1
    4       R/W     PAD_P5_PUPDC_1                                              1'b0
    5       R/W     PAD_P5_WKEN_1                                               1'b0
    6       R/W     PAD_P5_WKPOL_1                                              1'b0
    7       R/W     PAD_P5_SHDN_1                                               1'b1
    8       R/W     PAD_P5_DEB_1                                                1'b0
    9       R/W     PAD_P5_RAP_WKEN_1                                           1'b0
    10      R/W     PAD_P5_PPU_WKEN_1                                           1'b0
    11      R/W     RESERVED_4                                                  1'b0
    12      R/W     RESERVED_3                                                  1'b0
    13      R       RESERVED_2                                                  1'b0
    15:14   R/W     PAD_P5_AON_MUX_1                                            2'b00
    16      R/W     PAD_P5_O_2                                                  1'b0
    17      R/W     PAD_P5_E_2                                                  1'b0
    18      R/W     PAD_P5_PU_EN_2                                              1'b1
    19      R/W     AON_PAD_P5_PD_2                                             1'b1
    20      R/W     PAD_P5_PUPDC_2                                              1'b0
    21      R/W     PAD_P5_WKEN_2                                               1'b0
    22      R/W     PAD_P5_WKPOL_2                                              1'b0
    23      R/W     PAD_P5_SHDN_2                                               1'b1
    24      R/W     PAD_P5_DEB_2                                                1'b0
    25      R/W     PAD_P5_RAP_WKEN_2                                           1'b0
    26      R/W     PAD_P5_PPU_WKEN_2                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    29:28   R       RESERVED                                                    2'b00
    31:30   R/W     PAD_P5_AON_MUX_2                                            2'b00
 */
typedef union _AON_REG_PAD_REG16X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P5_O_1: 1;
        uint32_t PAD_P5_E_1: 1;
        uint32_t PAD_P5_PU_EN_1: 1;
        uint32_t AON_PAD_P5_PD_1: 1;
        uint32_t PAD_P5_PUPDC_1: 1;
        uint32_t PAD_P5_WKEN_1: 1;
        uint32_t PAD_P5_WKPOL_1: 1;
        uint32_t PAD_P5_SHDN_1: 1;
        uint32_t PAD_P5_DEB_1: 1;
        uint32_t PAD_P5_RAP_WKEN_1: 1;
        uint32_t PAD_P5_PPU_WKEN_1: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t PAD_P5_AON_MUX_1: 2;
        uint32_t PAD_P5_O_2: 1;
        uint32_t PAD_P5_E_2: 1;
        uint32_t PAD_P5_PU_EN_2: 1;
        uint32_t AON_PAD_P5_PD_2: 1;
        uint32_t PAD_P5_PUPDC_2: 1;
        uint32_t PAD_P5_WKEN_2: 1;
        uint32_t PAD_P5_WKPOL_2: 1;
        uint32_t PAD_P5_SHDN_2: 1;
        uint32_t PAD_P5_DEB_2: 1;
        uint32_t PAD_P5_RAP_WKEN_2: 1;
        uint32_t PAD_P5_PPU_WKEN_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t PAD_P5_AON_MUX_2: 2;
    };
} AON_REG_PAD_REG16X_TYPE;

/*0x4000_0160 AON_REG_PAD_REG16X*/
#define AON_REG_PAD_REG16X_PAD_P5_O_1_Pos                                                                                0U
#define AON_REG_PAD_REG16X_PAD_P5_O_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG16X_PAD_P5_O_1_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_E_1_Pos                                                                                1U
#define AON_REG_PAD_REG16X_PAD_P5_E_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG16X_PAD_P5_E_1_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_PU_EN_1_Pos                                                                            2U
#define AON_REG_PAD_REG16X_PAD_P5_PU_EN_1_Msk                                                                            (0x1UL << AON_REG_PAD_REG16X_PAD_P5_PU_EN_1_Pos)

#define AON_REG_PAD_REG16X_AON_PAD_P5_PD_1_Pos                                                                           3U
#define AON_REG_PAD_REG16X_AON_PAD_P5_PD_1_Msk                                                                           (0x1UL << AON_REG_PAD_REG16X_AON_PAD_P5_PD_1_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_PUPDC_1_Pos                                                                            4U
#define AON_REG_PAD_REG16X_PAD_P5_PUPDC_1_Msk                                                                            (0x1UL << AON_REG_PAD_REG16X_PAD_P5_PUPDC_1_Pos)

