rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG16X_PAD_P5_WKEN_1_Pos                                                                             5U
#define AON_REG_PAD_REG16X_PAD_P5_WKEN_1_Msk                                                                             (0x1UL << AON_REG_PAD_REG16X_PAD_P5_WKEN_1_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_WKPOL_1_Pos                                                                            6U
#define AON_REG_PAD_REG16X_PAD_P5_WKPOL_1_Msk                                                                            (0x1UL << AON_REG_PAD_REG16X_PAD_P5_WKPOL_1_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_SHDN_1_Pos                                                                             7U
#define AON_REG_PAD_REG16X_PAD_P5_SHDN_1_Msk                                                                             (0x1UL << AON_REG_PAD_REG16X_PAD_P5_SHDN_1_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_DEB_1_Pos                                                                              8U
#define AON_REG_PAD_REG16X_PAD_P5_DEB_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG16X_PAD_P5_DEB_1_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_RAP_WKEN_1_Pos                                                                         9U
#define AON_REG_PAD_REG16X_PAD_P5_RAP_WKEN_1_Msk                                                                         (0x1UL << AON_REG_PAD_REG16X_PAD_P5_RAP_WKEN_1_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_PPU_WKEN_1_Pos                                                                         10U
#define AON_REG_PAD_REG16X_PAD_P5_PPU_WKEN_1_Msk                                                                         (0x1UL << AON_REG_PAD_REG16X_PAD_P5_PPU_WKEN_1_Pos)

#define AON_REG_PAD_REG16X_RESERVED_4_Pos                                                                                11U
#define AON_REG_PAD_REG16X_RESERVED_4_Msk                                                                                (0x1UL << AON_REG_PAD_REG16X_RESERVED_4_Pos)

#define AON_REG_PAD_REG16X_RESERVED_3_Pos                                                                                12U
#define AON_REG_PAD_REG16X_RESERVED_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG16X_RESERVED_3_Pos)

#define AON_REG_PAD_REG16X_RESERVED_2_Pos                                                                                13U
#define AON_REG_PAD_REG16X_RESERVED_2_Msk                                                                                (0x1UL << AON_REG_PAD_REG16X_RESERVED_2_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_AON_MUX_1_Pos                                                                          14U
#define AON_REG_PAD_REG16X_PAD_P5_AON_MUX_1_Msk                                                                          (0x3UL << AON_REG_PAD_REG16X_PAD_P5_AON_MUX_1_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_O_2_Pos                                                                                16U
#define AON_REG_PAD_REG16X_PAD_P5_O_2_Msk                                                                                (0x1UL << AON_REG_PAD_REG16X_PAD_P5_O_2_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_E_2_Pos                                                                                17U
#define AON_REG_PAD_REG16X_PAD_P5_E_2_Msk                                                                                (0x1UL << AON_REG_PAD_REG16X_PAD_P5_E_2_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_PU_EN_2_Pos                                                                            18U
#define AON_REG_PAD_REG16X_PAD_P5_PU_EN_2_Msk                                                                            (0x1UL << AON_REG_PAD_REG16X_PAD_P5_PU_EN_2_Pos)

#define AON_REG_PAD_REG16X_AON_PAD_P5_PD_2_Pos                                                                           19U
#define AON_REG_PAD_REG16X_AON_PAD_P5_PD_2_Msk                                                                           (0x1UL << AON_REG_PAD_REG16X_AON_PAD_P5_PD_2_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_PUPDC_2_Pos                                                                            20U
#define AON_REG_PAD_REG16X_PAD_P5_PUPDC_2_Msk                                                                            (0x1UL << AON_REG_PAD_REG16X_PAD_P5_PUPDC_2_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_WKEN_2_Pos                                                                             21U
#define AON_REG_PAD_REG16X_PAD_P5_WKEN_2_Msk                                                                             (0x1UL << AON_REG_PAD_REG16X_PAD_P5_WKEN_2_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_WKPOL_2_Pos                                                                            22U
#define AON_REG_PAD_REG16X_PAD_P5_WKPOL_2_Msk                                                                            (0x1UL << AON_REG_PAD_REG16X_PAD_P5_WKPOL_2_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_SHDN_2_Pos                                                                             23U
#define AON_REG_PAD_REG16X_PAD_P5_SHDN_2_Msk                                                                             (0x1UL << AON_REG_PAD_REG16X_PAD_P5_SHDN_2_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_DEB_2_Pos                                                                              24U
#define AON_REG_PAD_REG16X_PAD_P5_DEB_2_Msk                                                                              (0x1UL << AON_REG_PAD_REG16X_PAD_P5_DEB_2_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_RAP_WKEN_2_Pos                                                                         25U
#define AON_REG_PAD_REG16X_PAD_P5_RAP_WKEN_2_Msk                                                                         (0x1UL << AON_REG_PAD_REG16X_PAD_P5_RAP_WKEN_2_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_PPU_WKEN_2_Pos                                                                         26U
#define AON_REG_PAD_REG16X_PAD_P5_PPU_WKEN_2_Msk                                                                         (0x1UL << AON_REG_PAD_REG16X_PAD_P5_PPU_WKEN_2_Pos)

#define AON_REG_PAD_REG16X_RESERVED_1_Pos                                                                                27U
#define AON_REG_PAD_REG16X_RESERVED_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG16X_RESERVED_1_Pos)

#define AON_REG_PAD_REG16X_RESERVED_Pos                                                                                  28U
#define AON_REG_PAD_REG16X_RESERVED_Msk                                                                                  (0x3UL << AON_REG_PAD_REG16X_RESERVED_Pos)

#define AON_REG_PAD_REG16X_PAD_P5_AON_MUX_2_Pos                                                                          30U
#define AON_REG_PAD_REG16X_PAD_P5_AON_MUX_2_Msk                                                                          (0x3UL << AON_REG_PAD_REG16X_PAD_P5_AON_MUX_2_Pos)

/* 0x164    0x4000_0164
    0       R/W     PAD_P6_O_0                                                  1'b0
    1       R/W     PAD_P6_E_0                                                  1'b0
    2       R/W     PAD_P6_PU_EN_0                                              1'b1
    3       R/W     AON_PAD_P6_PD_0                                             1'b1
    4       R/W     PAD_P6_PUPDC_0                                              1'b0
    5       R/W     PAD_P6_WKEN_0                                               1'b0
    6       R/W     PAD_P6_WKPOL_0                                              1'b0
    7       R/W     PAD_P6_SHDN_0                                               1'b1
    8       R/W     PAD_P6_DEB_0                                                1'b0
    9       R/W     PAD_P6_RAP_WKEN_0                                           1'b0
    10      R/W     PAD_P6_PPU_WKEN_0                                           1'b0
    11      R/W     RESERVED_3                                                  1'b0
    12      R/W     PAD_P6_E2_AUX_0                                             1'b0
    13      R       RESERVED_2                                                  1'b0
    15:14   R/W     PAD_P6_AON_MUX_0                                            2'b00
    16      R/W     PAD_P6_O_1                                                  1'b0
    17      R/W     PAD_P6_E_1                                                  1'b0
    18      R/W     PAD_P6_PU_EN_1                                              1'b1
    19      R/W     AON_PAD_P6_PD_1                                             1'b1
    20      R/W     PAD_P6_PUPDC_1                                              1'b0
    21      R/W     PAD_P6_WKEN_1                                               1'b0
    22      R/W     PAD_P6_WKPOL_1                                              1'b0
    23      R/W     PAD_P6_SHDN_1                                               1'b1
    24      R/W     PAD_P6_DEB_1                                                1'b0
    25      R/W     PAD_P6_RAP_WKEN_1                                           1'b0
    26      R/W     PAD_P6_PPU_WKEN_1                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    29:28   R       RESERVED                                                    2'b00
    31:30   R/W     PAD_P6_AON_MUX_1                                            2'b00
 */
typedef union _AON_REG_PAD_REG17X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P6_O_0: 1;
        uint32_t PAD_P6_E_0: 1;
        uint32_t PAD_P6_PU_EN_0: 1;
        uint32_t AON_PAD_P6_PD_0: 1;
        uint32_t PAD_P6_PUPDC_0: 1;
        uint32_t PAD_P6_WKEN_0: 1;
        uint32_t PAD_P6_WKPOL_0: 1;
        uint32_t PAD_P6_SHDN_0: 1;
        uint32_t PAD_P6_DEB_0: 1;
        uint32_t PAD_P6_RAP_WKEN_0: 1;
        uint32_t PAD_P6_PPU_WKEN_0: 1;
        uint32_t RESERVED_3: 1;
        uint32_t PAD_P6_E2_AUX_0: 1;
        uint32_t RESERVED_2: 1;
        uint32_t PAD_P6_AON_MUX_0: 2;
        uint32_t PAD_P6_O_1: 1;
        uint32_t PAD_P6_E_1: 1;
        uint32_t PAD_P6_PU_EN_1: 1;
        uint32_t AON_PAD_P6_PD_1: 1;
        uint32_t PAD_P6_PUPDC_1: 1;
        uint32_t PAD_P6_WKEN_1: 1;
        uint32_t PAD_P6_WKPOL_1: 1;
        uint32_t PAD_P6_SHDN_1: 1;
        uint32_t PAD_P6_DEB_1: 1;
        uint32_t PAD_P6_RAP_WKEN_1: 1;
        uint32_t PAD_P6_PPU_WKEN_1: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t PAD_P6_AON_MUX_1: 2;
    };
} AON_REG_PAD_REG17X_TYPE;

/*0x4000_0164 AON_REG_PAD_REG17X*/
#define AON_REG_PAD_REG17X_PAD_P6_O_0_Pos                                                                                0U
#define AON_REG_PAD_REG17X_PAD_P6_O_0_Msk                                                                                (0x1UL << AON_REG_PAD_REG17X_PAD_P6_O_0_Pos)

#define AON_REG_PAD_REG17X_PAD_P6_E_0_Pos                                                                                1U
#define AON_REG_PAD_REG17X_PAD_P6_E_0_Msk                                                                                (0x1UL << AON_REG_PAD_REG17X_PAD_P6_E_0_Pos)

#define AON_REG_PAD_REG17X_PAD_P6_PU_EN_0_Pos                                                                            2U
#define AON_REG_PAD_REG17X_PAD_P6_PU_EN_0_Msk                                                                            (0x1UL << AON_REG_PAD_REG17X_PAD_P6_PU_EN_0_Pos)

