rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG20X_PAD_P6_PU_EN_6_Pos                                                                            2U
#define AON_REG_PAD_REG20X_PAD_P6_PU_EN_6_Msk                                                                            (0x1UL << AON_REG_PAD_REG20X_PAD_P6_PU_EN_6_Pos)

#define AON_REG_PAD_REG20X_AON_PAD_P6_PD_6_Pos                                                                           3U
#define AON_REG_PAD_REG20X_AON_PAD_P6_PD_6_Msk                                                                           (0x1UL << AON_REG_PAD_REG20X_AON_PAD_P6_PD_6_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_PUPDC_6_Pos                                                                            4U
#define AON_REG_PAD_REG20X_PAD_P6_PUPDC_6_Msk                                                                            (0x1UL << AON_REG_PAD_REG20X_PAD_P6_PUPDC_6_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_WKEN_6_Pos                                                                             5U
#define AON_REG_PAD_REG20X_PAD_P6_WKEN_6_Msk                                                                             (0x1UL << AON_REG_PAD_REG20X_PAD_P6_WKEN_6_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_WKPOL_6_Pos                                                                            6U
#define AON_REG_PAD_REG20X_PAD_P6_WKPOL_6_Msk                                                                            (0x1UL << AON_REG_PAD_REG20X_PAD_P6_WKPOL_6_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_SHDN_6_Pos                                                                             7U
#define AON_REG_PAD_REG20X_PAD_P6_SHDN_6_Msk                                                                             (0x1UL << AON_REG_PAD_REG20X_PAD_P6_SHDN_6_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_DEB_6_Pos                                                                              8U
#define AON_REG_PAD_REG20X_PAD_P6_DEB_6_Msk                                                                              (0x1UL << AON_REG_PAD_REG20X_PAD_P6_DEB_6_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_RAP_WKEN_6_Pos                                                                         9U
#define AON_REG_PAD_REG20X_PAD_P6_RAP_WKEN_6_Msk                                                                         (0x1UL << AON_REG_PAD_REG20X_PAD_P6_RAP_WKEN_6_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_PPU_WKEN_6_Pos                                                                         10U
#define AON_REG_PAD_REG20X_PAD_P6_PPU_WKEN_6_Msk                                                                         (0x1UL << AON_REG_PAD_REG20X_PAD_P6_PPU_WKEN_6_Pos)

#define AON_REG_PAD_REG20X_RESERVED_3_Pos                                                                                11U
#define AON_REG_PAD_REG20X_RESERVED_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG20X_RESERVED_3_Pos)

#define AON_REG_PAD_REG20X_RESERVED_2_Pos                                                                                12U
#define AON_REG_PAD_REG20X_RESERVED_2_Msk                                                                                (0x3UL << AON_REG_PAD_REG20X_RESERVED_2_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_AON_MUX_6_Pos                                                                          14U
#define AON_REG_PAD_REG20X_PAD_P6_AON_MUX_6_Msk                                                                          (0x3UL << AON_REG_PAD_REG20X_PAD_P6_AON_MUX_6_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_O_7_Pos                                                                                16U
#define AON_REG_PAD_REG20X_PAD_P6_O_7_Msk                                                                                (0x1UL << AON_REG_PAD_REG20X_PAD_P6_O_7_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_E_7_Pos                                                                                17U
#define AON_REG_PAD_REG20X_PAD_P6_E_7_Msk                                                                                (0x1UL << AON_REG_PAD_REG20X_PAD_P6_E_7_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_PU_EN_7_Pos                                                                            18U
#define AON_REG_PAD_REG20X_PAD_P6_PU_EN_7_Msk                                                                            (0x1UL << AON_REG_PAD_REG20X_PAD_P6_PU_EN_7_Pos)

#define AON_REG_PAD_REG20X_AON_PAD_P6_PD_7_Pos                                                                           19U
#define AON_REG_PAD_REG20X_AON_PAD_P6_PD_7_Msk                                                                           (0x1UL << AON_REG_PAD_REG20X_AON_PAD_P6_PD_7_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_PUPDC_7_Pos                                                                            20U
#define AON_REG_PAD_REG20X_PAD_P6_PUPDC_7_Msk                                                                            (0x1UL << AON_REG_PAD_REG20X_PAD_P6_PUPDC_7_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_WKEN_7_Pos                                                                             21U
#define AON_REG_PAD_REG20X_PAD_P6_WKEN_7_Msk                                                                             (0x1UL << AON_REG_PAD_REG20X_PAD_P6_WKEN_7_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_WKPOL_7_Pos                                                                            22U
#define AON_REG_PAD_REG20X_PAD_P6_WKPOL_7_Msk                                                                            (0x1UL << AON_REG_PAD_REG20X_PAD_P6_WKPOL_7_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_SHDN_7_Pos                                                                             23U
#define AON_REG_PAD_REG20X_PAD_P6_SHDN_7_Msk                                                                             (0x1UL << AON_REG_PAD_REG20X_PAD_P6_SHDN_7_Pos)

#define AON_REG_PAD_REG20X_PAD_P6_DEB_7_Pos                                                                              24U
#define AON_REG_PAD_REG20X_PAD_P6_DEB_7_Msk                                                                              (0x1UL << AON_REG_PAD_REG20X_PAD_P6_DEB_7_Pos)

