rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG21X_PAD_P7_AON_MUX_1_Pos                                                                          30U
#define AON_REG_PAD_REG21X_PAD_P7_AON_MUX_1_Msk                                                                          (0x3UL << AON_REG_PAD_REG21X_PAD_P7_AON_MUX_1_Pos)

/* 0x178    0x4000_0178
    0       R/W     PAD_MICBIAS_O                                               1'b0
    1       R/W     PAD_MICBIAS_E                                               1'b0
    2       R/W     PAD_MICBIAS_PU_EN                                           1'b1
    3       R/W     AON_PAD_MICBIAS_PD                                          1'b1
    4       R/W     PAD_MICBIAS_PUPDC                                           1'b0
    5       R/W     PAD_MICBIAS_WKEN                                            1'b0
    6       R/W     PAD_MICBIAS_WKPOL                                           1'b0
    7       R/W     PAD_MICBIAS_SHDN                                            1'b1
    8       R/W     PAD_MICBIAS_DEB                                             1'b0
    9       R/W     PAD_MICBIAS_RAP_WKEN                                        1'b0
    10      R/W     PAD_MICBIAS_PPU_WKEN                                        1'b0
    11      R/W     RESERVED_2                                                  1'b0
    12      R/W     DUMMY_PAD8                                                  1'b0
    13      R/W     RESERVED_1                                                  1'b0
    15:14   R/W     PAD_MICBIAS_AON_MUX                                         2'b00
    31:16   R       RESERVED                                                    16'h0
 */
typedef union _AON_REG_PAD_REG22X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_MICBIAS_O: 1;
        uint32_t PAD_MICBIAS_E: 1;
        uint32_t PAD_MICBIAS_PU_EN: 1;
        uint32_t AON_PAD_MICBIAS_PD: 1;
        uint32_t PAD_MICBIAS_PUPDC: 1;
        uint32_t PAD_MICBIAS_WKEN: 1;
        uint32_t PAD_MICBIAS_WKPOL: 1;
        uint32_t PAD_MICBIAS_SHDN: 1;
        uint32_t PAD_MICBIAS_DEB: 1;
        uint32_t PAD_MICBIAS_RAP_WKEN: 1;
        uint32_t PAD_MICBIAS_PPU_WKEN: 1;
        uint32_t RESERVED_2: 1;
        uint32_t DUMMY_PAD8: 1;
        uint32_t RESERVED_1: 1;
        uint32_t PAD_MICBIAS_AON_MUX: 2;
        uint32_t RESERVED: 16;
    };
} AON_REG_PAD_REG22X_TYPE;

/*0x4000_0178 AON_REG_PAD_REG22X*/
#define AON_REG_PAD_REG22X_PAD_MICBIAS_O_Pos                                                                             0U
#define AON_REG_PAD_REG22X_PAD_MICBIAS_O_Msk                                                                             (0x1UL << AON_REG_PAD_REG22X_PAD_MICBIAS_O_Pos)

#define AON_REG_PAD_REG22X_PAD_MICBIAS_E_Pos                                                                             1U
#define AON_REG_PAD_REG22X_PAD_MICBIAS_E_Msk                                                                             (0x1UL << AON_REG_PAD_REG22X_PAD_MICBIAS_E_Pos)

#define AON_REG_PAD_REG22X_PAD_MICBIAS_PU_EN_Pos                                                                         2U
#define AON_REG_PAD_REG22X_PAD_MICBIAS_PU_EN_Msk                                                                         (0x1UL << AON_REG_PAD_REG22X_PAD_MICBIAS_PU_EN_Pos)

#define AON_REG_PAD_REG22X_AON_PAD_MICBIAS_PD_Pos                                                                        3U
#define AON_REG_PAD_REG22X_AON_PAD_MICBIAS_PD_Msk                                                                        (0x1UL << AON_REG_PAD_REG22X_AON_PAD_MICBIAS_PD_Pos)

#define AON_REG_PAD_REG22X_PAD_MICBIAS_PUPDC_Pos                                                                         4U
#define AON_REG_PAD_REG22X_PAD_MICBIAS_PUPDC_Msk                                                                         (0x1UL << AON_REG_PAD_REG22X_PAD_MICBIAS_PUPDC_Pos)

#define AON_REG_PAD_REG22X_PAD_MICBIAS_WKEN_Pos                                                                          5U
#define AON_REG_PAD_REG22X_PAD_MICBIAS_WKEN_Msk                                                                          (0x1UL << AON_REG_PAD_REG22X_PAD_MICBIAS_WKEN_Pos)

#define AON_REG_PAD_REG22X_PAD_MICBIAS_WKPOL_Pos                                                                         6U
#define AON_REG_PAD_REG22X_PAD_MICBIAS_WKPOL_Msk                                                                         (0x1UL << AON_REG_PAD_REG22X_PAD_MICBIAS_WKPOL_Pos)

#define AON_REG_PAD_REG22X_PAD_MICBIAS_SHDN_Pos                                                                          7U
#define AON_REG_PAD_REG22X_PAD_MICBIAS_SHDN_Msk                                                                          (0x1UL << AON_REG_PAD_REG22X_PAD_MICBIAS_SHDN_Pos)

#define AON_REG_PAD_REG22X_PAD_MICBIAS_DEB_Pos                                                                           8U
#define AON_REG_PAD_REG22X_PAD_MICBIAS_DEB_Msk                                                                           (0x1UL << AON_REG_PAD_REG22X_PAD_MICBIAS_DEB_Pos)

#define AON_REG_PAD_REG22X_PAD_MICBIAS_RAP_WKEN_Pos                                                                      9U
#define AON_REG_PAD_REG22X_PAD_MICBIAS_RAP_WKEN_Msk                                                                      (0x1UL << AON_REG_PAD_REG22X_PAD_MICBIAS_RAP_WKEN_Pos)

#define AON_REG_PAD_REG22X_PAD_MICBIAS_PPU_WKEN_Pos                                                                      10U
#define AON_REG_PAD_REG22X_PAD_MICBIAS_PPU_WKEN_Msk                                                                      (0x1UL << AON_REG_PAD_REG22X_PAD_MICBIAS_PPU_WKEN_Pos)

#define AON_REG_PAD_REG22X_RESERVED_2_Pos                                                                                11U
#define AON_REG_PAD_REG22X_RESERVED_2_Msk                                                                                (0x1UL << AON_REG_PAD_REG22X_RESERVED_2_Pos)

#define AON_REG_PAD_REG22X_DUMMY_PAD8_Pos                                                                                12U
#define AON_REG_PAD_REG22X_DUMMY_PAD8_Msk                                                                                (0x1UL << AON_REG_PAD_REG22X_DUMMY_PAD8_Pos)

#define AON_REG_PAD_REG22X_RESERVED_1_Pos                                                                                13U
#define AON_REG_PAD_REG22X_RESERVED_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG22X_RESERVED_1_Pos)

#define AON_REG_PAD_REG22X_PAD_MICBIAS_AON_MUX_Pos                                                                       14U
#define AON_REG_PAD_REG22X_PAD_MICBIAS_AON_MUX_Msk                                                                       (0x3UL << AON_REG_PAD_REG22X_PAD_MICBIAS_AON_MUX_Pos)

#define AON_REG_PAD_REG22X_RESERVED_Pos                                                                                  16U
#define AON_REG_PAD_REG22X_RESERVED_Msk                                                                                  (0xFFFFUL << AON_REG_PAD_REG22X_RESERVED_Pos)

/* 0x17C    0x4000_017c
    0       W1C     PAD_P0_STS_0                                                1'b1
    1       W1C     PAD_P0_STS_1                                                1'b1
    2       W1C     PAD_P0_STS_2                                                1'b1
    3       W1C     PAD_P0_STS_3                                                1'b1
    4       W1C     PAD_P0_STS_4                                                1'b1
    5       W1C     PAD_P0_STS_5                                                1'b1
    6       W1C     PAD_P0_STS_6                                                1'b1
    7       W1C     PAD_P0_STS_7                                                1'b1
    8       R/W     PAD_P0_1_RTC_CLK_OUT_EN                                     1'b0
    9       R/W     PAD_P0_3_RTC_CLK_OUT_EN                                     1'b0
    10      R/W     PAD_P0_1_O_EN                                               1'b1
    11      R/W     PAD_P0_4_O_EN                                               1'b1
    12      W1C     PAD_P1_STS_0                                                1'b1
    13      W1C     PAD_P1_STS_1                                                1'b1
    14      W1C     PAD_P1_STS_6                                                1'b1
    15      W1C     PAD_P1_STS_7                                                1'b1
    16      W1C     PAD_P2_STS_0                                                1'b1
    17      W1C     PAD_P2_STS_1                                                1'b1
    18      W1C     PAD_P2_STS_2                                                1'b1
    19      W1C     PAD_P2_STS_3                                                1'b1
    20      W1C     PAD_P2_STS_4                                                1'b1
    21      W1C     PAD_P2_STS_5                                                1'b1
    22      W1C     PAD_P2_STS_6                                                1'b1
    23      W1C     PAD_P2_STS_7                                                1'b1
    25:24   R/W     PAD_P2_1_CFG                                                2'b00
    27:26   R/W     PAD_P2_5_CFG                                                2'b00
    28      R/W     PAD_P2_6_CFG                                                1'b0
    29      R/W     PAD_P2_7_CFG                                                1'b0
    30      R/W     PAD_P2_5_O_EN                                               1'b1
    31      R       RESERVED                                                    1'b0
 */
typedef union _AON_REG_PAD_REG23X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P0_STS_0: 1;
        uint32_t PAD_P0_STS_1: 1;
        uint32_t PAD_P0_STS_2: 1;
        uint32_t PAD_P0_STS_3: 1;
        uint32_t PAD_P0_STS_4: 1;
        uint32_t PAD_P0_STS_5: 1;
        uint32_t PAD_P0_STS_6: 1;
        uint32_t PAD_P0_STS_7: 1;
        uint32_t PAD_P0_1_RTC_CLK_OUT_EN: 1;
        uint32_t PAD_P0_3_RTC_CLK_OUT_EN: 1;
        uint32_t PAD_P0_1_O_EN: 1;
        uint32_t PAD_P0_4_O_EN: 1;
        uint32_t PAD_P1_STS_0: 1;
        uint32_t PAD_P1_STS_1: 1;
        uint32_t PAD_P1_STS_6: 1;
        uint32_t PAD_P1_STS_7: 1;
        uint32_t PAD_P2_STS_0: 1;
        uint32_t PAD_P2_STS_1: 1;
        uint32_t PAD_P2_STS_2: 1;
        uint32_t PAD_P2_STS_3: 1;
        uint32_t PAD_P2_STS_4: 1;
        uint32_t PAD_P2_STS_5: 1;
        uint32_t PAD_P2_STS_6: 1;
        uint32_t PAD_P2_STS_7: 1;
        uint32_t PAD_P2_1_CFG: 2;
        uint32_t PAD_P2_5_CFG: 2;
        uint32_t PAD_P2_6_CFG: 1;
        uint32_t PAD_P2_7_CFG: 1;
        uint32_t PAD_P2_5_O_EN: 1;
        uint32_t RESERVED: 1;
    };
} AON_REG_PAD_REG23X_TYPE;

/*0x4000_017c AON_REG_PAD_REG23X*/
#define AON_REG_PAD_REG23X_PAD_P0_STS_0_Pos                                                                              0U
#define AON_REG_PAD_REG23X_PAD_P0_STS_0_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P0_STS_0_Pos)

