rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG23X_PAD_P0_STS_1_Pos                                                                              1U
#define AON_REG_PAD_REG23X_PAD_P0_STS_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P0_STS_1_Pos)

#define AON_REG_PAD_REG23X_PAD_P0_STS_2_Pos                                                                              2U
#define AON_REG_PAD_REG23X_PAD_P0_STS_2_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P0_STS_2_Pos)

#define AON_REG_PAD_REG23X_PAD_P0_STS_3_Pos                                                                              3U
#define AON_REG_PAD_REG23X_PAD_P0_STS_3_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P0_STS_3_Pos)

#define AON_REG_PAD_REG23X_PAD_P0_STS_4_Pos                                                                              4U
#define AON_REG_PAD_REG23X_PAD_P0_STS_4_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P0_STS_4_Pos)

#define AON_REG_PAD_REG23X_PAD_P0_STS_5_Pos                                                                              5U
#define AON_REG_PAD_REG23X_PAD_P0_STS_5_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P0_STS_5_Pos)

#define AON_REG_PAD_REG23X_PAD_P0_STS_6_Pos                                                                              6U
#define AON_REG_PAD_REG23X_PAD_P0_STS_6_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P0_STS_6_Pos)

#define AON_REG_PAD_REG23X_PAD_P0_STS_7_Pos                                                                              7U
#define AON_REG_PAD_REG23X_PAD_P0_STS_7_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P0_STS_7_Pos)

#define AON_REG_PAD_REG23X_PAD_P0_1_RTC_CLK_OUT_EN_Pos                                                                   8U
#define AON_REG_PAD_REG23X_PAD_P0_1_RTC_CLK_OUT_EN_Msk                                                                   (0x1UL << AON_REG_PAD_REG23X_PAD_P0_1_RTC_CLK_OUT_EN_Pos)

#define AON_REG_PAD_REG23X_PAD_P0_3_RTC_CLK_OUT_EN_Pos                                                                   9U
#define AON_REG_PAD_REG23X_PAD_P0_3_RTC_CLK_OUT_EN_Msk                                                                   (0x1UL << AON_REG_PAD_REG23X_PAD_P0_3_RTC_CLK_OUT_EN_Pos)

#define AON_REG_PAD_REG23X_PAD_P0_1_O_EN_Pos                                                                             10U
#define AON_REG_PAD_REG23X_PAD_P0_1_O_EN_Msk                                                                             (0x1UL << AON_REG_PAD_REG23X_PAD_P0_1_O_EN_Pos)

#define AON_REG_PAD_REG23X_PAD_P0_4_O_EN_Pos                                                                             11U
#define AON_REG_PAD_REG23X_PAD_P0_4_O_EN_Msk                                                                             (0x1UL << AON_REG_PAD_REG23X_PAD_P0_4_O_EN_Pos)

#define AON_REG_PAD_REG23X_PAD_P1_STS_0_Pos                                                                              12U
#define AON_REG_PAD_REG23X_PAD_P1_STS_0_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P1_STS_0_Pos)

#define AON_REG_PAD_REG23X_PAD_P1_STS_1_Pos                                                                              13U
#define AON_REG_PAD_REG23X_PAD_P1_STS_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P1_STS_1_Pos)

#define AON_REG_PAD_REG23X_PAD_P1_STS_6_Pos                                                                              14U
#define AON_REG_PAD_REG23X_PAD_P1_STS_6_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P1_STS_6_Pos)

#define AON_REG_PAD_REG23X_PAD_P1_STS_7_Pos                                                                              15U
#define AON_REG_PAD_REG23X_PAD_P1_STS_7_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P1_STS_7_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_STS_0_Pos                                                                              16U
#define AON_REG_PAD_REG23X_PAD_P2_STS_0_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P2_STS_0_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_STS_1_Pos                                                                              17U
#define AON_REG_PAD_REG23X_PAD_P2_STS_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P2_STS_1_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_STS_2_Pos                                                                              18U
#define AON_REG_PAD_REG23X_PAD_P2_STS_2_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P2_STS_2_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_STS_3_Pos                                                                              19U
#define AON_REG_PAD_REG23X_PAD_P2_STS_3_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P2_STS_3_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_STS_4_Pos                                                                              20U
#define AON_REG_PAD_REG23X_PAD_P2_STS_4_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P2_STS_4_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_STS_5_Pos                                                                              21U
#define AON_REG_PAD_REG23X_PAD_P2_STS_5_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P2_STS_5_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_STS_6_Pos                                                                              22U
#define AON_REG_PAD_REG23X_PAD_P2_STS_6_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P2_STS_6_Pos)

