rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG23X_PAD_P2_STS_7_Pos                                                                              23U
#define AON_REG_PAD_REG23X_PAD_P2_STS_7_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P2_STS_7_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_1_CFG_Pos                                                                              24U
#define AON_REG_PAD_REG23X_PAD_P2_1_CFG_Msk                                                                              (0x3UL << AON_REG_PAD_REG23X_PAD_P2_1_CFG_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_5_CFG_Pos                                                                              26U
#define AON_REG_PAD_REG23X_PAD_P2_5_CFG_Msk                                                                              (0x3UL << AON_REG_PAD_REG23X_PAD_P2_5_CFG_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_6_CFG_Pos                                                                              28U
#define AON_REG_PAD_REG23X_PAD_P2_6_CFG_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P2_6_CFG_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_7_CFG_Pos                                                                              29U
#define AON_REG_PAD_REG23X_PAD_P2_7_CFG_Msk                                                                              (0x1UL << AON_REG_PAD_REG23X_PAD_P2_7_CFG_Pos)

#define AON_REG_PAD_REG23X_PAD_P2_5_O_EN_Pos                                                                             30U
#define AON_REG_PAD_REG23X_PAD_P2_5_O_EN_Msk                                                                             (0x1UL << AON_REG_PAD_REG23X_PAD_P2_5_O_EN_Pos)

#define AON_REG_PAD_REG23X_RESERVED_Pos                                                                                  31U
#define AON_REG_PAD_REG23X_RESERVED_Msk                                                                                  (0x1UL << AON_REG_PAD_REG23X_RESERVED_Pos)

/* 0x180    0x4000_0180
    0       W1C     PAD_P3_STS_0                                                1'b1
    1       W1C     PAD_P3_STS_1                                                1'b1
    2       W1C     PAD_P3_STS_2                                                1'b1
    3       W1C     PAD_P3_STS_3                                                1'b1
    4       W1C     PAD_P3_STS_4                                                1'b1
    5       W1C     PAD_P3_STS_5                                                1'b1
    6       W1C     PAD_P3_STS_6                                                1'b1
    7       W1C     PAD_P4_STS_0                                                1'b1
    8       W1C     PAD_P4_STS_1                                                1'b1
    9       W1C     PAD_P4_STS_2                                                1'b1
    10      W1C     PAD_P4_STS_3                                                1'b1
    12:11   R/W     PAD_P4_0_CFG                                                2'b00
    13      R/W     PAD_P4_1_CFG                                                1'b0
    14      R/W     PAD_P4_2_CFG                                                1'b0
    15      R/W     PAD_P4_0_O_EN                                               1'b1
    16      R/W     PAD_P4_2_O_EN                                               1'b1
    17      R       RESERVED_2                                                  1'b0
    18      W1C     PAD_P5_STS_1                                                1'b1
    19      W1C     PAD_P5_STS_2                                                1'b1
    20      R       RESERVED_1                                                  1'b0
    21      W1C     PAD_P6_STS_0                                                1'b1
    22      W1C     PAD_P6_STS_1                                                1'b1
    23      W1C     PAD_P6_STS_2                                                1'b1
    24      W1C     PAD_P6_STS_3                                                1'b1
    25      W1C     PAD_P6_STS_4                                                1'b1
    26      W1C     PAD_P6_STS_5                                                1'b1
    27      W1C     PAD_P6_STS_6                                                1'b1
    28      W1C     PAD_P6_STS_7                                                1'b1
    31:29   R       RESERVED                                                    3'b000
 */
typedef union _AON_REG_PAD_REG24X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P3_STS_0: 1;
        uint32_t PAD_P3_STS_1: 1;
        uint32_t PAD_P3_STS_2: 1;
        uint32_t PAD_P3_STS_3: 1;
        uint32_t PAD_P3_STS_4: 1;
        uint32_t PAD_P3_STS_5: 1;
        uint32_t PAD_P3_STS_6: 1;
        uint32_t PAD_P4_STS_0: 1;
        uint32_t PAD_P4_STS_1: 1;
        uint32_t PAD_P4_STS_2: 1;
        uint32_t PAD_P4_STS_3: 1;
        uint32_t PAD_P4_0_CFG: 2;
        uint32_t PAD_P4_1_CFG: 1;
        uint32_t PAD_P4_2_CFG: 1;
        uint32_t PAD_P4_0_O_EN: 1;
        uint32_t PAD_P4_2_O_EN: 1;
        uint32_t RESERVED_2: 1;
        uint32_t PAD_P5_STS_1: 1;
        uint32_t PAD_P5_STS_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t PAD_P6_STS_0: 1;
        uint32_t PAD_P6_STS_1: 1;
        uint32_t PAD_P6_STS_2: 1;
        uint32_t PAD_P6_STS_3: 1;
        uint32_t PAD_P6_STS_4: 1;
        uint32_t PAD_P6_STS_5: 1;
        uint32_t PAD_P6_STS_6: 1;
        uint32_t PAD_P6_STS_7: 1;
        uint32_t RESERVED: 3;
    };
} AON_REG_PAD_REG24X_TYPE;

/*0x4000_0180 AON_REG_PAD_REG24X*/
#define AON_REG_PAD_REG24X_PAD_P3_STS_0_Pos                                                                              0U
#define AON_REG_PAD_REG24X_PAD_P3_STS_0_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P3_STS_0_Pos)

#define AON_REG_PAD_REG24X_PAD_P3_STS_1_Pos                                                                              1U
#define AON_REG_PAD_REG24X_PAD_P3_STS_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P3_STS_1_Pos)

#define AON_REG_PAD_REG24X_PAD_P3_STS_2_Pos                                                                              2U
#define AON_REG_PAD_REG24X_PAD_P3_STS_2_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P3_STS_2_Pos)

#define AON_REG_PAD_REG24X_PAD_P3_STS_3_Pos                                                                              3U
#define AON_REG_PAD_REG24X_PAD_P3_STS_3_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P3_STS_3_Pos)

#define AON_REG_PAD_REG24X_PAD_P3_STS_4_Pos                                                                              4U
#define AON_REG_PAD_REG24X_PAD_P3_STS_4_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P3_STS_4_Pos)

#define AON_REG_PAD_REG24X_PAD_P3_STS_5_Pos                                                                              5U
#define AON_REG_PAD_REG24X_PAD_P3_STS_5_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P3_STS_5_Pos)

#define AON_REG_PAD_REG24X_PAD_P3_STS_6_Pos                                                                              6U
#define AON_REG_PAD_REG24X_PAD_P3_STS_6_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P3_STS_6_Pos)

