rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG24X_PAD_P4_STS_0_Pos                                                                              7U
#define AON_REG_PAD_REG24X_PAD_P4_STS_0_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P4_STS_0_Pos)

#define AON_REG_PAD_REG24X_PAD_P4_STS_1_Pos                                                                              8U
#define AON_REG_PAD_REG24X_PAD_P4_STS_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P4_STS_1_Pos)

#define AON_REG_PAD_REG24X_PAD_P4_STS_2_Pos                                                                              9U
#define AON_REG_PAD_REG24X_PAD_P4_STS_2_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P4_STS_2_Pos)

#define AON_REG_PAD_REG24X_PAD_P4_STS_3_Pos                                                                              10U
#define AON_REG_PAD_REG24X_PAD_P4_STS_3_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P4_STS_3_Pos)

#define AON_REG_PAD_REG24X_PAD_P4_0_CFG_Pos                                                                              11U
#define AON_REG_PAD_REG24X_PAD_P4_0_CFG_Msk                                                                              (0x3UL << AON_REG_PAD_REG24X_PAD_P4_0_CFG_Pos)

#define AON_REG_PAD_REG24X_PAD_P4_1_CFG_Pos                                                                              13U
#define AON_REG_PAD_REG24X_PAD_P4_1_CFG_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P4_1_CFG_Pos)

#define AON_REG_PAD_REG24X_PAD_P4_2_CFG_Pos                                                                              14U
#define AON_REG_PAD_REG24X_PAD_P4_2_CFG_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P4_2_CFG_Pos)

#define AON_REG_PAD_REG24X_PAD_P4_0_O_EN_Pos                                                                             15U
#define AON_REG_PAD_REG24X_PAD_P4_0_O_EN_Msk                                                                             (0x1UL << AON_REG_PAD_REG24X_PAD_P4_0_O_EN_Pos)

#define AON_REG_PAD_REG24X_PAD_P4_2_O_EN_Pos                                                                             16U
#define AON_REG_PAD_REG24X_PAD_P4_2_O_EN_Msk                                                                             (0x1UL << AON_REG_PAD_REG24X_PAD_P4_2_O_EN_Pos)

#define AON_REG_PAD_REG24X_RESERVED_2_Pos                                                                                17U
#define AON_REG_PAD_REG24X_RESERVED_2_Msk                                                                                (0x1UL << AON_REG_PAD_REG24X_RESERVED_2_Pos)

#define AON_REG_PAD_REG24X_PAD_P5_STS_1_Pos                                                                              18U
#define AON_REG_PAD_REG24X_PAD_P5_STS_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P5_STS_1_Pos)

#define AON_REG_PAD_REG24X_PAD_P5_STS_2_Pos                                                                              19U
#define AON_REG_PAD_REG24X_PAD_P5_STS_2_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P5_STS_2_Pos)

#define AON_REG_PAD_REG24X_RESERVED_1_Pos                                                                                20U
#define AON_REG_PAD_REG24X_RESERVED_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG24X_RESERVED_1_Pos)

#define AON_REG_PAD_REG24X_PAD_P6_STS_0_Pos                                                                              21U
#define AON_REG_PAD_REG24X_PAD_P6_STS_0_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P6_STS_0_Pos)

#define AON_REG_PAD_REG24X_PAD_P6_STS_1_Pos                                                                              22U
#define AON_REG_PAD_REG24X_PAD_P6_STS_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P6_STS_1_Pos)

#define AON_REG_PAD_REG24X_PAD_P6_STS_2_Pos                                                                              23U
#define AON_REG_PAD_REG24X_PAD_P6_STS_2_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P6_STS_2_Pos)

#define AON_REG_PAD_REG24X_PAD_P6_STS_3_Pos                                                                              24U
#define AON_REG_PAD_REG24X_PAD_P6_STS_3_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P6_STS_3_Pos)

#define AON_REG_PAD_REG24X_PAD_P6_STS_4_Pos                                                                              25U
#define AON_REG_PAD_REG24X_PAD_P6_STS_4_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P6_STS_4_Pos)

#define AON_REG_PAD_REG24X_PAD_P6_STS_5_Pos                                                                              26U
#define AON_REG_PAD_REG24X_PAD_P6_STS_5_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P6_STS_5_Pos)

#define AON_REG_PAD_REG24X_PAD_P6_STS_6_Pos                                                                              27U
#define AON_REG_PAD_REG24X_PAD_P6_STS_6_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P6_STS_6_Pos)

#define AON_REG_PAD_REG24X_PAD_P6_STS_7_Pos                                                                              28U
#define AON_REG_PAD_REG24X_PAD_P6_STS_7_Msk                                                                              (0x1UL << AON_REG_PAD_REG24X_PAD_P6_STS_7_Pos)

