rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG24X_RESERVED_Pos                                                                                  29U
#define AON_REG_PAD_REG24X_RESERVED_Msk                                                                                  (0x7UL << AON_REG_PAD_REG24X_RESERVED_Pos)

/* 0x184    0x4000_0184
    21:0    R/W     RESERVED_6                                                  22'b0
    22      R/W     RESERVED_5                                                  1'b1
    23      R/W     RESERVED_4                                                  1'b1
    24      R/W     RESERVED_3                                                  1'b1
    25      R/W     RESERVED_2                                                  1'b1
    26      R/W     RESERVED_1                                                  1'b1
    27      W1C     PAD_P7_STS_0                                                1'b1
    28      W1C     PAD_P7_STS_1                                                1'b1
    29      R       RESERVED                                                    1'b0
    30      W1C     PAD_MICBIAS_STS                                             1'b1
    31      R/W     PAD_MICBIAS_CFG                                             1'b0
 */
typedef union _AON_REG_PAD_REG25X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_6: 22;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t PAD_P7_STS_0: 1;
        uint32_t PAD_P7_STS_1: 1;
        uint32_t RESERVED: 1;
        uint32_t PAD_MICBIAS_STS: 1;
        uint32_t PAD_MICBIAS_CFG: 1;
    };
} AON_REG_PAD_REG25X_TYPE;

/*0x4000_0184 AON_REG_PAD_REG25X*/
#define AON_REG_PAD_REG25X_RESERVED_6_Pos                                                                                0U
#define AON_REG_PAD_REG25X_RESERVED_6_Msk                                                                                (0x3FFFFFUL << AON_REG_PAD_REG25X_RESERVED_6_Pos)

#define AON_REG_PAD_REG25X_RESERVED_5_Pos                                                                                22U
#define AON_REG_PAD_REG25X_RESERVED_5_Msk                                                                                (0x1UL << AON_REG_PAD_REG25X_RESERVED_5_Pos)

#define AON_REG_PAD_REG25X_RESERVED_4_Pos                                                                                23U
#define AON_REG_PAD_REG25X_RESERVED_4_Msk                                                                                (0x1UL << AON_REG_PAD_REG25X_RESERVED_4_Pos)

#define AON_REG_PAD_REG25X_RESERVED_3_Pos                                                                                24U
#define AON_REG_PAD_REG25X_RESERVED_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG25X_RESERVED_3_Pos)

#define AON_REG_PAD_REG25X_RESERVED_2_Pos                                                                                25U
#define AON_REG_PAD_REG25X_RESERVED_2_Msk                                                                                (0x1UL << AON_REG_PAD_REG25X_RESERVED_2_Pos)

#define AON_REG_PAD_REG25X_RESERVED_1_Pos                                                                                26U
#define AON_REG_PAD_REG25X_RESERVED_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG25X_RESERVED_1_Pos)

#define AON_REG_PAD_REG25X_PAD_P7_STS_0_Pos                                                                              27U
#define AON_REG_PAD_REG25X_PAD_P7_STS_0_Msk                                                                              (0x1UL << AON_REG_PAD_REG25X_PAD_P7_STS_0_Pos)

#define AON_REG_PAD_REG25X_PAD_P7_STS_1_Pos                                                                              28U
#define AON_REG_PAD_REG25X_PAD_P7_STS_1_Msk                                                                              (0x1UL << AON_REG_PAD_REG25X_PAD_P7_STS_1_Pos)

#define AON_REG_PAD_REG25X_RESERVED_Pos                                                                                  29U
#define AON_REG_PAD_REG25X_RESERVED_Msk                                                                                  (0x1UL << AON_REG_PAD_REG25X_RESERVED_Pos)

#define AON_REG_PAD_REG25X_PAD_MICBIAS_STS_Pos                                                                           30U
#define AON_REG_PAD_REG25X_PAD_MICBIAS_STS_Msk                                                                           (0x1UL << AON_REG_PAD_REG25X_PAD_MICBIAS_STS_Pos)

#define AON_REG_PAD_REG25X_PAD_MICBIAS_CFG_Pos                                                                           31U
#define AON_REG_PAD_REG25X_PAD_MICBIAS_CFG_Msk                                                                           (0x1UL << AON_REG_PAD_REG25X_PAD_MICBIAS_CFG_Pos)

/* 0x188    0x4000_0188
    19:0    R/W     RESERVED_3                                                  20'h0
    20      R/W     RESERVED_2                                                  1'b1
    21      R/W     RESERVED_1                                                  1'b1
    22      R/W     RESERVED                                                    1'b1
    23      R/W     RIGHT_PAD_SMT                                               1'b0
    24      R/W     RIGHT_PAD_H3L1                                              1'b0
    25      R/W     RIGHT_PAD_E2                                                1'b1
    26      R/W     BOTTOM_PAD_SMT                                              1'b0
    27      R/W     BOTTOM_PAD_H3L1                                             1'b0
    28      R/W     BOTTOM_PAD_E2                                               1'b1
    29      R/W     LEFT_PAD_SMT                                                1'b0
    30      R/W     LEFT_PAD_H3L1                                               1'b0
    31      R/W     LEFT_PAD_E2                                                 1'b1
 */
typedef union _AON_REG_PAD_REG26X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_3: 20;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t RIGHT_PAD_SMT: 1;
        uint32_t RIGHT_PAD_H3L1: 1;
        uint32_t RIGHT_PAD_E2: 1;
        uint32_t BOTTOM_PAD_SMT: 1;
        uint32_t BOTTOM_PAD_H3L1: 1;
        uint32_t BOTTOM_PAD_E2: 1;
        uint32_t LEFT_PAD_SMT: 1;
        uint32_t LEFT_PAD_H3L1: 1;
        uint32_t LEFT_PAD_E2: 1;
    };
} AON_REG_PAD_REG26X_TYPE;

/*0x4000_0188 AON_REG_PAD_REG26X*/
#define AON_REG_PAD_REG26X_RESERVED_3_Pos                                                                                0U
#define AON_REG_PAD_REG26X_RESERVED_3_Msk                                                                                (0xFFFFFUL << AON_REG_PAD_REG26X_RESERVED_3_Pos)

#define AON_REG_PAD_REG26X_RESERVED_2_Pos                                                                                20U
#define AON_REG_PAD_REG26X_RESERVED_2_Msk                                                                                (0x1UL << AON_REG_PAD_REG26X_RESERVED_2_Pos)

#define AON_REG_PAD_REG26X_RESERVED_1_Pos                                                                                21U
#define AON_REG_PAD_REG26X_RESERVED_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG26X_RESERVED_1_Pos)

#define AON_REG_PAD_REG26X_RESERVED_Pos                                                                                  22U
#define AON_REG_PAD_REG26X_RESERVED_Msk                                                                                  (0x1UL << AON_REG_PAD_REG26X_RESERVED_Pos)

