rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG26X_RIGHT_PAD_SMT_Pos                                                                             23U
#define AON_REG_PAD_REG26X_RIGHT_PAD_SMT_Msk                                                                             (0x1UL << AON_REG_PAD_REG26X_RIGHT_PAD_SMT_Pos)

#define AON_REG_PAD_REG26X_RIGHT_PAD_H3L1_Pos                                                                            24U
#define AON_REG_PAD_REG26X_RIGHT_PAD_H3L1_Msk                                                                            (0x1UL << AON_REG_PAD_REG26X_RIGHT_PAD_H3L1_Pos)

#define AON_REG_PAD_REG26X_RIGHT_PAD_E2_Pos                                                                              25U
#define AON_REG_PAD_REG26X_RIGHT_PAD_E2_Msk                                                                              (0x1UL << AON_REG_PAD_REG26X_RIGHT_PAD_E2_Pos)

#define AON_REG_PAD_REG26X_BOTTOM_PAD_SMT_Pos                                                                            26U
#define AON_REG_PAD_REG26X_BOTTOM_PAD_SMT_Msk                                                                            (0x1UL << AON_REG_PAD_REG26X_BOTTOM_PAD_SMT_Pos)

#define AON_REG_PAD_REG26X_BOTTOM_PAD_H3L1_Pos                                                                           27U
#define AON_REG_PAD_REG26X_BOTTOM_PAD_H3L1_Msk                                                                           (0x1UL << AON_REG_PAD_REG26X_BOTTOM_PAD_H3L1_Pos)

#define AON_REG_PAD_REG26X_BOTTOM_PAD_E2_Pos                                                                             28U
#define AON_REG_PAD_REG26X_BOTTOM_PAD_E2_Msk                                                                             (0x1UL << AON_REG_PAD_REG26X_BOTTOM_PAD_E2_Pos)

#define AON_REG_PAD_REG26X_LEFT_PAD_SMT_Pos                                                                              29U
#define AON_REG_PAD_REG26X_LEFT_PAD_SMT_Msk                                                                              (0x1UL << AON_REG_PAD_REG26X_LEFT_PAD_SMT_Pos)

#define AON_REG_PAD_REG26X_LEFT_PAD_H3L1_Pos                                                                             30U
#define AON_REG_PAD_REG26X_LEFT_PAD_H3L1_Msk                                                                             (0x1UL << AON_REG_PAD_REG26X_LEFT_PAD_H3L1_Pos)

#define AON_REG_PAD_REG26X_LEFT_PAD_E2_Pos                                                                               31U
#define AON_REG_PAD_REG26X_LEFT_PAD_E2_Msk                                                                               (0x1UL << AON_REG_PAD_REG26X_LEFT_PAD_E2_Pos)

/* 0x18C    0x4000_018c
    0       R/W     PAD_SPIC_SCK_O                                              1'b0
    1       R/W     PAD_SPIC_SCK_E                                              1'b0
    2       R/W     PAD_SPIC_SCK_PU_EN                                          1'b1
    3       R/W     AON_PAD_SPIC_SCK_PD                                         1'b0
    4       R/W     PAD_SPIC_SCK_PUPDC                                          1'b0
    5       R/W     PAD_SPIC_SCK_WKEN                                           1'b0
    6       R/W     PAD_SPIC_SCK_WKPOL                                          1'b0
    7       R/W     PAD_SPIC_SCK_SHDN                                           1'b1
    8       R/W     PAD_SPIC_SCK_DEB                                            1'b0
    9       R/W     PAD_SPIC_SCK_RAP_WKEN                                       1'b0
    10      R/W     PAD_SPIC_SCK_PPU_WKEN                                       1'b0
    11      R/W     RESERVED_3                                                  1'b0
    13:12   R       RESERVED_2                                                  2'b00
    15:14   R/W     PAD_SPIC_SCK_AON_MUX                                        2'b00
    16      R/W     PAD_SPIC_CSN_O                                              1'b0
    17      R/W     PAD_SPIC_CSN_E                                              1'b0
    18      R/W     PAD_SPIC_CSN_PU_EN                                          1'b1
    19      R/W     AON_PAD_SPIC_CSN_PD                                         1'b0
    20      R/W     PAD_SPIC_CSN_PUPDC                                          1'b0
    21      R/W     PAD_SPIC_CSN_WKEN                                           1'b0
    22      R/W     PAD_SPIC_CSN_WKPOL                                          1'b0
    23      R/W     PAD_SPIC_CSN_SHDN                                           1'b1
    24      R/W     PAD_SPIC_CSN_DEB                                            1'b0
    25      R/W     PAD_SPIC_CSN_RAP_WKEN                                       1'b0
    26      R/W     PAD_SPIC_CSN_PPU_WKEN                                       1'b0
    27      R/W     RESERVED_1                                                  1'b0
    29:28   R       RESERVED                                                    2'b00
    31:30   R/W     PAD_SPIC_CSN_AON_MUX                                        2'b00
 */
typedef union _AON_REG_PAD_REG27X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_SPIC_SCK_O: 1;
        uint32_t PAD_SPIC_SCK_E: 1;
        uint32_t PAD_SPIC_SCK_PU_EN: 1;
        uint32_t AON_PAD_SPIC_SCK_PD: 1;
        uint32_t PAD_SPIC_SCK_PUPDC: 1;
        uint32_t PAD_SPIC_SCK_WKEN: 1;
        uint32_t PAD_SPIC_SCK_WKPOL: 1;
        uint32_t PAD_SPIC_SCK_SHDN: 1;
        uint32_t PAD_SPIC_SCK_DEB: 1;
        uint32_t PAD_SPIC_SCK_RAP_WKEN: 1;
        uint32_t PAD_SPIC_SCK_PPU_WKEN: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t PAD_SPIC_SCK_AON_MUX: 2;
        uint32_t PAD_SPIC_CSN_O: 1;
        uint32_t PAD_SPIC_CSN_E: 1;
        uint32_t PAD_SPIC_CSN_PU_EN: 1;
        uint32_t AON_PAD_SPIC_CSN_PD: 1;
        uint32_t PAD_SPIC_CSN_PUPDC: 1;
        uint32_t PAD_SPIC_CSN_WKEN: 1;
        uint32_t PAD_SPIC_CSN_WKPOL: 1;
        uint32_t PAD_SPIC_CSN_SHDN: 1;
        uint32_t PAD_SPIC_CSN_DEB: 1;
        uint32_t PAD_SPIC_CSN_RAP_WKEN: 1;
        uint32_t PAD_SPIC_CSN_PPU_WKEN: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t PAD_SPIC_CSN_AON_MUX: 2;
    };
} AON_REG_PAD_REG27X_TYPE;

