rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_018c AON_REG_PAD_REG27X*/
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_O_Pos                                                                            0U
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_O_Msk                                                                            (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_SCK_O_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_E_Pos                                                                            1U
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_E_Msk                                                                            (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_SCK_E_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_PU_EN_Pos                                                                        2U
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_PU_EN_Msk                                                                        (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_SCK_PU_EN_Pos)

#define AON_REG_PAD_REG27X_AON_PAD_SPIC_SCK_PD_Pos                                                                       3U
#define AON_REG_PAD_REG27X_AON_PAD_SPIC_SCK_PD_Msk                                                                       (0x1UL << AON_REG_PAD_REG27X_AON_PAD_SPIC_SCK_PD_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_PUPDC_Pos                                                                        4U
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_PUPDC_Msk                                                                        (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_SCK_PUPDC_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_WKEN_Pos                                                                         5U
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_WKEN_Msk                                                                         (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_SCK_WKEN_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_WKPOL_Pos                                                                        6U
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_WKPOL_Msk                                                                        (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_SCK_WKPOL_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_SHDN_Pos                                                                         7U
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_SHDN_Msk                                                                         (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_SCK_SHDN_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_DEB_Pos                                                                          8U
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_DEB_Msk                                                                          (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_SCK_DEB_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_RAP_WKEN_Pos                                                                     9U
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_RAP_WKEN_Msk                                                                     (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_SCK_RAP_WKEN_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_PPU_WKEN_Pos                                                                     10U
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_PPU_WKEN_Msk                                                                     (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_SCK_PPU_WKEN_Pos)

#define AON_REG_PAD_REG27X_RESERVED_3_Pos                                                                                11U
#define AON_REG_PAD_REG27X_RESERVED_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG27X_RESERVED_3_Pos)

#define AON_REG_PAD_REG27X_RESERVED_2_Pos                                                                                12U
#define AON_REG_PAD_REG27X_RESERVED_2_Msk                                                                                (0x3UL << AON_REG_PAD_REG27X_RESERVED_2_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_AON_MUX_Pos                                                                      14U
#define AON_REG_PAD_REG27X_PAD_SPIC_SCK_AON_MUX_Msk                                                                      (0x3UL << AON_REG_PAD_REG27X_PAD_SPIC_SCK_AON_MUX_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_O_Pos                                                                            16U
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_O_Msk                                                                            (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_CSN_O_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_E_Pos                                                                            17U
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_E_Msk                                                                            (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_CSN_E_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_PU_EN_Pos                                                                        18U
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_PU_EN_Msk                                                                        (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_CSN_PU_EN_Pos)

#define AON_REG_PAD_REG27X_AON_PAD_SPIC_CSN_PD_Pos                                                                       19U
#define AON_REG_PAD_REG27X_AON_PAD_SPIC_CSN_PD_Msk                                                                       (0x1UL << AON_REG_PAD_REG27X_AON_PAD_SPIC_CSN_PD_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_PUPDC_Pos                                                                        20U
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_PUPDC_Msk                                                                        (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_CSN_PUPDC_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_WKEN_Pos                                                                         21U
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_WKEN_Msk                                                                         (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_CSN_WKEN_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_WKPOL_Pos                                                                        22U
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_WKPOL_Msk                                                                        (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_CSN_WKPOL_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_SHDN_Pos                                                                         23U
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_SHDN_Msk                                                                         (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_CSN_SHDN_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_DEB_Pos                                                                          24U
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_DEB_Msk                                                                          (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_CSN_DEB_Pos)

