rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_RAP_WKEN_Pos                                                                     25U
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_RAP_WKEN_Msk                                                                     (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_CSN_RAP_WKEN_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_PPU_WKEN_Pos                                                                     26U
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_PPU_WKEN_Msk                                                                     (0x1UL << AON_REG_PAD_REG27X_PAD_SPIC_CSN_PPU_WKEN_Pos)

#define AON_REG_PAD_REG27X_RESERVED_1_Pos                                                                                27U
#define AON_REG_PAD_REG27X_RESERVED_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG27X_RESERVED_1_Pos)

#define AON_REG_PAD_REG27X_RESERVED_Pos                                                                                  28U
#define AON_REG_PAD_REG27X_RESERVED_Msk                                                                                  (0x3UL << AON_REG_PAD_REG27X_RESERVED_Pos)

#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_AON_MUX_Pos                                                                      30U
#define AON_REG_PAD_REG27X_PAD_SPIC_CSN_AON_MUX_Msk                                                                      (0x3UL << AON_REG_PAD_REG27X_PAD_SPIC_CSN_AON_MUX_Pos)

/* 0x190    0x4000_0190
    0       R/W     PAD_SPIC_SO_O                                               1'b0
    1       R/W     PAD_SPIC_SO_E                                               1'b0
    2       R/W     PAD_SPIC_SO_PU_EN                                           1'b1
    3       R/W     AON_PAD_SPIC_SO_PD                                          1'b1
    4       R/W     PAD_SPIC_SO_PUPDC                                           1'b0
    5       R/W     PAD_SPIC_SO_WKEN                                            1'b0
    6       R/W     PAD_SPIC_SO_WKPOL                                           1'b0
    7       R/W     PAD_SPIC_SO_SHDN                                            1'b1
    8       R/W     PAD_SPIC_SO_DEB                                             1'b0
    9       R/W     PAD_SPIC_SO_RAP_WKEN                                        1'b0
    10      R/W     PAD_SPIC_SO_PPU_WKEN                                        1'b0
    11      R/W     RESERVED_3                                                  1'b0
    13:12   R       RESERVED_2                                                  2'b00
    15:14   R/W     PAD_SPIC_SO_AON_MUX                                         2'b00
    16      R/W     PAD_SPIC_SI_O                                               1'b0
    17      R/W     PAD_SPIC_SI_E                                               1'b0
    18      R/W     PAD_SPIC_SI_PU_EN                                           1'b1
    19      R/W     AON_PAD_SPIC_SI_PD                                          1'b1
    20      R/W     PAD_SPIC_SI_PUPDC                                           1'b0
    21      R/W     PAD_SPIC_SI_WKEN                                            1'b0
    22      R/W     PAD_SPIC_SI_WKPOL                                           1'b0
    23      R/W     PAD_SPIC_SI_SHDN                                            1'b1
    24      R/W     PAD_SPIC_SI_DEB                                             1'b0
    25      R/W     PAD_SPIC_SI_RAP_WKEN                                        1'b0
    26      R/W     PAD_SPIC_SI_PPU_WKEN                                        1'b0
    27      R/W     RESERVED_1                                                  1'b0
    29:28   R       RESERVED                                                    2'b00
    31:30   R/W     PAD_SPIC_SI_AON_MUX                                         2'b00
 */
typedef union _AON_REG_PAD_REG28X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_SPIC_SO_O: 1;
        uint32_t PAD_SPIC_SO_E: 1;
        uint32_t PAD_SPIC_SO_PU_EN: 1;
        uint32_t AON_PAD_SPIC_SO_PD: 1;
        uint32_t PAD_SPIC_SO_PUPDC: 1;
        uint32_t PAD_SPIC_SO_WKEN: 1;
        uint32_t PAD_SPIC_SO_WKPOL: 1;
        uint32_t PAD_SPIC_SO_SHDN: 1;
        uint32_t PAD_SPIC_SO_DEB: 1;
        uint32_t PAD_SPIC_SO_RAP_WKEN: 1;
        uint32_t PAD_SPIC_SO_PPU_WKEN: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t PAD_SPIC_SO_AON_MUX: 2;
        uint32_t PAD_SPIC_SI_O: 1;
        uint32_t PAD_SPIC_SI_E: 1;
        uint32_t PAD_SPIC_SI_PU_EN: 1;
        uint32_t AON_PAD_SPIC_SI_PD: 1;
        uint32_t PAD_SPIC_SI_PUPDC: 1;
        uint32_t PAD_SPIC_SI_WKEN: 1;
        uint32_t PAD_SPIC_SI_WKPOL: 1;
        uint32_t PAD_SPIC_SI_SHDN: 1;
        uint32_t PAD_SPIC_SI_DEB: 1;
        uint32_t PAD_SPIC_SI_RAP_WKEN: 1;
        uint32_t PAD_SPIC_SI_PPU_WKEN: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t PAD_SPIC_SI_AON_MUX: 2;
    };
} AON_REG_PAD_REG28X_TYPE;

/*0x4000_0190 AON_REG_PAD_REG28X*/
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_O_Pos                                                                             0U
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_O_Msk                                                                             (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SO_O_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SO_E_Pos                                                                             1U
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_E_Msk                                                                             (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SO_E_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SO_PU_EN_Pos                                                                         2U
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_PU_EN_Msk                                                                         (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SO_PU_EN_Pos)

#define AON_REG_PAD_REG28X_AON_PAD_SPIC_SO_PD_Pos                                                                        3U
#define AON_REG_PAD_REG28X_AON_PAD_SPIC_SO_PD_Msk                                                                        (0x1UL << AON_REG_PAD_REG28X_AON_PAD_SPIC_SO_PD_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SO_PUPDC_Pos                                                                         4U
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_PUPDC_Msk                                                                         (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SO_PUPDC_Pos)

