rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_WKEN_Pos                                                                          5U
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_WKEN_Msk                                                                          (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SO_WKEN_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SO_WKPOL_Pos                                                                         6U
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_WKPOL_Msk                                                                         (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SO_WKPOL_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SO_SHDN_Pos                                                                          7U
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_SHDN_Msk                                                                          (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SO_SHDN_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SO_DEB_Pos                                                                           8U
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_DEB_Msk                                                                           (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SO_DEB_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SO_RAP_WKEN_Pos                                                                      9U
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_RAP_WKEN_Msk                                                                      (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SO_RAP_WKEN_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SO_PPU_WKEN_Pos                                                                      10U
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_PPU_WKEN_Msk                                                                      (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SO_PPU_WKEN_Pos)

#define AON_REG_PAD_REG28X_RESERVED_3_Pos                                                                                11U
#define AON_REG_PAD_REG28X_RESERVED_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG28X_RESERVED_3_Pos)

#define AON_REG_PAD_REG28X_RESERVED_2_Pos                                                                                12U
#define AON_REG_PAD_REG28X_RESERVED_2_Msk                                                                                (0x3UL << AON_REG_PAD_REG28X_RESERVED_2_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SO_AON_MUX_Pos                                                                       14U
#define AON_REG_PAD_REG28X_PAD_SPIC_SO_AON_MUX_Msk                                                                       (0x3UL << AON_REG_PAD_REG28X_PAD_SPIC_SO_AON_MUX_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SI_O_Pos                                                                             16U
#define AON_REG_PAD_REG28X_PAD_SPIC_SI_O_Msk                                                                             (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SI_O_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SI_E_Pos                                                                             17U
#define AON_REG_PAD_REG28X_PAD_SPIC_SI_E_Msk                                                                             (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SI_E_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SI_PU_EN_Pos                                                                         18U
#define AON_REG_PAD_REG28X_PAD_SPIC_SI_PU_EN_Msk                                                                         (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SI_PU_EN_Pos)

#define AON_REG_PAD_REG28X_AON_PAD_SPIC_SI_PD_Pos                                                                        19U
#define AON_REG_PAD_REG28X_AON_PAD_SPIC_SI_PD_Msk                                                                        (0x1UL << AON_REG_PAD_REG28X_AON_PAD_SPIC_SI_PD_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SI_PUPDC_Pos                                                                         20U
#define AON_REG_PAD_REG28X_PAD_SPIC_SI_PUPDC_Msk                                                                         (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SI_PUPDC_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SI_WKEN_Pos                                                                          21U
#define AON_REG_PAD_REG28X_PAD_SPIC_SI_WKEN_Msk                                                                          (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SI_WKEN_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SI_WKPOL_Pos                                                                         22U
#define AON_REG_PAD_REG28X_PAD_SPIC_SI_WKPOL_Msk                                                                         (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SI_WKPOL_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SI_SHDN_Pos                                                                          23U
#define AON_REG_PAD_REG28X_PAD_SPIC_SI_SHDN_Msk                                                                          (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SI_SHDN_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SI_DEB_Pos                                                                           24U
#define AON_REG_PAD_REG28X_PAD_SPIC_SI_DEB_Msk                                                                           (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SI_DEB_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SI_RAP_WKEN_Pos                                                                      25U
#define AON_REG_PAD_REG28X_PAD_SPIC_SI_RAP_WKEN_Msk                                                                      (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SI_RAP_WKEN_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SI_PPU_WKEN_Pos                                                                      26U
#define AON_REG_PAD_REG28X_PAD_SPIC_SI_PPU_WKEN_Msk                                                                      (0x1UL << AON_REG_PAD_REG28X_PAD_SPIC_SI_PPU_WKEN_Pos)

#define AON_REG_PAD_REG28X_RESERVED_1_Pos                                                                                27U
#define AON_REG_PAD_REG28X_RESERVED_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG28X_RESERVED_1_Pos)

#define AON_REG_PAD_REG28X_RESERVED_Pos                                                                                  28U
#define AON_REG_PAD_REG28X_RESERVED_Msk                                                                                  (0x3UL << AON_REG_PAD_REG28X_RESERVED_Pos)

#define AON_REG_PAD_REG28X_PAD_SPIC_SI_AON_MUX_Pos                                                                       30U
#define AON_REG_PAD_REG28X_PAD_SPIC_SI_AON_MUX_Msk                                                                       (0x3UL << AON_REG_PAD_REG28X_PAD_SPIC_SI_AON_MUX_Pos)

/* 0x194    0x4000_0194
    0       R/W     PAD_P1_O_3                                                  1'b0
    1       R/W     PAD_P1_E_3                                                  1'b0
    2       R/W     PAD_P1_PU_EN_3                                              1'b1
    3       R/W     AON_PAD_P1_PD_3                                             1'b1
    4       R/W     PAD_P1_PUPDC_3                                              1'b0
    5       R/W     PAD_P1_WKEN_3                                               1'b0
    6       R/W     PAD_P1_WKPOL_3                                              1'b0
    7       R/W     PAD_P1_SHDN_3                                               1'b1
    8       R/W     PAD_P1_DEB_3                                                1'b0
    9       R/W     PAD_P1_RAP_WKEN_3                                           1'b0
    10      R/W     PAD_P1_PPU_WKEN_3                                           1'b0
    11      R/W     RESERVED_3                                                  1'b0
    13:12   R       RESERVED_2                                                  2'b00
    15:14   R/W     PAD_P1_AON_MUX_3                                            2'b00
    16      R/W     PAD_P1_O_4                                                  1'b0
    17      R/W     PAD_P1_E_4                                                  1'b0
    18      R/W     PAD_P1_PU_EN_4                                              1'b1
    19      R/W     AON_PAD_P1_PD_4                                             1'b1
    20      R/W     PAD_P1_PUPDC_4                                              1'b0
    21      R/W     PAD_P1_WKEN_4                                               1'b0
    22      R/W     PAD_P1_WKPOL_4                                              1'b0
    23      R/W     PAD_P1_SHDN_4                                               1'b1
    24      R/W     PAD_P1_DEB_4                                                1'b0
    25      R/W     PAD_P1_RAP_WKEN_4                                           1'b0
    26      R/W     PAD_P1_PPU_WKEN_4                                           1'b0
    27      R/W     RESERVED_1                                                  1'b0
    29:28   R       RESERVED                                                    2'b00
    31:30   R/W     PAD_P1_AON_MUX_4                                            2'b00
 */
typedef union _AON_REG_PAD_REG29X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAD_P1_O_3: 1;
        uint32_t PAD_P1_E_3: 1;
        uint32_t PAD_P1_PU_EN_3: 1;
        uint32_t AON_PAD_P1_PD_3: 1;
        uint32_t PAD_P1_PUPDC_3: 1;
        uint32_t PAD_P1_WKEN_3: 1;
        uint32_t PAD_P1_WKPOL_3: 1;
        uint32_t PAD_P1_SHDN_3: 1;
        uint32_t PAD_P1_DEB_3: 1;
        uint32_t PAD_P1_RAP_WKEN_3: 1;
        uint32_t PAD_P1_PPU_WKEN_3: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 2;
        uint32_t PAD_P1_AON_MUX_3: 2;
        uint32_t PAD_P1_O_4: 1;
        uint32_t PAD_P1_E_4: 1;
        uint32_t PAD_P1_PU_EN_4: 1;
        uint32_t AON_PAD_P1_PD_4: 1;
        uint32_t PAD_P1_PUPDC_4: 1;
        uint32_t PAD_P1_WKEN_4: 1;
        uint32_t PAD_P1_WKPOL_4: 1;
        uint32_t PAD_P1_SHDN_4: 1;
        uint32_t PAD_P1_DEB_4: 1;
        uint32_t PAD_P1_RAP_WKEN_4: 1;
        uint32_t PAD_P1_PPU_WKEN_4: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 2;
        uint32_t PAD_P1_AON_MUX_4: 2;
    };
} AON_REG_PAD_REG29X_TYPE;

/*0x4000_0194 AON_REG_PAD_REG29X*/
#define AON_REG_PAD_REG29X_PAD_P1_O_3_Pos                                                                                0U
#define AON_REG_PAD_REG29X_PAD_P1_O_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG29X_PAD_P1_O_3_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_E_3_Pos                                                                                1U
#define AON_REG_PAD_REG29X_PAD_P1_E_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG29X_PAD_P1_E_3_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_PU_EN_3_Pos                                                                            2U
#define AON_REG_PAD_REG29X_PAD_P1_PU_EN_3_Msk                                                                            (0x1UL << AON_REG_PAD_REG29X_PAD_P1_PU_EN_3_Pos)

