rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG29X_AON_PAD_P1_PD_3_Pos                                                                           3U
#define AON_REG_PAD_REG29X_AON_PAD_P1_PD_3_Msk                                                                           (0x1UL << AON_REG_PAD_REG29X_AON_PAD_P1_PD_3_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_PUPDC_3_Pos                                                                            4U
#define AON_REG_PAD_REG29X_PAD_P1_PUPDC_3_Msk                                                                            (0x1UL << AON_REG_PAD_REG29X_PAD_P1_PUPDC_3_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_WKEN_3_Pos                                                                             5U
#define AON_REG_PAD_REG29X_PAD_P1_WKEN_3_Msk                                                                             (0x1UL << AON_REG_PAD_REG29X_PAD_P1_WKEN_3_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_WKPOL_3_Pos                                                                            6U
#define AON_REG_PAD_REG29X_PAD_P1_WKPOL_3_Msk                                                                            (0x1UL << AON_REG_PAD_REG29X_PAD_P1_WKPOL_3_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_SHDN_3_Pos                                                                             7U
#define AON_REG_PAD_REG29X_PAD_P1_SHDN_3_Msk                                                                             (0x1UL << AON_REG_PAD_REG29X_PAD_P1_SHDN_3_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_DEB_3_Pos                                                                              8U
#define AON_REG_PAD_REG29X_PAD_P1_DEB_3_Msk                                                                              (0x1UL << AON_REG_PAD_REG29X_PAD_P1_DEB_3_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_RAP_WKEN_3_Pos                                                                         9U
#define AON_REG_PAD_REG29X_PAD_P1_RAP_WKEN_3_Msk                                                                         (0x1UL << AON_REG_PAD_REG29X_PAD_P1_RAP_WKEN_3_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_PPU_WKEN_3_Pos                                                                         10U
#define AON_REG_PAD_REG29X_PAD_P1_PPU_WKEN_3_Msk                                                                         (0x1UL << AON_REG_PAD_REG29X_PAD_P1_PPU_WKEN_3_Pos)

#define AON_REG_PAD_REG29X_RESERVED_3_Pos                                                                                11U
#define AON_REG_PAD_REG29X_RESERVED_3_Msk                                                                                (0x1UL << AON_REG_PAD_REG29X_RESERVED_3_Pos)

#define AON_REG_PAD_REG29X_RESERVED_2_Pos                                                                                12U
#define AON_REG_PAD_REG29X_RESERVED_2_Msk                                                                                (0x3UL << AON_REG_PAD_REG29X_RESERVED_2_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_AON_MUX_3_Pos                                                                          14U
#define AON_REG_PAD_REG29X_PAD_P1_AON_MUX_3_Msk                                                                          (0x3UL << AON_REG_PAD_REG29X_PAD_P1_AON_MUX_3_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_O_4_Pos                                                                                16U
#define AON_REG_PAD_REG29X_PAD_P1_O_4_Msk                                                                                (0x1UL << AON_REG_PAD_REG29X_PAD_P1_O_4_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_E_4_Pos                                                                                17U
#define AON_REG_PAD_REG29X_PAD_P1_E_4_Msk                                                                                (0x1UL << AON_REG_PAD_REG29X_PAD_P1_E_4_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_PU_EN_4_Pos                                                                            18U
#define AON_REG_PAD_REG29X_PAD_P1_PU_EN_4_Msk                                                                            (0x1UL << AON_REG_PAD_REG29X_PAD_P1_PU_EN_4_Pos)

#define AON_REG_PAD_REG29X_AON_PAD_P1_PD_4_Pos                                                                           19U
#define AON_REG_PAD_REG29X_AON_PAD_P1_PD_4_Msk                                                                           (0x1UL << AON_REG_PAD_REG29X_AON_PAD_P1_PD_4_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_PUPDC_4_Pos                                                                            20U
#define AON_REG_PAD_REG29X_PAD_P1_PUPDC_4_Msk                                                                            (0x1UL << AON_REG_PAD_REG29X_PAD_P1_PUPDC_4_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_WKEN_4_Pos                                                                             21U
#define AON_REG_PAD_REG29X_PAD_P1_WKEN_4_Msk                                                                             (0x1UL << AON_REG_PAD_REG29X_PAD_P1_WKEN_4_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_WKPOL_4_Pos                                                                            22U
#define AON_REG_PAD_REG29X_PAD_P1_WKPOL_4_Msk                                                                            (0x1UL << AON_REG_PAD_REG29X_PAD_P1_WKPOL_4_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_SHDN_4_Pos                                                                             23U
#define AON_REG_PAD_REG29X_PAD_P1_SHDN_4_Msk                                                                             (0x1UL << AON_REG_PAD_REG29X_PAD_P1_SHDN_4_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_DEB_4_Pos                                                                              24U
#define AON_REG_PAD_REG29X_PAD_P1_DEB_4_Msk                                                                              (0x1UL << AON_REG_PAD_REG29X_PAD_P1_DEB_4_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_RAP_WKEN_4_Pos                                                                         25U
#define AON_REG_PAD_REG29X_PAD_P1_RAP_WKEN_4_Msk                                                                         (0x1UL << AON_REG_PAD_REG29X_PAD_P1_RAP_WKEN_4_Pos)

