rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_REG29X_PAD_P1_PPU_WKEN_4_Pos                                                                         26U
#define AON_REG_PAD_REG29X_PAD_P1_PPU_WKEN_4_Msk                                                                         (0x1UL << AON_REG_PAD_REG29X_PAD_P1_PPU_WKEN_4_Pos)

#define AON_REG_PAD_REG29X_RESERVED_1_Pos                                                                                27U
#define AON_REG_PAD_REG29X_RESERVED_1_Msk                                                                                (0x1UL << AON_REG_PAD_REG29X_RESERVED_1_Pos)

#define AON_REG_PAD_REG29X_RESERVED_Pos                                                                                  28U
#define AON_REG_PAD_REG29X_RESERVED_Msk                                                                                  (0x3UL << AON_REG_PAD_REG29X_RESERVED_Pos)

#define AON_REG_PAD_REG29X_PAD_P1_AON_MUX_4_Pos                                                                          30U
#define AON_REG_PAD_REG29X_PAD_P1_AON_MUX_4_Msk                                                                          (0x3UL << AON_REG_PAD_REG29X_PAD_P1_AON_MUX_4_Pos)

/* 0x198    0x4000_0198
    13:0    R       RESERVED_1                                                  14'h0
    14      R/W     SPIC_PAD_SMT                                                1'b0
    15      R/W     SPIC_PAD_H3L1                                               1'b0
    16      R/W     SPIC_PAD_E2                                                 1'b1
    20:17   R       RESERVED                                                    4'h0
    21      R/W     SPI0M_AON_PATH_EN                                           1'b0
    22      R/W     SPI1M_AON_PATH_EN                                           1'b0
    23      R/W     SPI2M_AON_PATH_EN                                           1'b0
    24      R/W     AON_PAD_SPI_FLASH_S                                         1'h1
    25      W1C     PAD_P1_STS_3                                                1'b1
    26      W1C     PAD_P1_STS_4                                                1'b1
    27      W1C     PAD_SPIC_SO_STS                                             1'b1
    28      W1C     PAD_SPIC_SI_STS                                             1'b1
    29      W1C     PAD_SPIC_SCK_STS                                            1'b1
    30      W1C     PAD_SPIC_CSN_STS                                            1'b1
    31      R/W     PAD_SPIC_SCK_O_EN                                           1'b1
 */
typedef union _AON_REG_SPI_PAD_REG30X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_1: 14;
        uint32_t SPIC_PAD_SMT: 1;
        uint32_t SPIC_PAD_H3L1: 1;
        uint32_t SPIC_PAD_E2: 1;
        uint32_t RESERVED: 4;
        uint32_t SPI0M_AON_PATH_EN: 1;
        uint32_t SPI1M_AON_PATH_EN: 1;
        uint32_t SPI2M_AON_PATH_EN: 1;
        uint32_t AON_PAD_SPI_FLASH_S: 1;
        uint32_t PAD_P1_STS_3: 1;
        uint32_t PAD_P1_STS_4: 1;
        uint32_t PAD_SPIC_SO_STS: 1;
        uint32_t PAD_SPIC_SI_STS: 1;
        uint32_t PAD_SPIC_SCK_STS: 1;
        uint32_t PAD_SPIC_CSN_STS: 1;
        uint32_t PAD_SPIC_SCK_O_EN: 1;
    };
} AON_REG_SPI_PAD_REG30X_TYPE;

/*0x4000_0198 AON_REG_SPI_PAD_REG30X*/
#define AON_REG_SPI_PAD_REG30X_RESERVED_1_Pos                                                                            0U
#define AON_REG_SPI_PAD_REG30X_RESERVED_1_Msk                                                                            (0x3FFFUL << AON_REG_SPI_PAD_REG30X_RESERVED_1_Pos)

#define AON_REG_SPI_PAD_REG30X_SPIC_PAD_SMT_Pos                                                                          14U
#define AON_REG_SPI_PAD_REG30X_SPIC_PAD_SMT_Msk                                                                          (0x1UL << AON_REG_SPI_PAD_REG30X_SPIC_PAD_SMT_Pos)

#define AON_REG_SPI_PAD_REG30X_SPIC_PAD_H3L1_Pos                                                                         15U
#define AON_REG_SPI_PAD_REG30X_SPIC_PAD_H3L1_Msk                                                                         (0x1UL << AON_REG_SPI_PAD_REG30X_SPIC_PAD_H3L1_Pos)

#define AON_REG_SPI_PAD_REG30X_SPIC_PAD_E2_Pos                                                                           16U
#define AON_REG_SPI_PAD_REG30X_SPIC_PAD_E2_Msk                                                                           (0x1UL << AON_REG_SPI_PAD_REG30X_SPIC_PAD_E2_Pos)

#define AON_REG_SPI_PAD_REG30X_RESERVED_Pos                                                                              17U
#define AON_REG_SPI_PAD_REG30X_RESERVED_Msk                                                                              (0xFUL << AON_REG_SPI_PAD_REG30X_RESERVED_Pos)

#define AON_REG_SPI_PAD_REG30X_SPI0M_AON_PATH_EN_Pos                                                                     21U
#define AON_REG_SPI_PAD_REG30X_SPI0M_AON_PATH_EN_Msk                                                                     (0x1UL << AON_REG_SPI_PAD_REG30X_SPI0M_AON_PATH_EN_Pos)

#define AON_REG_SPI_PAD_REG30X_SPI1M_AON_PATH_EN_Pos                                                                     22U
#define AON_REG_SPI_PAD_REG30X_SPI1M_AON_PATH_EN_Msk                                                                     (0x1UL << AON_REG_SPI_PAD_REG30X_SPI1M_AON_PATH_EN_Pos)

#define AON_REG_SPI_PAD_REG30X_SPI2M_AON_PATH_EN_Pos                                                                     23U
#define AON_REG_SPI_PAD_REG30X_SPI2M_AON_PATH_EN_Msk                                                                     (0x1UL << AON_REG_SPI_PAD_REG30X_SPI2M_AON_PATH_EN_Pos)

#define AON_REG_SPI_PAD_REG30X_AON_PAD_SPI_FLASH_S_Pos                                                                   24U
#define AON_REG_SPI_PAD_REG30X_AON_PAD_SPI_FLASH_S_Msk                                                                   (0x1UL << AON_REG_SPI_PAD_REG30X_AON_PAD_SPI_FLASH_S_Pos)

#define AON_REG_SPI_PAD_REG30X_PAD_P1_STS_3_Pos                                                                          25U
#define AON_REG_SPI_PAD_REG30X_PAD_P1_STS_3_Msk                                                                          (0x1UL << AON_REG_SPI_PAD_REG30X_PAD_P1_STS_3_Pos)

#define AON_REG_SPI_PAD_REG30X_PAD_P1_STS_4_Pos                                                                          26U
#define AON_REG_SPI_PAD_REG30X_PAD_P1_STS_4_Msk                                                                          (0x1UL << AON_REG_SPI_PAD_REG30X_PAD_P1_STS_4_Pos)

#define AON_REG_SPI_PAD_REG30X_PAD_SPIC_SO_STS_Pos                                                                       27U
#define AON_REG_SPI_PAD_REG30X_PAD_SPIC_SO_STS_Msk                                                                       (0x1UL << AON_REG_SPI_PAD_REG30X_PAD_SPIC_SO_STS_Pos)

#define AON_REG_SPI_PAD_REG30X_PAD_SPIC_SI_STS_Pos                                                                       28U
#define AON_REG_SPI_PAD_REG30X_PAD_SPIC_SI_STS_Msk                                                                       (0x1UL << AON_REG_SPI_PAD_REG30X_PAD_SPIC_SI_STS_Pos)

#define AON_REG_SPI_PAD_REG30X_PAD_SPIC_SCK_STS_Pos                                                                      29U
#define AON_REG_SPI_PAD_REG30X_PAD_SPIC_SCK_STS_Msk                                                                      (0x1UL << AON_REG_SPI_PAD_REG30X_PAD_SPIC_SCK_STS_Pos)

