rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SPI_PAD_REG30X_PAD_SPIC_CSN_STS_Pos                                                                      30U
#define AON_REG_SPI_PAD_REG30X_PAD_SPIC_CSN_STS_Msk                                                                      (0x1UL << AON_REG_SPI_PAD_REG30X_PAD_SPIC_CSN_STS_Pos)

#define AON_REG_SPI_PAD_REG30X_PAD_SPIC_SCK_O_EN_Pos                                                                     31U
#define AON_REG_SPI_PAD_REG30X_PAD_SPIC_SCK_O_EN_Msk                                                                     (0x1UL << AON_REG_SPI_PAD_REG30X_PAD_SPIC_SCK_O_EN_Pos)

/* 0x19C    0x4000_019c
    31:0    R/W     RESERVED                                                    32'b0
 */
typedef union _AON_REG_PAD_REG31X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} AON_REG_PAD_REG31X_TYPE;

/*0x4000_019c AON_REG_PAD_REG31X*/
#define AON_REG_PAD_REG31X_RESERVED_Pos                                                                                  0U
#define AON_REG_PAD_REG31X_RESERVED_Msk                                                                                  (0xFFFFFFFFUL << AON_REG_PAD_REG31X_RESERVED_Pos)

/* 0x1A0    0x4000_01a0
    30:0    R/W     RESERVED                                                    31'b0
    31      R/W     DEBUG_PCK600_VAON_REG_EN                                    1'b0
 */
typedef union _AON_REG_PAD_REG32X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 31;
        uint32_t DEBUG_PCK600_VAON_REG_EN: 1;
    };
} AON_REG_PAD_REG32X_TYPE;

/*0x4000_01a0 AON_REG_PAD_REG32X*/
#define AON_REG_PAD_REG32X_RESERVED_Pos                                                                                  0U
#define AON_REG_PAD_REG32X_RESERVED_Msk                                                                                  (0x7FFFFFFFUL << AON_REG_PAD_REG32X_RESERVED_Pos)

#define AON_REG_PAD_REG32X_DEBUG_PCK600_VAON_REG_EN_Pos                                                                  31U
#define AON_REG_PAD_REG32X_DEBUG_PCK600_VAON_REG_EN_Msk                                                                  (0x1UL << AON_REG_PAD_REG32X_DEBUG_PCK600_VAON_REG_EN_Pos)

/* 0x1A4    0x4000_01a4
    31:0    R       DEBUG_PCK_AON                                               32'b0
 */
typedef union _AON_REG_PAD_REG33X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEBUG_PCK_AON;
    };
} AON_REG_PAD_REG33X_TYPE;

/*0x4000_01a4 AON_REG_PAD_REG33X*/
#define AON_REG_PAD_REG33X_DEBUG_PCK_AON_Pos                                                                             0U
#define AON_REG_PAD_REG33X_DEBUG_PCK_AON_Msk                                                                             (0xFFFFFFFFUL << AON_REG_PAD_REG33X_DEBUG_PCK_AON_Pos)

/* 0x1A8    0x4000_01a8
    1:0     R/W     SPI3W_SDIO_IN_PAD_PULL                                      2'b01
    2       R/W     SPI3W_SDIO_OUT_PAD_PULL                                     1'b1
    31:3    R/W     RESERVED                                                    29'b0
 */
typedef union _AON_REG_PAD_REG34X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SPI3W_SDIO_IN_PAD_PULL: 2;
        uint32_t SPI3W_SDIO_OUT_PAD_PULL: 1;
        uint32_t RESERVED: 29;
    };
} AON_REG_PAD_REG34X_TYPE;

/*0x4000_01a8 AON_REG_PAD_REG34X*/
#define AON_REG_PAD_REG34X_SPI3W_SDIO_IN_PAD_PULL_Pos                                                                    0U
#define AON_REG_PAD_REG34X_SPI3W_SDIO_IN_PAD_PULL_Msk                                                                    (0x3UL << AON_REG_PAD_REG34X_SPI3W_SDIO_IN_PAD_PULL_Pos)

#define AON_REG_PAD_REG34X_SPI3W_SDIO_OUT_PAD_PULL_Pos                                                                   2U
#define AON_REG_PAD_REG34X_SPI3W_SDIO_OUT_PAD_PULL_Msk                                                                   (0x1UL << AON_REG_PAD_REG34X_SPI3W_SDIO_OUT_PAD_PULL_Pos)

#define AON_REG_PAD_REG34X_RESERVED_Pos                                                                                  3U
#define AON_REG_PAD_REG34X_RESERVED_Msk                                                                                  (0x1FFFFFFFUL << AON_REG_PAD_REG34X_RESERVED_Pos)

/* 0x1C4    0x4000_01c4
    5:0     R/W     LPPWM_CH0_GPIO_SEL                                          6'h0
    6       R/W     RESERVED_3                                                  1'h0
    7       R/W     LPPWM_CH0_GPIO_SEL_EN                                       1'h0
    13:8    R/W     LPQDEC_LED_GPIO_SEL                                         6'h0
    14      R/W     RESERVED_2                                                  1'h0
    15      R/W     LPQDEC_LED_GPIO_SEL_EN                                      1'h0
    21:16   R/W     LPQDEC_PHB_GPIO_SEL                                         6'h0
    22      R/W     RESERVED_1                                                  1'h0
    23      R/W     LPQDEC_PHB_GPIO_SEL_EN                                      1'h0
    29:24   R/W     LPQDEC_PHA_GPIO_SEL                                         6'h0
    30      R/W     RESERVED                                                    1'h0
    31      R/W     LPQDEC_PHA_GPIO_SEL_EN                                      1'h0
 */
typedef union _AON_REG_PAD_VPON_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPPWM_CH0_GPIO_SEL: 6;
        uint32_t RESERVED_3: 1;
        uint32_t LPPWM_CH0_GPIO_SEL_EN: 1;
        uint32_t LPQDEC_LED_GPIO_SEL: 6;
        uint32_t RESERVED_2: 1;
        uint32_t LPQDEC_LED_GPIO_SEL_EN: 1;
        uint32_t LPQDEC_PHB_GPIO_SEL: 6;
        uint32_t RESERVED_1: 1;
        uint32_t LPQDEC_PHB_GPIO_SEL_EN: 1;
        uint32_t LPQDEC_PHA_GPIO_SEL: 6;
        uint32_t RESERVED: 1;
        uint32_t LPQDEC_PHA_GPIO_SEL_EN: 1;
    };
} AON_REG_PAD_VPON_REG0X_TYPE;

/*0x4000_01c4 AON_REG_PAD_VPON_REG0X*/
#define AON_REG_PAD_VPON_REG0X_LPPWM_CH0_GPIO_SEL_Pos                                                                    0U
#define AON_REG_PAD_VPON_REG0X_LPPWM_CH0_GPIO_SEL_Msk                                                                    (0x3FUL << AON_REG_PAD_VPON_REG0X_LPPWM_CH0_GPIO_SEL_Pos)

#define AON_REG_PAD_VPON_REG0X_RESERVED_3_Pos                                                                            6U
#define AON_REG_PAD_VPON_REG0X_RESERVED_3_Msk                                                                            (0x1UL << AON_REG_PAD_VPON_REG0X_RESERVED_3_Pos)

#define AON_REG_PAD_VPON_REG0X_LPPWM_CH0_GPIO_SEL_EN_Pos                                                                 7U
#define AON_REG_PAD_VPON_REG0X_LPPWM_CH0_GPIO_SEL_EN_Msk                                                                 (0x1UL << AON_REG_PAD_VPON_REG0X_LPPWM_CH0_GPIO_SEL_EN_Pos)

#define AON_REG_PAD_VPON_REG0X_LPQDEC_LED_GPIO_SEL_Pos                                                                   8U
#define AON_REG_PAD_VPON_REG0X_LPQDEC_LED_GPIO_SEL_Msk                                                                   (0x3FUL << AON_REG_PAD_VPON_REG0X_LPQDEC_LED_GPIO_SEL_Pos)

#define AON_REG_PAD_VPON_REG0X_RESERVED_2_Pos                                                                            14U
#define AON_REG_PAD_VPON_REG0X_RESERVED_2_Msk                                                                            (0x1UL << AON_REG_PAD_VPON_REG0X_RESERVED_2_Pos)

#define AON_REG_PAD_VPON_REG0X_LPQDEC_LED_GPIO_SEL_EN_Pos                                                                15U
#define AON_REG_PAD_VPON_REG0X_LPQDEC_LED_GPIO_SEL_EN_Msk                                                                (0x1UL << AON_REG_PAD_VPON_REG0X_LPQDEC_LED_GPIO_SEL_EN_Pos)

#define AON_REG_PAD_VPON_REG0X_LPQDEC_PHB_GPIO_SEL_Pos                                                                   16U
#define AON_REG_PAD_VPON_REG0X_LPQDEC_PHB_GPIO_SEL_Msk                                                                   (0x3FUL << AON_REG_PAD_VPON_REG0X_LPQDEC_PHB_GPIO_SEL_Pos)

#define AON_REG_PAD_VPON_REG0X_RESERVED_1_Pos                                                                            22U
#define AON_REG_PAD_VPON_REG0X_RESERVED_1_Msk                                                                            (0x1UL << AON_REG_PAD_VPON_REG0X_RESERVED_1_Pos)

#define AON_REG_PAD_VPON_REG0X_LPQDEC_PHB_GPIO_SEL_EN_Pos                                                                23U
#define AON_REG_PAD_VPON_REG0X_LPQDEC_PHB_GPIO_SEL_EN_Msk                                                                (0x1UL << AON_REG_PAD_VPON_REG0X_LPQDEC_PHB_GPIO_SEL_EN_Pos)

#define AON_REG_PAD_VPON_REG0X_LPQDEC_PHA_GPIO_SEL_Pos                                                                   24U
#define AON_REG_PAD_VPON_REG0X_LPQDEC_PHA_GPIO_SEL_Msk                                                                   (0x3FUL << AON_REG_PAD_VPON_REG0X_LPQDEC_PHA_GPIO_SEL_Pos)

