rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_VPON_REG0X_RESERVED_Pos                                                                              30U
#define AON_REG_PAD_VPON_REG0X_RESERVED_Msk                                                                              (0x1UL << AON_REG_PAD_VPON_REG0X_RESERVED_Pos)

#define AON_REG_PAD_VPON_REG0X_LPQDEC_PHA_GPIO_SEL_EN_Pos                                                                31U
#define AON_REG_PAD_VPON_REG0X_LPQDEC_PHA_GPIO_SEL_EN_Msk                                                                (0x1UL << AON_REG_PAD_VPON_REG0X_LPQDEC_PHA_GPIO_SEL_EN_Pos)

/* 0x1C8    0x4000_01c8
    1:0     R/W     RTC_IN_SEL                                                  2'b00
    2       R/W     PIN_CLK_OUT_SEL_0                                           1'b0
    3       R/W     PIN_CLK_OUT_SEL_1                                           1'b0
    4       R/W     DEBUG_PCK600_VPON_REG_EN                                    1'b0
    31:5    R       RESERVED                                                    27'h0
 */
typedef union _AON_REG_PAD_VPON_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_IN_SEL: 2;
        uint32_t PIN_CLK_OUT_SEL_0: 1;
        uint32_t PIN_CLK_OUT_SEL_1: 1;
        uint32_t DEBUG_PCK600_VPON_REG_EN: 1;
        uint32_t RESERVED: 27;
    };
} AON_REG_PAD_VPON_REG1X_TYPE;

/*0x4000_01c8 AON_REG_PAD_VPON_REG1X*/
#define AON_REG_PAD_VPON_REG1X_RTC_IN_SEL_Pos                                                                            0U
#define AON_REG_PAD_VPON_REG1X_RTC_IN_SEL_Msk                                                                            (0x3UL << AON_REG_PAD_VPON_REG1X_RTC_IN_SEL_Pos)

#define AON_REG_PAD_VPON_REG1X_PIN_CLK_OUT_SEL_0_Pos                                                                     2U
#define AON_REG_PAD_VPON_REG1X_PIN_CLK_OUT_SEL_0_Msk                                                                     (0x1UL << AON_REG_PAD_VPON_REG1X_PIN_CLK_OUT_SEL_0_Pos)

#define AON_REG_PAD_VPON_REG1X_PIN_CLK_OUT_SEL_1_Pos                                                                     3U
#define AON_REG_PAD_VPON_REG1X_PIN_CLK_OUT_SEL_1_Msk                                                                     (0x1UL << AON_REG_PAD_VPON_REG1X_PIN_CLK_OUT_SEL_1_Pos)

#define AON_REG_PAD_VPON_REG1X_DEBUG_PCK600_VPON_REG_EN_Pos                                                              4U
#define AON_REG_PAD_VPON_REG1X_DEBUG_PCK600_VPON_REG_EN_Msk                                                              (0x1UL << AON_REG_PAD_VPON_REG1X_DEBUG_PCK600_VPON_REG_EN_Pos)

#define AON_REG_PAD_VPON_REG1X_RESERVED_Pos                                                                              5U
#define AON_REG_PAD_VPON_REG1X_RESERVED_Msk                                                                              (0x7FFFFFFUL << AON_REG_PAD_VPON_REG1X_RESERVED_Pos)

/* 0x1CC    0x4000_01cc
    31:0    R       DEBUG_PCK_VPON                                              32'h0
 */
typedef union _AON_REG_PAD_VPON_REG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEBUG_PCK_VPON;
    };
} AON_REG_PAD_VPON_REG2X_TYPE;

/*0x4000_01cc AON_REG_PAD_VPON_REG2X*/
#define AON_REG_PAD_VPON_REG2X_DEBUG_PCK_VPON_Pos                                                                        0U
#define AON_REG_PAD_VPON_REG2X_DEBUG_PCK_VPON_Msk                                                                        (0xFFFFFFFFUL << AON_REG_PAD_VPON_REG2X_DEBUG_PCK_VPON_Pos)

/* 0x400    0x4000_0400
    27:0    R/W     LPWDT_CNT_LIMIT                                             28'h55F00
    28      R/W     LPWDT_MODE                                                  1'b0
    29      R/W     LPWDT_CNT_CTL                                               1'b0
    30      R/W     LPWDT_CNT_RELOAD                                            1'b0
    31      R/W     LPWDT_ENABLE                                                1'b0
 */
typedef union _AON_REG_WDT_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPWDT_CNT_LIMIT: 28;
        uint32_t LPWDT_MODE: 1;
        uint32_t LPWDT_CNT_CTL: 1;
        uint32_t LPWDT_CNT_RELOAD: 1;
        uint32_t LPWDT_ENABLE: 1;
    };
} AON_REG_WDT_REG0X_TYPE;

/*0x4000_0400 AON_REG_WDT_REG0X*/
#define AON_REG_WDT_REG0X_LPWDT_CNT_LIMIT_Pos                                                                            0U
#define AON_REG_WDT_REG0X_LPWDT_CNT_LIMIT_Msk                                                                            (0xFFFFFFFUL << AON_REG_WDT_REG0X_LPWDT_CNT_LIMIT_Pos)

#define AON_REG_WDT_REG0X_LPWDT_MODE_Pos                                                                                 28U
#define AON_REG_WDT_REG0X_LPWDT_MODE_Msk                                                                                 (0x1UL << AON_REG_WDT_REG0X_LPWDT_MODE_Pos)

#define AON_REG_WDT_REG0X_LPWDT_CNT_CTL_Pos                                                                              29U
#define AON_REG_WDT_REG0X_LPWDT_CNT_CTL_Msk                                                                              (0x1UL << AON_REG_WDT_REG0X_LPWDT_CNT_CTL_Pos)

#define AON_REG_WDT_REG0X_LPWDT_CNT_RELOAD_Pos                                                                           30U
#define AON_REG_WDT_REG0X_LPWDT_CNT_RELOAD_Msk                                                                           (0x1UL << AON_REG_WDT_REG0X_LPWDT_CNT_RELOAD_Pos)

#define AON_REG_WDT_REG0X_LPWDT_ENABLE_Pos                                                                               31U
#define AON_REG_WDT_REG0X_LPWDT_ENABLE_Msk                                                                               (0x1UL << AON_REG_WDT_REG0X_LPWDT_ENABLE_Pos)

/* 0x404    0x4000_0404
    15:0    R/WAC   LPWDT_CNT_RESET                                             16'h0
    16      R/W     LPWDT_CLK32K_QACTIVE_MAN_DATA                               1'b0
    17      R/W     LPWDT_CLK32K_QACTIVE_MAN_EN                                 1'b0
    31:18   R/W     RESERVED                                                    14'h0
 */
typedef union _AON_REG_WDT_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPWDT_CNT_RESET: 16;
        uint32_t LPWDT_CLK32K_QACTIVE_MAN_DATA: 1;
        uint32_t LPWDT_CLK32K_QACTIVE_MAN_EN: 1;
        uint32_t RESERVED: 14;
    };
} AON_REG_WDT_REG1X_TYPE;

/*0x4000_0404 AON_REG_WDT_REG1X*/
#define AON_REG_WDT_REG1X_LPWDT_CNT_RESET_Pos                                                                            0U
#define AON_REG_WDT_REG1X_LPWDT_CNT_RESET_Msk                                                                            (0xFFFFUL << AON_REG_WDT_REG1X_LPWDT_CNT_RESET_Pos)

#define AON_REG_WDT_REG1X_LPWDT_CLK32K_QACTIVE_MAN_DATA_Pos                                                              16U
#define AON_REG_WDT_REG1X_LPWDT_CLK32K_QACTIVE_MAN_DATA_Msk                                                              (0x1UL << AON_REG_WDT_REG1X_LPWDT_CLK32K_QACTIVE_MAN_DATA_Pos)

#define AON_REG_WDT_REG1X_LPWDT_CLK32K_QACTIVE_MAN_EN_Pos                                                                17U
#define AON_REG_WDT_REG1X_LPWDT_CLK32K_QACTIVE_MAN_EN_Msk                                                                (0x1UL << AON_REG_WDT_REG1X_LPWDT_CLK32K_QACTIVE_MAN_EN_Pos)

