rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_WDT_REG1X_RESERVED_Pos                                                                                   18U
#define AON_REG_WDT_REG1X_RESERVED_Msk                                                                                   (0x3FFFUL << AON_REG_WDT_REG1X_RESERVED_Pos)

/* 0x408    0x4000_0408
    15:0    R       COREWDT_CPU_PC_LSB                                          16'b0
    31:16   R       COREWDT_CPU_PC_MSB                                          16'b0
 */
typedef union _AON_REG_WDT_REG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t COREWDT_CPU_PC_LSB: 16;
        uint32_t COREWDT_CPU_PC_MSB: 16;
    };
} AON_REG_WDT_REG2X_TYPE;

/*0x4000_0408 AON_REG_WDT_REG2X*/
#define AON_REG_WDT_REG2X_COREWDT_CPU_PC_LSB_Pos                                                                         0U
#define AON_REG_WDT_REG2X_COREWDT_CPU_PC_LSB_Msk                                                                         (0xFFFFUL << AON_REG_WDT_REG2X_COREWDT_CPU_PC_LSB_Pos)

#define AON_REG_WDT_REG2X_COREWDT_CPU_PC_MSB_Pos                                                                         16U
#define AON_REG_WDT_REG2X_COREWDT_CPU_PC_MSB_Msk                                                                         (0xFFFFUL << AON_REG_WDT_REG2X_COREWDT_CPU_PC_MSB_Pos)

/* 0x40C    0x4000_040c
    15:0    R       COREWDT_CPU_XPSR_LSB                                        16'b0
    31:16   R       COREWDT_CPU_XPSR_MSB                                        16'b0
 */
typedef union _AON_REG_WDT_REG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t COREWDT_CPU_XPSR_LSB: 16;
        uint32_t COREWDT_CPU_XPSR_MSB: 16;
    };
} AON_REG_WDT_REG3X_TYPE;

/*0x4000_040c AON_REG_WDT_REG3X*/
#define AON_REG_WDT_REG3X_COREWDT_CPU_XPSR_LSB_Pos                                                                       0U
#define AON_REG_WDT_REG3X_COREWDT_CPU_XPSR_LSB_Msk                                                                       (0xFFFFUL << AON_REG_WDT_REG3X_COREWDT_CPU_XPSR_LSB_Pos)

#define AON_REG_WDT_REG3X_COREWDT_CPU_XPSR_MSB_Pos                                                                       16U
#define AON_REG_WDT_REG3X_COREWDT_CPU_XPSR_MSB_Msk                                                                       (0xFFFFUL << AON_REG_WDT_REG3X_COREWDT_CPU_XPSR_MSB_Pos)

/* 0x410    0x4000_0410
    15:0    R       COREWDT_CPU_LR_LSB                                          16'b0
    31:16   R       COREWDT_CPU_LR_MSB                                          16'b0
 */
typedef union _AON_REG_WDT_REG4X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t COREWDT_CPU_LR_LSB: 16;
        uint32_t COREWDT_CPU_LR_MSB: 16;
    };
} AON_REG_WDT_REG4X_TYPE;

/*0x4000_0410 AON_REG_WDT_REG4X*/
#define AON_REG_WDT_REG4X_COREWDT_CPU_LR_LSB_Pos                                                                         0U
#define AON_REG_WDT_REG4X_COREWDT_CPU_LR_LSB_Msk                                                                         (0xFFFFUL << AON_REG_WDT_REG4X_COREWDT_CPU_LR_LSB_Pos)

#define AON_REG_WDT_REG4X_COREWDT_CPU_LR_MSB_Pos                                                                         16U
#define AON_REG_WDT_REG4X_COREWDT_CPU_LR_MSB_Msk                                                                         (0xFFFFUL << AON_REG_WDT_REG4X_COREWDT_CPU_LR_MSB_Pos)

/* 0x414    0x4000_0414
    15:0    R       COREWDT_CPU_R00_Q_LSB                                       16'b0
    31:16   R       COREWDT_CPU_R00_Q_MSB                                       16'b0
 */
typedef union _AON_REG_WDT_REG5X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t COREWDT_CPU_R00_Q_LSB: 16;
        uint32_t COREWDT_CPU_R00_Q_MSB: 16;
    };
} AON_REG_WDT_REG5X_TYPE;

/*0x4000_0414 AON_REG_WDT_REG5X*/
#define AON_REG_WDT_REG5X_COREWDT_CPU_R00_Q_LSB_Pos                                                                      0U
#define AON_REG_WDT_REG5X_COREWDT_CPU_R00_Q_LSB_Msk                                                                      (0xFFFFUL << AON_REG_WDT_REG5X_COREWDT_CPU_R00_Q_LSB_Pos)

#define AON_REG_WDT_REG5X_COREWDT_CPU_R00_Q_MSB_Pos                                                                      16U
#define AON_REG_WDT_REG5X_COREWDT_CPU_R00_Q_MSB_Msk                                                                      (0xFFFFUL << AON_REG_WDT_REG5X_COREWDT_CPU_R00_Q_MSB_Pos)

/* 0x418    0x4000_0418
    15:0    R       COREWDT_CPU_R01_Q_LSB                                       16'b0
    31:16   R       COREWDT_CPU_R01_Q_MSB                                       16'b0
 */
typedef union _AON_REG_WDT_REG6X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t COREWDT_CPU_R01_Q_LSB: 16;
        uint32_t COREWDT_CPU_R01_Q_MSB: 16;
    };
} AON_REG_WDT_REG6X_TYPE;

/*0x4000_0418 AON_REG_WDT_REG6X*/
#define AON_REG_WDT_REG6X_COREWDT_CPU_R01_Q_LSB_Pos                                                                      0U
#define AON_REG_WDT_REG6X_COREWDT_CPU_R01_Q_LSB_Msk                                                                      (0xFFFFUL << AON_REG_WDT_REG6X_COREWDT_CPU_R01_Q_LSB_Pos)

#define AON_REG_WDT_REG6X_COREWDT_CPU_R01_Q_MSB_Pos                                                                      16U
#define AON_REG_WDT_REG6X_COREWDT_CPU_R01_Q_MSB_Msk                                                                      (0xFFFFUL << AON_REG_WDT_REG6X_COREWDT_CPU_R01_Q_MSB_Pos)

/* 0x41C    0x4000_041c
    15:0    R       COREWDT_CPU_R02_Q_LSB                                       16'b0
    31:16   R       COREWDT_CPU_R02_Q_MSB                                       16'b0
 */
typedef union _AON_REG_WDT_REG7X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t COREWDT_CPU_R02_Q_LSB: 16;
        uint32_t COREWDT_CPU_R02_Q_MSB: 16;
    };
} AON_REG_WDT_REG7X_TYPE;

/*0x4000_041c AON_REG_WDT_REG7X*/
#define AON_REG_WDT_REG7X_COREWDT_CPU_R02_Q_LSB_Pos                                                                      0U
#define AON_REG_WDT_REG7X_COREWDT_CPU_R02_Q_LSB_Msk                                                                      (0xFFFFUL << AON_REG_WDT_REG7X_COREWDT_CPU_R02_Q_LSB_Pos)

#define AON_REG_WDT_REG7X_COREWDT_CPU_R02_Q_MSB_Pos                                                                      16U
#define AON_REG_WDT_REG7X_COREWDT_CPU_R02_Q_MSB_Msk                                                                      (0xFFFFUL << AON_REG_WDT_REG7X_COREWDT_CPU_R02_Q_MSB_Pos)

/* 0x420    0x4000_0420
    15:0    R       COREWDT_CPU_R03_Q_LSB                                       16'b0
    31:16   R       COREWDT_CPU_R03_Q_MSB                                       16'b0
 */
typedef union _AON_REG_WDT_REG8X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t COREWDT_CPU_R03_Q_LSB: 16;
        uint32_t COREWDT_CPU_R03_Q_MSB: 16;
    };
} AON_REG_WDT_REG8X_TYPE;

/*0x4000_0420 AON_REG_WDT_REG8X*/
#define AON_REG_WDT_REG8X_COREWDT_CPU_R03_Q_LSB_Pos                                                                      0U
#define AON_REG_WDT_REG8X_COREWDT_CPU_R03_Q_LSB_Msk                                                                      (0xFFFFUL << AON_REG_WDT_REG8X_COREWDT_CPU_R03_Q_LSB_Pos)

#define AON_REG_WDT_REG8X_COREWDT_CPU_R03_Q_MSB_Pos                                                                      16U
#define AON_REG_WDT_REG8X_COREWDT_CPU_R03_Q_MSB_Msk                                                                      (0xFFFFUL << AON_REG_WDT_REG8X_COREWDT_CPU_R03_Q_MSB_Pos)

