rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x424    0x4000_0424
    0       R       COREWDT_FLAG                                                1'b0
    2:1     R       COREWDT_MODE                                                2'b0
    31:3    R       RESERVED                                                    29'b0
 */
typedef union _AON_REG_WDT_REG9X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t COREWDT_FLAG: 1;
        uint32_t COREWDT_MODE: 2;
        uint32_t RESERVED: 29;
    };
} AON_REG_WDT_REG9X_TYPE;

/*0x4000_0424 AON_REG_WDT_REG9X*/
#define AON_REG_WDT_REG9X_COREWDT_FLAG_Pos                                                                               0U
#define AON_REG_WDT_REG9X_COREWDT_FLAG_Msk                                                                               (0x1UL << AON_REG_WDT_REG9X_COREWDT_FLAG_Pos)

#define AON_REG_WDT_REG9X_COREWDT_MODE_Pos                                                                               1U
#define AON_REG_WDT_REG9X_COREWDT_MODE_Msk                                                                               (0x3UL << AON_REG_WDT_REG9X_COREWDT_MODE_Pos)

#define AON_REG_WDT_REG9X_RESERVED_Pos                                                                                   3U
#define AON_REG_WDT_REG9X_RESERVED_Msk                                                                                   (0x1FFFFFFFUL << AON_REG_WDT_REG9X_RESERVED_Pos)

/* 0x428    0x4000_0428
    0       R/WAC   COREWDT_FLAG_CLR                                            1'b0
    1       R/WAC   COREWDT_MODE_CLR                                            1'b0
    15:2    R       RESERVED_1                                                  14'b0
    16      R/WAC   COREWDT_CPU_REG_CLR                                         1'b0
    31:17   R       RESERVED                                                    15'b0
 */
typedef union _AON_REG_WDT_REG10X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t COREWDT_FLAG_CLR: 1;
        uint32_t COREWDT_MODE_CLR: 1;
        uint32_t RESERVED_1: 14;
        uint32_t COREWDT_CPU_REG_CLR: 1;
        uint32_t RESERVED: 15;
    };
} AON_REG_WDT_REG10X_TYPE;

/*0x4000_0428 AON_REG_WDT_REG10X*/
#define AON_REG_WDT_REG10X_COREWDT_FLAG_CLR_Pos                                                                          0U
#define AON_REG_WDT_REG10X_COREWDT_FLAG_CLR_Msk                                                                          (0x1UL << AON_REG_WDT_REG10X_COREWDT_FLAG_CLR_Pos)

#define AON_REG_WDT_REG10X_COREWDT_MODE_CLR_Pos                                                                          1U
#define AON_REG_WDT_REG10X_COREWDT_MODE_CLR_Msk                                                                          (0x1UL << AON_REG_WDT_REG10X_COREWDT_MODE_CLR_Pos)

#define AON_REG_WDT_REG10X_RESERVED_1_Pos                                                                                2U
#define AON_REG_WDT_REG10X_RESERVED_1_Msk                                                                                (0x3FFFUL << AON_REG_WDT_REG10X_RESERVED_1_Pos)

#define AON_REG_WDT_REG10X_COREWDT_CPU_REG_CLR_Pos                                                                       16U
#define AON_REG_WDT_REG10X_COREWDT_CPU_REG_CLR_Msk                                                                       (0x1UL << AON_REG_WDT_REG10X_COREWDT_CPU_REG_CLR_Pos)

#define AON_REG_WDT_REG10X_RESERVED_Pos                                                                                  17U
#define AON_REG_WDT_REG10X_RESERVED_Msk                                                                                  (0x7FFFUL << AON_REG_WDT_REG10X_RESERVED_Pos)

/* 0x42C    0x4000_042c
    31:0    R       RESERVED                                                    32'b0
 */
typedef union _AON_REG_WDT_REG11X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} AON_REG_WDT_REG11X_TYPE;

/*0x4000_042c AON_REG_WDT_REG11X*/
#define AON_REG_WDT_REG11X_RESERVED_Pos                                                                                  0U
#define AON_REG_WDT_REG11X_RESERVED_Msk                                                                                  (0xFFFFFFFFUL << AON_REG_WDT_REG11X_RESERVED_Pos)

/* 0x430    0x4000_0430
    15:0    R       LPWDT_CPU_PC_LSB                                            16'b0
    31:16   R       LPWDT_CPU_PC_MSB                                            16'b0
 */
typedef union _AON_REG_WDT_REG12X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPWDT_CPU_PC_LSB: 16;
        uint32_t LPWDT_CPU_PC_MSB: 16;
    };
} AON_REG_WDT_REG12X_TYPE;

/*0x4000_0430 AON_REG_WDT_REG12X*/
#define AON_REG_WDT_REG12X_LPWDT_CPU_PC_LSB_Pos                                                                          0U
#define AON_REG_WDT_REG12X_LPWDT_CPU_PC_LSB_Msk                                                                          (0xFFFFUL << AON_REG_WDT_REG12X_LPWDT_CPU_PC_LSB_Pos)

#define AON_REG_WDT_REG12X_LPWDT_CPU_PC_MSB_Pos                                                                          16U
#define AON_REG_WDT_REG12X_LPWDT_CPU_PC_MSB_Msk                                                                          (0xFFFFUL << AON_REG_WDT_REG12X_LPWDT_CPU_PC_MSB_Pos)

/* 0x434    0x4000_0434
    15:0    R       LPWDT_CPU_XPSR_LSB                                          16'b0
    31:16   R       LPWDT_CPU_XPSR_MSB                                          16'b0
 */
typedef union _AON_REG_WDT_REG13X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPWDT_CPU_XPSR_LSB: 16;
        uint32_t LPWDT_CPU_XPSR_MSB: 16;
    };
} AON_REG_WDT_REG13X_TYPE;

/*0x4000_0434 AON_REG_WDT_REG13X*/
#define AON_REG_WDT_REG13X_LPWDT_CPU_XPSR_LSB_Pos                                                                        0U
#define AON_REG_WDT_REG13X_LPWDT_CPU_XPSR_LSB_Msk                                                                        (0xFFFFUL << AON_REG_WDT_REG13X_LPWDT_CPU_XPSR_LSB_Pos)

#define AON_REG_WDT_REG13X_LPWDT_CPU_XPSR_MSB_Pos                                                                        16U
#define AON_REG_WDT_REG13X_LPWDT_CPU_XPSR_MSB_Msk                                                                        (0xFFFFUL << AON_REG_WDT_REG13X_LPWDT_CPU_XPSR_MSB_Pos)

/* 0x438    0x4000_0438
    15:0    R       LPWDT_CPU_LR_LSB                                            16'b0
    31:16   R       LPWDT_CPU_LR_MSB                                            16'b0
 */
typedef union _AON_REG_WDT_REG14X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPWDT_CPU_LR_LSB: 16;
        uint32_t LPWDT_CPU_LR_MSB: 16;
    };
} AON_REG_WDT_REG14X_TYPE;

/*0x4000_0438 AON_REG_WDT_REG14X*/
#define AON_REG_WDT_REG14X_LPWDT_CPU_LR_LSB_Pos                                                                          0U
#define AON_REG_WDT_REG14X_LPWDT_CPU_LR_LSB_Msk                                                                          (0xFFFFUL << AON_REG_WDT_REG14X_LPWDT_CPU_LR_LSB_Pos)

