rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_WDT_REG14X_LPWDT_CPU_LR_MSB_Pos                                                                          16U
#define AON_REG_WDT_REG14X_LPWDT_CPU_LR_MSB_Msk                                                                          (0xFFFFUL << AON_REG_WDT_REG14X_LPWDT_CPU_LR_MSB_Pos)

/* 0x43C    0x4000_043c
    15:0    R       LPWDT_CPU_R00_Q_LSB                                         16'b0
    31:16   R       LPWDT_CPU_R00_Q_MSB                                         16'b0
 */
typedef union _AON_REG_WDT_REG15X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPWDT_CPU_R00_Q_LSB: 16;
        uint32_t LPWDT_CPU_R00_Q_MSB: 16;
    };
} AON_REG_WDT_REG15X_TYPE;

/*0x4000_043c AON_REG_WDT_REG15X*/
#define AON_REG_WDT_REG15X_LPWDT_CPU_R00_Q_LSB_Pos                                                                       0U
#define AON_REG_WDT_REG15X_LPWDT_CPU_R00_Q_LSB_Msk                                                                       (0xFFFFUL << AON_REG_WDT_REG15X_LPWDT_CPU_R00_Q_LSB_Pos)

#define AON_REG_WDT_REG15X_LPWDT_CPU_R00_Q_MSB_Pos                                                                       16U
#define AON_REG_WDT_REG15X_LPWDT_CPU_R00_Q_MSB_Msk                                                                       (0xFFFFUL << AON_REG_WDT_REG15X_LPWDT_CPU_R00_Q_MSB_Pos)

/* 0x440    0x4000_0440
    15:0    R       LPWDT_CPU_R01_Q_LSB                                         16'b0
    31:16   R       LPWDT_CPU_R01_Q_MSB                                         16'b0
 */
typedef union _AON_REG_WDT_REG16X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPWDT_CPU_R01_Q_LSB: 16;
        uint32_t LPWDT_CPU_R01_Q_MSB: 16;
    };
} AON_REG_WDT_REG16X_TYPE;

/*0x4000_0440 AON_REG_WDT_REG16X*/
#define AON_REG_WDT_REG16X_LPWDT_CPU_R01_Q_LSB_Pos                                                                       0U
#define AON_REG_WDT_REG16X_LPWDT_CPU_R01_Q_LSB_Msk                                                                       (0xFFFFUL << AON_REG_WDT_REG16X_LPWDT_CPU_R01_Q_LSB_Pos)

#define AON_REG_WDT_REG16X_LPWDT_CPU_R01_Q_MSB_Pos                                                                       16U
#define AON_REG_WDT_REG16X_LPWDT_CPU_R01_Q_MSB_Msk                                                                       (0xFFFFUL << AON_REG_WDT_REG16X_LPWDT_CPU_R01_Q_MSB_Pos)

/* 0x444    0x4000_0444
    15:0    R       LPWDT_CPU_R02_Q_LSB                                         16'b0
    31:16   R       LPWDT_CPU_R02_Q_MSB                                         16'b0
 */
typedef union _AON_REG_WDT_REG17X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPWDT_CPU_R02_Q_LSB: 16;
        uint32_t LPWDT_CPU_R02_Q_MSB: 16;
    };
} AON_REG_WDT_REG17X_TYPE;

/*0x4000_0444 AON_REG_WDT_REG17X*/
#define AON_REG_WDT_REG17X_LPWDT_CPU_R02_Q_LSB_Pos                                                                       0U
#define AON_REG_WDT_REG17X_LPWDT_CPU_R02_Q_LSB_Msk                                                                       (0xFFFFUL << AON_REG_WDT_REG17X_LPWDT_CPU_R02_Q_LSB_Pos)

#define AON_REG_WDT_REG17X_LPWDT_CPU_R02_Q_MSB_Pos                                                                       16U
#define AON_REG_WDT_REG17X_LPWDT_CPU_R02_Q_MSB_Msk                                                                       (0xFFFFUL << AON_REG_WDT_REG17X_LPWDT_CPU_R02_Q_MSB_Pos)

/* 0x448    0x4000_0448
    15:0    R       LPWDT_CPU_R03_Q_LSB                                         16'b0
    31:16   R       LPWDT_CPU_R03_Q_MSB                                         16'b0
 */
typedef union _AON_REG_WDT_REG18X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPWDT_CPU_R03_Q_LSB: 16;
        uint32_t LPWDT_CPU_R03_Q_MSB: 16;
    };
} AON_REG_WDT_REG18X_TYPE;

/*0x4000_0448 AON_REG_WDT_REG18X*/
#define AON_REG_WDT_REG18X_LPWDT_CPU_R03_Q_LSB_Pos                                                                       0U
#define AON_REG_WDT_REG18X_LPWDT_CPU_R03_Q_LSB_Msk                                                                       (0xFFFFUL << AON_REG_WDT_REG18X_LPWDT_CPU_R03_Q_LSB_Pos)

#define AON_REG_WDT_REG18X_LPWDT_CPU_R03_Q_MSB_Pos                                                                       16U
#define AON_REG_WDT_REG18X_LPWDT_CPU_R03_Q_MSB_Msk                                                                       (0xFFFFUL << AON_REG_WDT_REG18X_LPWDT_CPU_R03_Q_MSB_Pos)

/* 0x44C    0x4000_044c
    0       R       LPWDT_FLAG                                                  1'b0
    2:1     R       LPWDT_MODE_RECORD                                           2'b0
    30:3    R       LPWDT_CURRENT                                               28'b0
    31      R       RESERVED                                                    1'b0
 */
typedef union _AON_REG_WDT_REG19X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPWDT_FLAG: 1;
        uint32_t LPWDT_MODE_RECORD: 2;
        uint32_t LPWDT_CURRENT: 28;
        uint32_t RESERVED: 1;
    };
} AON_REG_WDT_REG19X_TYPE;

/*0x4000_044c AON_REG_WDT_REG19X*/
#define AON_REG_WDT_REG19X_LPWDT_FLAG_Pos                                                                                0U
#define AON_REG_WDT_REG19X_LPWDT_FLAG_Msk                                                                                (0x1UL << AON_REG_WDT_REG19X_LPWDT_FLAG_Pos)

#define AON_REG_WDT_REG19X_LPWDT_MODE_RECORD_Pos                                                                         1U
#define AON_REG_WDT_REG19X_LPWDT_MODE_RECORD_Msk                                                                         (0x3UL << AON_REG_WDT_REG19X_LPWDT_MODE_RECORD_Pos)

#define AON_REG_WDT_REG19X_LPWDT_CURRENT_Pos                                                                             3U
#define AON_REG_WDT_REG19X_LPWDT_CURRENT_Msk                                                                             (0xFFFFFFFUL << AON_REG_WDT_REG19X_LPWDT_CURRENT_Pos)

#define AON_REG_WDT_REG19X_RESERVED_Pos                                                                                  31U
#define AON_REG_WDT_REG19X_RESERVED_Msk                                                                                  (0x1UL << AON_REG_WDT_REG19X_RESERVED_Pos)

/* 0x450    0x4000_0450
    0       R/WAC   LPWDT_FLAG_CLR                                              1'b0
    1       R/WAC   LPWDT_MODE_CLR                                              1'b0
    15:2    R       RESERVED_1                                                  14'b0
    16      R/WAC   LPWDT_CPU_REG_CLR                                           1'b0
    31:17   R       RESERVED                                                    15'b0
 */
typedef union _AON_REG_WDT_REG20X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPWDT_FLAG_CLR: 1;
        uint32_t LPWDT_MODE_CLR: 1;
        uint32_t RESERVED_1: 14;
        uint32_t LPWDT_CPU_REG_CLR: 1;
        uint32_t RESERVED: 15;
    };
} AON_REG_WDT_REG20X_TYPE;

/*0x4000_0450 AON_REG_WDT_REG20X*/
#define AON_REG_WDT_REG20X_LPWDT_FLAG_CLR_Pos                                                                            0U
#define AON_REG_WDT_REG20X_LPWDT_FLAG_CLR_Msk                                                                            (0x1UL << AON_REG_WDT_REG20X_LPWDT_FLAG_CLR_Pos)

#define AON_REG_WDT_REG20X_LPWDT_MODE_CLR_Pos                                                                            1U
#define AON_REG_WDT_REG20X_LPWDT_MODE_CLR_Msk                                                                            (0x1UL << AON_REG_WDT_REG20X_LPWDT_MODE_CLR_Pos)

#define AON_REG_WDT_REG20X_RESERVED_1_Pos                                                                                2U
#define AON_REG_WDT_REG20X_RESERVED_1_Msk                                                                                (0x3FFFUL << AON_REG_WDT_REG20X_RESERVED_1_Pos)

#define AON_REG_WDT_REG20X_LPWDT_CPU_REG_CLR_Pos                                                                         16U
#define AON_REG_WDT_REG20X_LPWDT_CPU_REG_CLR_Msk                                                                         (0x1UL << AON_REG_WDT_REG20X_LPWDT_CPU_REG_CLR_Pos)

#define AON_REG_WDT_REG20X_RESERVED_Pos                                                                                  17U
#define AON_REG_WDT_REG20X_RESERVED_Msk                                                                                  (0x7FFFUL << AON_REG_WDT_REG20X_RESERVED_Pos)

/* 0x458    0x4000_0458
    18:0    R/W     REG_AON_WDT_COMP                                            19'h00000
    19      R/W     REG_AON_WDT_CLK                                             1'b0
    20      R/W     REG_AON_WDT_RSTN                                            1'b0
    24:21   R/W     OSCCTUNE                                                    4'b1000
    28:25   R/W     OSCRTUNE                                                    4'b1000
    29      R/W     OSC_POW                                                     1'b0
    30      R/W     WDT_EN                                                      1'b0
    31      R/W     WDT_CKOUT_EN                                                1'b0
 */
typedef union _AON_REG_IO_WDT_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG_AON_WDT_COMP: 19;
        uint32_t REG_AON_WDT_CLK: 1;
        uint32_t REG_AON_WDT_RSTN: 1;
        uint32_t OSCCTUNE: 4;
        uint32_t OSCRTUNE: 4;
        uint32_t OSC_POW: 1;
        uint32_t WDT_EN: 1;
        uint32_t WDT_CKOUT_EN: 1;
    };
} AON_REG_IO_WDT_REG0X_TYPE;

