rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0458 AON_REG_IO_WDT_REG0X*/
#define AON_REG_IO_WDT_REG0X_REG_AON_WDT_COMP_Pos                                                                        0U
#define AON_REG_IO_WDT_REG0X_REG_AON_WDT_COMP_Msk                                                                        (0x7FFFFUL << AON_REG_IO_WDT_REG0X_REG_AON_WDT_COMP_Pos)

#define AON_REG_IO_WDT_REG0X_REG_AON_WDT_CLK_Pos                                                                         19U
#define AON_REG_IO_WDT_REG0X_REG_AON_WDT_CLK_Msk                                                                         (0x1UL << AON_REG_IO_WDT_REG0X_REG_AON_WDT_CLK_Pos)

#define AON_REG_IO_WDT_REG0X_REG_AON_WDT_RSTN_Pos                                                                        20U
#define AON_REG_IO_WDT_REG0X_REG_AON_WDT_RSTN_Msk                                                                        (0x1UL << AON_REG_IO_WDT_REG0X_REG_AON_WDT_RSTN_Pos)

#define AON_REG_IO_WDT_REG0X_OSCCTUNE_Pos                                                                                21U
#define AON_REG_IO_WDT_REG0X_OSCCTUNE_Msk                                                                                (0xFUL << AON_REG_IO_WDT_REG0X_OSCCTUNE_Pos)

#define AON_REG_IO_WDT_REG0X_OSCRTUNE_Pos                                                                                25U
#define AON_REG_IO_WDT_REG0X_OSCRTUNE_Msk                                                                                (0xFUL << AON_REG_IO_WDT_REG0X_OSCRTUNE_Pos)

#define AON_REG_IO_WDT_REG0X_OSC_POW_Pos                                                                                 29U
#define AON_REG_IO_WDT_REG0X_OSC_POW_Msk                                                                                 (0x1UL << AON_REG_IO_WDT_REG0X_OSC_POW_Pos)

#define AON_REG_IO_WDT_REG0X_WDT_EN_Pos                                                                                  30U
#define AON_REG_IO_WDT_REG0X_WDT_EN_Msk                                                                                  (0x1UL << AON_REG_IO_WDT_REG0X_WDT_EN_Pos)

#define AON_REG_IO_WDT_REG0X_WDT_CKOUT_EN_Pos                                                                            31U
#define AON_REG_IO_WDT_REG0X_WDT_CKOUT_EN_Msk                                                                            (0x1UL << AON_REG_IO_WDT_REG0X_WDT_CKOUT_EN_Pos)

/* 0x45C    0x4000_045c
    18:0    R       REG_AON_WDT_COMP_FLAG                                       19'h0
    19      R       WDT2AON_RSTN_FLAG                                           1'b0
    20      R       RESERVED_2                                                  1'b0
    24:21   R       RESERVED_1                                                  4'b0
    28:25   R       RESERVED                                                    4'b0
    29      R       ENSIMO_FLAG                                                 1'b0
    30      R       ENLDO_FLAG                                                  1'b0
    31      R       SIMO_WDT_RST_FLAG                                           1'b0
 */
typedef union _AON_REG_IO_WDT_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG_AON_WDT_COMP_FLAG: 19;
        uint32_t WDT2AON_RSTN_FLAG: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 4;
        uint32_t RESERVED: 4;
        uint32_t ENSIMO_FLAG: 1;
        uint32_t ENLDO_FLAG: 1;
        uint32_t SIMO_WDT_RST_FLAG: 1;
    };
} AON_REG_IO_WDT_REG1X_TYPE;

/*0x4000_045c AON_REG_IO_WDT_REG1X*/
#define AON_REG_IO_WDT_REG1X_REG_AON_WDT_COMP_FLAG_Pos                                                                   0U
#define AON_REG_IO_WDT_REG1X_REG_AON_WDT_COMP_FLAG_Msk                                                                   (0x7FFFFUL << AON_REG_IO_WDT_REG1X_REG_AON_WDT_COMP_FLAG_Pos)

#define AON_REG_IO_WDT_REG1X_WDT2AON_RSTN_FLAG_Pos                                                                       19U
#define AON_REG_IO_WDT_REG1X_WDT2AON_RSTN_FLAG_Msk                                                                       (0x1UL << AON_REG_IO_WDT_REG1X_WDT2AON_RSTN_FLAG_Pos)

#define AON_REG_IO_WDT_REG1X_RESERVED_2_Pos                                                                              20U
#define AON_REG_IO_WDT_REG1X_RESERVED_2_Msk                                                                              (0x1UL << AON_REG_IO_WDT_REG1X_RESERVED_2_Pos)

#define AON_REG_IO_WDT_REG1X_RESERVED_1_Pos                                                                              21U
#define AON_REG_IO_WDT_REG1X_RESERVED_1_Msk                                                                              (0xFUL << AON_REG_IO_WDT_REG1X_RESERVED_1_Pos)

#define AON_REG_IO_WDT_REG1X_RESERVED_Pos                                                                                25U
#define AON_REG_IO_WDT_REG1X_RESERVED_Msk                                                                                (0xFUL << AON_REG_IO_WDT_REG1X_RESERVED_Pos)

#define AON_REG_IO_WDT_REG1X_ENSIMO_FLAG_Pos                                                                             29U
#define AON_REG_IO_WDT_REG1X_ENSIMO_FLAG_Msk                                                                             (0x1UL << AON_REG_IO_WDT_REG1X_ENSIMO_FLAG_Pos)

#define AON_REG_IO_WDT_REG1X_ENLDO_FLAG_Pos                                                                              30U
#define AON_REG_IO_WDT_REG1X_ENLDO_FLAG_Msk                                                                              (0x1UL << AON_REG_IO_WDT_REG1X_ENLDO_FLAG_Pos)

#define AON_REG_IO_WDT_REG1X_SIMO_WDT_RST_FLAG_Pos                                                                       31U
#define AON_REG_IO_WDT_REG1X_SIMO_WDT_RST_FLAG_Msk                                                                       (0x1UL << AON_REG_IO_WDT_REG1X_SIMO_WDT_RST_FLAG_Pos)

/* 0x464    0x4000_0464
    0       R/W     DPD_R0                                                      1'b1
    1       R/W     DPD_R1                                                      1'b0
    2       R/W     DPD_R2                                                      1'b1
    3       R/W     DPD_R3                                                      1'b1
    7:4     R/W     DPD_SEL                                                     4'b0
    8       R/W     VMAX_SEL_ALWAYS_ON                                          1'b1
    9       R/W     VMAX_SEL_HIQ                                                1'b0
    13:10   R/W     RESERVED_1                                                  4'b0
    14      R/W     DPD_CKOUT_EN                                                1'b1
    15      R/W     DPD_RCK                                                     1'b0
    16      R/W     DPD_R4                                                      1'b0
    17      R/W     DPD_R5                                                      1'b0
    18      R/W     DPD_R6                                                      1'b0
    19      R/W     DPD_R7                                                      1'b0
    20      R/W     DPD_R8                                                      1'b0
    21      R/W     DPD_R9                                                      1'b0
    22      R/W     DPD_R10                                                     1'b0
    23      R/W     DPD_R11                                                     1'b0
    24      R/W     DPD_R12                                                     1'b0
    25      R/W     DPD_R13                                                     1'b0
    26      R/W     DPD_R14                                                     1'b0
    27      R/W     DPD_R15                                                     1'b0
    31:28   R/W     RESERVED                                                    4'b0000
 */
typedef union _AON_REG_SHIP_DPD_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DPD_R0: 1;
        uint32_t DPD_R1: 1;
        uint32_t DPD_R2: 1;
        uint32_t DPD_R3: 1;
        uint32_t DPD_SEL: 4;
        uint32_t VMAX_SEL_ALWAYS_ON: 1;
        uint32_t VMAX_SEL_HIQ: 1;
        uint32_t RESERVED_1: 4;
        uint32_t DPD_CKOUT_EN: 1;
        uint32_t DPD_RCK: 1;
        uint32_t DPD_R4: 1;
        uint32_t DPD_R5: 1;
        uint32_t DPD_R6: 1;
        uint32_t DPD_R7: 1;
        uint32_t DPD_R8: 1;
        uint32_t DPD_R9: 1;
        uint32_t DPD_R10: 1;
        uint32_t DPD_R11: 1;
        uint32_t DPD_R12: 1;
        uint32_t DPD_R13: 1;
        uint32_t DPD_R14: 1;
        uint32_t DPD_R15: 1;
        uint32_t RESERVED: 4;
    };
} AON_REG_SHIP_DPD_REG0X_TYPE;

