rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0464 AON_REG_SHIP_DPD_REG0X*/
#define AON_REG_SHIP_DPD_REG0X_DPD_R0_Pos                                                                                0U
#define AON_REG_SHIP_DPD_REG0X_DPD_R0_Msk                                                                                (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R0_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R1_Pos                                                                                1U
#define AON_REG_SHIP_DPD_REG0X_DPD_R1_Msk                                                                                (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R1_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R2_Pos                                                                                2U
#define AON_REG_SHIP_DPD_REG0X_DPD_R2_Msk                                                                                (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R2_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R3_Pos                                                                                3U
#define AON_REG_SHIP_DPD_REG0X_DPD_R3_Msk                                                                                (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R3_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_SEL_Pos                                                                               4U
#define AON_REG_SHIP_DPD_REG0X_DPD_SEL_Msk                                                                               (0xFUL << AON_REG_SHIP_DPD_REG0X_DPD_SEL_Pos)

#define AON_REG_SHIP_DPD_REG0X_VMAX_SEL_ALWAYS_ON_Pos                                                                    8U
#define AON_REG_SHIP_DPD_REG0X_VMAX_SEL_ALWAYS_ON_Msk                                                                    (0x1UL << AON_REG_SHIP_DPD_REG0X_VMAX_SEL_ALWAYS_ON_Pos)

#define AON_REG_SHIP_DPD_REG0X_VMAX_SEL_HIQ_Pos                                                                          9U
#define AON_REG_SHIP_DPD_REG0X_VMAX_SEL_HIQ_Msk                                                                          (0x1UL << AON_REG_SHIP_DPD_REG0X_VMAX_SEL_HIQ_Pos)

#define AON_REG_SHIP_DPD_REG0X_RESERVED_1_Pos                                                                            10U
#define AON_REG_SHIP_DPD_REG0X_RESERVED_1_Msk                                                                            (0xFUL << AON_REG_SHIP_DPD_REG0X_RESERVED_1_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_CKOUT_EN_Pos                                                                          14U
#define AON_REG_SHIP_DPD_REG0X_DPD_CKOUT_EN_Msk                                                                          (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_CKOUT_EN_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_RCK_Pos                                                                               15U
#define AON_REG_SHIP_DPD_REG0X_DPD_RCK_Msk                                                                               (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_RCK_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R4_Pos                                                                                16U
#define AON_REG_SHIP_DPD_REG0X_DPD_R4_Msk                                                                                (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R4_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R5_Pos                                                                                17U
#define AON_REG_SHIP_DPD_REG0X_DPD_R5_Msk                                                                                (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R5_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R6_Pos                                                                                18U
#define AON_REG_SHIP_DPD_REG0X_DPD_R6_Msk                                                                                (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R6_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R7_Pos                                                                                19U
#define AON_REG_SHIP_DPD_REG0X_DPD_R7_Msk                                                                                (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R7_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R8_Pos                                                                                20U
#define AON_REG_SHIP_DPD_REG0X_DPD_R8_Msk                                                                                (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R8_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R9_Pos                                                                                21U
#define AON_REG_SHIP_DPD_REG0X_DPD_R9_Msk                                                                                (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R9_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R10_Pos                                                                               22U
#define AON_REG_SHIP_DPD_REG0X_DPD_R10_Msk                                                                               (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R10_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R11_Pos                                                                               23U
#define AON_REG_SHIP_DPD_REG0X_DPD_R11_Msk                                                                               (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R11_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R12_Pos                                                                               24U
#define AON_REG_SHIP_DPD_REG0X_DPD_R12_Msk                                                                               (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R12_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R13_Pos                                                                               25U
#define AON_REG_SHIP_DPD_REG0X_DPD_R13_Msk                                                                               (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R13_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R14_Pos                                                                               26U
#define AON_REG_SHIP_DPD_REG0X_DPD_R14_Msk                                                                               (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R14_Pos)

#define AON_REG_SHIP_DPD_REG0X_DPD_R15_Pos                                                                               27U
#define AON_REG_SHIP_DPD_REG0X_DPD_R15_Msk                                                                               (0x1UL << AON_REG_SHIP_DPD_REG0X_DPD_R15_Pos)

#define AON_REG_SHIP_DPD_REG0X_RESERVED_Pos                                                                              28U
#define AON_REG_SHIP_DPD_REG0X_RESERVED_Msk                                                                              (0xFUL << AON_REG_SHIP_DPD_REG0X_RESERVED_Pos)

