rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x468    0x4000_0468
    0       R       FLAG_DPD_R0                                                 1'b0
    1       R       FLAG_DPD_R1                                                 1'b0
    2       R       FLAG_DPD_R2                                                 1'b0
    3       R       FLAG_DPD_R3                                                 1'b0
    7:4     R       FLAG_DPD_SEL                                                4'b0000
    8       R       FLAG_VMAX_SEL_ALWAYS_ON                                     1'b0
    9       R       FLAG_VMAX_SEL_HIQ                                           1'b0
    10      R       FLAG_DPD_R10_RSV                                            1'b0
    11      R       FLAG_DPD_R11_RSV                                            1'b0
    12      R       FLAG_DPD_R4                                                 1'b0
    13      R       FLAG_DPD_R5                                                 1'b0
    14      R       FLAG_DPD_R6                                                 1'b0
    15      R       FLAG_DPD_R7                                                 1'b0
    16      R       FLAG_DPD_R8                                                 1'b0
    17      R       FLAG_DPD_R9                                                 1'b0
    18      R       FLAG_DPD_R10                                                1'b0
    19      R       FLAG_DPD_R11                                                1'b0
    20      R       FLAG_DPD_R12                                                1'b0
    21      R       FLAG_DPD_R13                                                1'b0
    22      R       FLAG_DPD_R14                                                1'b0
    23      R       FLAG_DPD_R15                                                1'b0
    31:24   R       RESERVED                                                    8'h0
 */
typedef union _AON_C_KOUT0X_DPD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FLAG_DPD_R0: 1;
        uint32_t FLAG_DPD_R1: 1;
        uint32_t FLAG_DPD_R2: 1;
        uint32_t FLAG_DPD_R3: 1;
        uint32_t FLAG_DPD_SEL: 4;
        uint32_t FLAG_VMAX_SEL_ALWAYS_ON: 1;
        uint32_t FLAG_VMAX_SEL_HIQ: 1;
        uint32_t FLAG_DPD_R10_RSV: 1;
        uint32_t FLAG_DPD_R11_RSV: 1;
        uint32_t FLAG_DPD_R4: 1;
        uint32_t FLAG_DPD_R5: 1;
        uint32_t FLAG_DPD_R6: 1;
        uint32_t FLAG_DPD_R7: 1;
        uint32_t FLAG_DPD_R8: 1;
        uint32_t FLAG_DPD_R9: 1;
        uint32_t FLAG_DPD_R10: 1;
        uint32_t FLAG_DPD_R11: 1;
        uint32_t FLAG_DPD_R12: 1;
        uint32_t FLAG_DPD_R13: 1;
        uint32_t FLAG_DPD_R14: 1;
        uint32_t FLAG_DPD_R15: 1;
        uint32_t RESERVED: 8;
    };
} AON_C_KOUT0X_DPD_TYPE;

/*0x4000_0468 AON_C_KOUT0X_DPD*/
#define AON_C_KOUT0X_DPD_FLAG_DPD_R0_Pos                                                                                 0U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R0_Msk                                                                                 (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R0_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R1_Pos                                                                                 1U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R1_Msk                                                                                 (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R1_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R2_Pos                                                                                 2U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R2_Msk                                                                                 (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R2_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R3_Pos                                                                                 3U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R3_Msk                                                                                 (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R3_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_SEL_Pos                                                                                4U
#define AON_C_KOUT0X_DPD_FLAG_DPD_SEL_Msk                                                                                (0xFUL << AON_C_KOUT0X_DPD_FLAG_DPD_SEL_Pos)

#define AON_C_KOUT0X_DPD_FLAG_VMAX_SEL_ALWAYS_ON_Pos                                                                     8U
#define AON_C_KOUT0X_DPD_FLAG_VMAX_SEL_ALWAYS_ON_Msk                                                                     (0x1UL << AON_C_KOUT0X_DPD_FLAG_VMAX_SEL_ALWAYS_ON_Pos)

#define AON_C_KOUT0X_DPD_FLAG_VMAX_SEL_HIQ_Pos                                                                           9U
#define AON_C_KOUT0X_DPD_FLAG_VMAX_SEL_HIQ_Msk                                                                           (0x1UL << AON_C_KOUT0X_DPD_FLAG_VMAX_SEL_HIQ_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R10_RSV_Pos                                                                            10U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R10_RSV_Msk                                                                            (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R10_RSV_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R11_RSV_Pos                                                                            11U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R11_RSV_Msk                                                                            (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R11_RSV_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R4_Pos                                                                                 12U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R4_Msk                                                                                 (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R4_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R5_Pos                                                                                 13U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R5_Msk                                                                                 (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R5_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R6_Pos                                                                                 14U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R6_Msk                                                                                 (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R6_Pos)

