rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_C_KOUT0X_DPD_FLAG_DPD_R7_Pos                                                                                 15U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R7_Msk                                                                                 (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R7_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R8_Pos                                                                                 16U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R8_Msk                                                                                 (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R8_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R9_Pos                                                                                 17U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R9_Msk                                                                                 (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R9_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R10_Pos                                                                                18U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R10_Msk                                                                                (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R10_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R11_Pos                                                                                19U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R11_Msk                                                                                (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R11_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R12_Pos                                                                                20U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R12_Msk                                                                                (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R12_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R13_Pos                                                                                21U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R13_Msk                                                                                (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R13_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R14_Pos                                                                                22U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R14_Msk                                                                                (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R14_Pos)

#define AON_C_KOUT0X_DPD_FLAG_DPD_R15_Pos                                                                                23U
#define AON_C_KOUT0X_DPD_FLAG_DPD_R15_Msk                                                                                (0x1UL << AON_C_KOUT0X_DPD_FLAG_DPD_R15_Pos)

#define AON_C_KOUT0X_DPD_RESERVED_Pos                                                                                    24U
#define AON_C_KOUT0X_DPD_RESERVED_Msk                                                                                    (0xFFUL << AON_C_KOUT0X_DPD_RESERVED_Pos)

/* 0x488    0x4000_0488
    0       R/W     EN_PBG_RC                                                   1'b1
    5:1     R/W     SEL_VREF_LDO_32K                                            5'b01111
    10:6    R/W     SEL_VREF_VDDCORE_LQ                                         5'b01110
    15:11   R/W     SEL_VREF_HV25_LQ                                            5'b01111
    18:16   R/W     TUNE_BG_REF1                                                3'b101
    19      R/W     REG1X_MBIAS_DUMMY0                                          1'b0
    25:20   R/W     SEL_VREF_LPC_L                                              6'b011100
    31:26   R/W     SEL_VREF_LPC_H                                              6'b011101
 */
typedef union _AON_REG_MBIAS_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t EN_PBG_RC: 1;
        uint32_t SEL_VREF_LDO_32K: 5;
        uint32_t SEL_VREF_VDDCORE_LQ: 5;
        uint32_t SEL_VREF_HV25_LQ: 5;
        uint32_t TUNE_BG_REF1: 3;
        uint32_t REG1X_MBIAS_DUMMY0: 1;
        uint32_t SEL_VREF_LPC_L: 6;
        uint32_t SEL_VREF_LPC_H: 6;
    };
} AON_REG_MBIAS_REG0X_TYPE;

/*0x4000_0488 AON_REG_MBIAS_REG0X*/
#define AON_REG_MBIAS_REG0X_EN_PBG_RC_Pos                                                                                0U
#define AON_REG_MBIAS_REG0X_EN_PBG_RC_Msk                                                                                (0x1UL << AON_REG_MBIAS_REG0X_EN_PBG_RC_Pos)

#define AON_REG_MBIAS_REG0X_SEL_VREF_LDO_32K_Pos                                                                         1U
#define AON_REG_MBIAS_REG0X_SEL_VREF_LDO_32K_Msk                                                                         (0x1FUL << AON_REG_MBIAS_REG0X_SEL_VREF_LDO_32K_Pos)

#define AON_REG_MBIAS_REG0X_SEL_VREF_VDDCORE_LQ_Pos                                                                      6U
#define AON_REG_MBIAS_REG0X_SEL_VREF_VDDCORE_LQ_Msk                                                                      (0x1FUL << AON_REG_MBIAS_REG0X_SEL_VREF_VDDCORE_LQ_Pos)

#define AON_REG_MBIAS_REG0X_SEL_VREF_HV25_LQ_Pos                                                                         11U
#define AON_REG_MBIAS_REG0X_SEL_VREF_HV25_LQ_Msk                                                                         (0x1FUL << AON_REG_MBIAS_REG0X_SEL_VREF_HV25_LQ_Pos)

#define AON_REG_MBIAS_REG0X_TUNE_BG_REF1_Pos                                                                             16U
#define AON_REG_MBIAS_REG0X_TUNE_BG_REF1_Msk                                                                             (0x7UL << AON_REG_MBIAS_REG0X_TUNE_BG_REF1_Pos)

#define AON_REG_MBIAS_REG0X_REG1X_MBIAS_DUMMY0_Pos                                                                       19U
#define AON_REG_MBIAS_REG0X_REG1X_MBIAS_DUMMY0_Msk                                                                       (0x1UL << AON_REG_MBIAS_REG0X_REG1X_MBIAS_DUMMY0_Pos)

#define AON_REG_MBIAS_REG0X_SEL_VREF_LPC_L_Pos                                                                           20U
#define AON_REG_MBIAS_REG0X_SEL_VREF_LPC_L_Msk                                                                           (0x3FUL << AON_REG_MBIAS_REG0X_SEL_VREF_LPC_L_Pos)

#define AON_REG_MBIAS_REG0X_SEL_VREF_LPC_H_Pos                                                                           26U
#define AON_REG_MBIAS_REG0X_SEL_VREF_LPC_H_Msk                                                                           (0x3FUL << AON_REG_MBIAS_REG0X_SEL_VREF_LPC_H_Pos)

