rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x48C    0x4000_048c
    0       R/W     EN_BIAS_1UA                                                 1'b0
    5:1     R       TUNE_VREFSS_VDDPA_HQ                                        5'b00000
    10:6    R       TUNE_VREFSS_HV18_HQ                                         5'b00000
    15:11   R/W     SEL_VREF_HV25_HQ                                            5'b01111
    16      R/W     EN_BIAS_10UA                                                1'b0
    17      R/W     POW_VDDCORE_DET                                             1'b0
    18      R/W     POW_VANA_DET                                                1'b0
    19      R/W     POW_VDDANA_DET                                              1'b1
    20      R/W     POW_VDDPA_DET                                               1'b0
    21      R/W     POW_HV18_DET                                                1'b0
    26:22   R/W     TUNE_VREFSS_VDDCORE_HQ                                      5'b11111
    31:27   R/W     SEL_VREF_VDDPA_HQ2                                          5'b11000
 */
typedef union _AON_REG_MBIAS_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t EN_BIAS_1UA: 1;
        uint32_t TUNE_VREFSS_VDDPA_HQ: 5;
        uint32_t TUNE_VREFSS_HV18_HQ: 5;
        uint32_t SEL_VREF_HV25_HQ: 5;
        uint32_t EN_BIAS_10UA: 1;
        uint32_t POW_VDDCORE_DET: 1;
        uint32_t POW_VANA_DET: 1;
        uint32_t POW_VDDANA_DET: 1;
        uint32_t POW_VDDPA_DET: 1;
        uint32_t POW_HV18_DET: 1;
        uint32_t TUNE_VREFSS_VDDCORE_HQ: 5;
        uint32_t SEL_VREF_VDDPA_HQ2: 5;
    };
} AON_REG_MBIAS_REG1X_TYPE;

/*0x4000_048c AON_REG_MBIAS_REG1X*/
#define AON_REG_MBIAS_REG1X_EN_BIAS_1UA_Pos                                                                              0U
#define AON_REG_MBIAS_REG1X_EN_BIAS_1UA_Msk                                                                              (0x1UL << AON_REG_MBIAS_REG1X_EN_BIAS_1UA_Pos)

#define AON_REG_MBIAS_REG1X_TUNE_VREFSS_VDDPA_HQ_Pos                                                                     1U
#define AON_REG_MBIAS_REG1X_TUNE_VREFSS_VDDPA_HQ_Msk                                                                     (0x1FUL << AON_REG_MBIAS_REG1X_TUNE_VREFSS_VDDPA_HQ_Pos)

#define AON_REG_MBIAS_REG1X_TUNE_VREFSS_HV18_HQ_Pos                                                                      6U
#define AON_REG_MBIAS_REG1X_TUNE_VREFSS_HV18_HQ_Msk                                                                      (0x1FUL << AON_REG_MBIAS_REG1X_TUNE_VREFSS_HV18_HQ_Pos)

#define AON_REG_MBIAS_REG1X_SEL_VREF_HV25_HQ_Pos                                                                         11U
#define AON_REG_MBIAS_REG1X_SEL_VREF_HV25_HQ_Msk                                                                         (0x1FUL << AON_REG_MBIAS_REG1X_SEL_VREF_HV25_HQ_Pos)

#define AON_REG_MBIAS_REG1X_EN_BIAS_10UA_Pos                                                                             16U
#define AON_REG_MBIAS_REG1X_EN_BIAS_10UA_Msk                                                                             (0x1UL << AON_REG_MBIAS_REG1X_EN_BIAS_10UA_Pos)

#define AON_REG_MBIAS_REG1X_POW_VDDCORE_DET_Pos                                                                          17U
#define AON_REG_MBIAS_REG1X_POW_VDDCORE_DET_Msk                                                                          (0x1UL << AON_REG_MBIAS_REG1X_POW_VDDCORE_DET_Pos)

#define AON_REG_MBIAS_REG1X_POW_VANA_DET_Pos                                                                             18U
#define AON_REG_MBIAS_REG1X_POW_VANA_DET_Msk                                                                             (0x1UL << AON_REG_MBIAS_REG1X_POW_VANA_DET_Pos)

#define AON_REG_MBIAS_REG1X_POW_VDDANA_DET_Pos                                                                           19U
#define AON_REG_MBIAS_REG1X_POW_VDDANA_DET_Msk                                                                           (0x1UL << AON_REG_MBIAS_REG1X_POW_VDDANA_DET_Pos)

#define AON_REG_MBIAS_REG1X_POW_VDDPA_DET_Pos                                                                            20U
#define AON_REG_MBIAS_REG1X_POW_VDDPA_DET_Msk                                                                            (0x1UL << AON_REG_MBIAS_REG1X_POW_VDDPA_DET_Pos)

#define AON_REG_MBIAS_REG1X_POW_HV18_DET_Pos                                                                             21U
#define AON_REG_MBIAS_REG1X_POW_HV18_DET_Msk                                                                             (0x1UL << AON_REG_MBIAS_REG1X_POW_HV18_DET_Pos)

#define AON_REG_MBIAS_REG1X_TUNE_VREFSS_VDDCORE_HQ_Pos                                                                   22U
#define AON_REG_MBIAS_REG1X_TUNE_VREFSS_VDDCORE_HQ_Msk                                                                   (0x1FUL << AON_REG_MBIAS_REG1X_TUNE_VREFSS_VDDCORE_HQ_Pos)

#define AON_REG_MBIAS_REG1X_SEL_VREF_VDDPA_HQ2_Pos                                                                       27U
#define AON_REG_MBIAS_REG1X_SEL_VREF_VDDPA_HQ2_Msk                                                                       (0x1FUL << AON_REG_MBIAS_REG1X_SEL_VREF_VDDPA_HQ2_Pos)

/* 0x490    0x4000_0490
    2:0     R/W     SEL_BG_R2                                                   3'b100
    3       R/W     EN_VDDCORE_DET_V33                                          1'b0
    6:4     R/W     SEL_VDDPA_VR_L                                              3'b100
    9:7     R/W     SEL_VDDPA_VR_H                                              3'b100
    12:10   R/W     SEL_HV18_VR_L                                               3'b100
    15:13   R/W     SEL_HV18_VR_H                                               3'b100
    18:16   R/W     TUNE_BG_REF2                                                3'b101
    19      R/W     REG5X_MBIAS_DUMMY0                                          1'b0
    22:20   R/W     SEL_VANA_VR_L                                               3'b010
    25:23   R/W     SEL_VANA_VR_H                                               3'b101
    28:26   R/W     SEL_VDDANA_VR_L                                             3'b100
    31:29   R/W     SEL_VDDANA_VR_H                                             3'b101
 */
typedef union _AON_REG_MBIAS_REG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SEL_BG_R2: 3;
        uint32_t EN_VDDCORE_DET_V33: 1;
        uint32_t SEL_VDDPA_VR_L: 3;
        uint32_t SEL_VDDPA_VR_H: 3;
        uint32_t SEL_HV18_VR_L: 3;
        uint32_t SEL_HV18_VR_H: 3;
        uint32_t TUNE_BG_REF2: 3;
        uint32_t REG5X_MBIAS_DUMMY0: 1;
        uint32_t SEL_VANA_VR_L: 3;
        uint32_t SEL_VANA_VR_H: 3;
        uint32_t SEL_VDDANA_VR_L: 3;
        uint32_t SEL_VDDANA_VR_H: 3;
    };
} AON_REG_MBIAS_REG2X_TYPE;

