rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0490 AON_REG_MBIAS_REG2X*/
#define AON_REG_MBIAS_REG2X_SEL_BG_R2_Pos                                                                                0U
#define AON_REG_MBIAS_REG2X_SEL_BG_R2_Msk                                                                                (0x7UL << AON_REG_MBIAS_REG2X_SEL_BG_R2_Pos)

#define AON_REG_MBIAS_REG2X_EN_VDDCORE_DET_V33_Pos                                                                       3U
#define AON_REG_MBIAS_REG2X_EN_VDDCORE_DET_V33_Msk                                                                       (0x1UL << AON_REG_MBIAS_REG2X_EN_VDDCORE_DET_V33_Pos)

#define AON_REG_MBIAS_REG2X_SEL_VDDPA_VR_L_Pos                                                                           4U
#define AON_REG_MBIAS_REG2X_SEL_VDDPA_VR_L_Msk                                                                           (0x7UL << AON_REG_MBIAS_REG2X_SEL_VDDPA_VR_L_Pos)

#define AON_REG_MBIAS_REG2X_SEL_VDDPA_VR_H_Pos                                                                           7U
#define AON_REG_MBIAS_REG2X_SEL_VDDPA_VR_H_Msk                                                                           (0x7UL << AON_REG_MBIAS_REG2X_SEL_VDDPA_VR_H_Pos)

#define AON_REG_MBIAS_REG2X_SEL_HV18_VR_L_Pos                                                                            10U
#define AON_REG_MBIAS_REG2X_SEL_HV18_VR_L_Msk                                                                            (0x7UL << AON_REG_MBIAS_REG2X_SEL_HV18_VR_L_Pos)

#define AON_REG_MBIAS_REG2X_SEL_HV18_VR_H_Pos                                                                            13U
#define AON_REG_MBIAS_REG2X_SEL_HV18_VR_H_Msk                                                                            (0x7UL << AON_REG_MBIAS_REG2X_SEL_HV18_VR_H_Pos)

#define AON_REG_MBIAS_REG2X_TUNE_BG_REF2_Pos                                                                             16U
#define AON_REG_MBIAS_REG2X_TUNE_BG_REF2_Msk                                                                             (0x7UL << AON_REG_MBIAS_REG2X_TUNE_BG_REF2_Pos)

#define AON_REG_MBIAS_REG2X_REG5X_MBIAS_DUMMY0_Pos                                                                       19U
#define AON_REG_MBIAS_REG2X_REG5X_MBIAS_DUMMY0_Msk                                                                       (0x1UL << AON_REG_MBIAS_REG2X_REG5X_MBIAS_DUMMY0_Pos)

#define AON_REG_MBIAS_REG2X_SEL_VANA_VR_L_Pos                                                                            20U
#define AON_REG_MBIAS_REG2X_SEL_VANA_VR_L_Msk                                                                            (0x7UL << AON_REG_MBIAS_REG2X_SEL_VANA_VR_L_Pos)

#define AON_REG_MBIAS_REG2X_SEL_VANA_VR_H_Pos                                                                            23U
#define AON_REG_MBIAS_REG2X_SEL_VANA_VR_H_Msk                                                                            (0x7UL << AON_REG_MBIAS_REG2X_SEL_VANA_VR_H_Pos)

#define AON_REG_MBIAS_REG2X_SEL_VDDANA_VR_L_Pos                                                                          26U
#define AON_REG_MBIAS_REG2X_SEL_VDDANA_VR_L_Msk                                                                          (0x7UL << AON_REG_MBIAS_REG2X_SEL_VDDANA_VR_L_Pos)

#define AON_REG_MBIAS_REG2X_SEL_VDDANA_VR_H_Pos                                                                          29U
#define AON_REG_MBIAS_REG2X_SEL_VDDANA_VR_H_Msk                                                                          (0x7UL << AON_REG_MBIAS_REG2X_SEL_VDDANA_VR_H_Pos)

/* 0x494    0x4000_0494
    2:0     R/W     TUNE_1U_RREF                                                3'b101
    3       R/W     REG6X_MBIAS_DUMMY0                                          1'b0
    8:4     R/W     SEL_VREF_VDDANA_LQ                                          5'b10011
    9       R/W     EN_VREF_EFLASH                                              1'b0
    12:10   R/W     SEL_VDDCORE_VR_L                                            3'b100
    15:13   R/W     SEL_VDDCORE_VR_H                                            3'b101
    31:16   R/W     REG7X_MBIAS_DUMMY0                                          16'b0000000000000000
 */
typedef union _AON_REG_MBIAS_REG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TUNE_1U_RREF: 3;
        uint32_t REG6X_MBIAS_DUMMY0: 1;
        uint32_t SEL_VREF_VDDANA_LQ: 5;
        uint32_t EN_VREF_EFLASH: 1;
        uint32_t SEL_VDDCORE_VR_L: 3;
        uint32_t SEL_VDDCORE_VR_H: 3;
        uint32_t REG7X_MBIAS_DUMMY0: 16;
    };
} AON_REG_MBIAS_REG3X_TYPE;

/*0x4000_0494 AON_REG_MBIAS_REG3X*/
#define AON_REG_MBIAS_REG3X_TUNE_1U_RREF_Pos                                                                             0U
#define AON_REG_MBIAS_REG3X_TUNE_1U_RREF_Msk                                                                             (0x7UL << AON_REG_MBIAS_REG3X_TUNE_1U_RREF_Pos)

#define AON_REG_MBIAS_REG3X_REG6X_MBIAS_DUMMY0_Pos                                                                       3U
#define AON_REG_MBIAS_REG3X_REG6X_MBIAS_DUMMY0_Msk                                                                       (0x1UL << AON_REG_MBIAS_REG3X_REG6X_MBIAS_DUMMY0_Pos)

#define AON_REG_MBIAS_REG3X_SEL_VREF_VDDANA_LQ_Pos                                                                       4U
#define AON_REG_MBIAS_REG3X_SEL_VREF_VDDANA_LQ_Msk                                                                       (0x1FUL << AON_REG_MBIAS_REG3X_SEL_VREF_VDDANA_LQ_Pos)

#define AON_REG_MBIAS_REG3X_EN_VREF_EFLASH_Pos                                                                           9U
#define AON_REG_MBIAS_REG3X_EN_VREF_EFLASH_Msk                                                                           (0x1UL << AON_REG_MBIAS_REG3X_EN_VREF_EFLASH_Pos)

#define AON_REG_MBIAS_REG3X_SEL_VDDCORE_VR_L_Pos                                                                         10U
#define AON_REG_MBIAS_REG3X_SEL_VDDCORE_VR_L_Msk                                                                         (0x7UL << AON_REG_MBIAS_REG3X_SEL_VDDCORE_VR_L_Pos)

