rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_MBIAS_REG3X_SEL_VDDCORE_VR_H_Pos                                                                         13U
#define AON_REG_MBIAS_REG3X_SEL_VDDCORE_VR_H_Msk                                                                         (0x7UL << AON_REG_MBIAS_REG3X_SEL_VDDCORE_VR_H_Pos)

#define AON_REG_MBIAS_REG3X_REG7X_MBIAS_DUMMY0_Pos                                                                       16U
#define AON_REG_MBIAS_REG3X_REG7X_MBIAS_DUMMY0_Msk                                                                       (0xFFFFUL << AON_REG_MBIAS_REG3X_REG7X_MBIAS_DUMMY0_Pos)

/* 0x498    0x4000_0498
    2:0     R       CKOUT0X_MBIAS_DUMMY0                                        3'b000
    3       R       PORB_VOUT2                                                  1'b0
    4       R       IPTAT_OK_DELAY                                              1'b0
    5       R       IPTAT_OK                                                    1'b0
    6       R       ENSIMO                                                      1'b0
    7       R       PORB_HV                                                     1'b0
    8       R       VDDCORE_DET                                                 1'b0
    9       R       VANA_DET                                                    1'b0
    10      R       VDDANA_DET                                                  1'b0
    11      R       VDDPA_DET                                                   1'b0
    12      R       HV18_DET                                                    1'b0
    13      R       FPORB_VOUT1                                                 1'b0
    14      R       PORB_VOUT1_DELAY                                            1'b0
    15      R       PORB_VOUT1                                                  1'b0
    31:16   R       CKOUT1X_MBIAS_DUMMY0                                        16'b0000000000000000
 */
typedef union _AON_C_KOUT0X_MBIAS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CKOUT0X_MBIAS_DUMMY0: 3;
        uint32_t PORB_VOUT2: 1;
        uint32_t IPTAT_OK_DELAY: 1;
        uint32_t IPTAT_OK: 1;
        uint32_t ENSIMO: 1;
        uint32_t PORB_HV: 1;
        uint32_t VDDCORE_DET: 1;
        uint32_t VANA_DET: 1;
        uint32_t VDDANA_DET: 1;
        uint32_t VDDPA_DET: 1;
        uint32_t HV18_DET: 1;
        uint32_t FPORB_VOUT1: 1;
        uint32_t PORB_VOUT1_DELAY: 1;
        uint32_t PORB_VOUT1: 1;
        uint32_t CKOUT1X_MBIAS_DUMMY0: 16;
    };
} AON_C_KOUT0X_MBIAS_TYPE;

/*0x4000_0498 AON_C_KOUT0X_MBIAS*/
#define AON_C_KOUT0X_MBIAS_CKOUT0X_MBIAS_DUMMY0_Pos                                                                      0U
#define AON_C_KOUT0X_MBIAS_CKOUT0X_MBIAS_DUMMY0_Msk                                                                      (0x7UL << AON_C_KOUT0X_MBIAS_CKOUT0X_MBIAS_DUMMY0_Pos)

#define AON_C_KOUT0X_MBIAS_PORB_VOUT2_Pos                                                                                3U
#define AON_C_KOUT0X_MBIAS_PORB_VOUT2_Msk                                                                                (0x1UL << AON_C_KOUT0X_MBIAS_PORB_VOUT2_Pos)

#define AON_C_KOUT0X_MBIAS_IPTAT_OK_DELAY_Pos                                                                            4U
#define AON_C_KOUT0X_MBIAS_IPTAT_OK_DELAY_Msk                                                                            (0x1UL << AON_C_KOUT0X_MBIAS_IPTAT_OK_DELAY_Pos)

#define AON_C_KOUT0X_MBIAS_IPTAT_OK_Pos                                                                                  5U
#define AON_C_KOUT0X_MBIAS_IPTAT_OK_Msk                                                                                  (0x1UL << AON_C_KOUT0X_MBIAS_IPTAT_OK_Pos)

#define AON_C_KOUT0X_MBIAS_ENSIMO_Pos                                                                                    6U
#define AON_C_KOUT0X_MBIAS_ENSIMO_Msk                                                                                    (0x1UL << AON_C_KOUT0X_MBIAS_ENSIMO_Pos)

#define AON_C_KOUT0X_MBIAS_PORB_HV_Pos                                                                                   7U
#define AON_C_KOUT0X_MBIAS_PORB_HV_Msk                                                                                   (0x1UL << AON_C_KOUT0X_MBIAS_PORB_HV_Pos)

#define AON_C_KOUT0X_MBIAS_VDDCORE_DET_Pos                                                                               8U
#define AON_C_KOUT0X_MBIAS_VDDCORE_DET_Msk                                                                               (0x1UL << AON_C_KOUT0X_MBIAS_VDDCORE_DET_Pos)

#define AON_C_KOUT0X_MBIAS_VANA_DET_Pos                                                                                  9U
#define AON_C_KOUT0X_MBIAS_VANA_DET_Msk                                                                                  (0x1UL << AON_C_KOUT0X_MBIAS_VANA_DET_Pos)

#define AON_C_KOUT0X_MBIAS_VDDANA_DET_Pos                                                                                10U
#define AON_C_KOUT0X_MBIAS_VDDANA_DET_Msk                                                                                (0x1UL << AON_C_KOUT0X_MBIAS_VDDANA_DET_Pos)

#define AON_C_KOUT0X_MBIAS_VDDPA_DET_Pos                                                                                 11U
#define AON_C_KOUT0X_MBIAS_VDDPA_DET_Msk                                                                                 (0x1UL << AON_C_KOUT0X_MBIAS_VDDPA_DET_Pos)

#define AON_C_KOUT0X_MBIAS_HV18_DET_Pos                                                                                  12U
#define AON_C_KOUT0X_MBIAS_HV18_DET_Msk                                                                                  (0x1UL << AON_C_KOUT0X_MBIAS_HV18_DET_Pos)

#define AON_C_KOUT0X_MBIAS_FPORB_VOUT1_Pos                                                                               13U
#define AON_C_KOUT0X_MBIAS_FPORB_VOUT1_Msk                                                                               (0x1UL << AON_C_KOUT0X_MBIAS_FPORB_VOUT1_Pos)

#define AON_C_KOUT0X_MBIAS_PORB_VOUT1_DELAY_Pos                                                                          14U
#define AON_C_KOUT0X_MBIAS_PORB_VOUT1_DELAY_Msk                                                                          (0x1UL << AON_C_KOUT0X_MBIAS_PORB_VOUT1_DELAY_Pos)

