rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_C_KOUT0X_MBIAS_PORB_VOUT1_Pos                                                                                15U
#define AON_C_KOUT0X_MBIAS_PORB_VOUT1_Msk                                                                                (0x1UL << AON_C_KOUT0X_MBIAS_PORB_VOUT1_Pos)

#define AON_C_KOUT0X_MBIAS_CKOUT1X_MBIAS_DUMMY0_Pos                                                                      16U
#define AON_C_KOUT0X_MBIAS_CKOUT1X_MBIAS_DUMMY0_Msk                                                                      (0xFFFFUL << AON_C_KOUT0X_MBIAS_CKOUT1X_MBIAS_DUMMY0_Pos)

/* 0x49C    0x4000_049c
    3:0     R/W     RESERVED_10                                                 4'b0
    7:4     R/W     RESERVED_9                                                  4'b0
    11:8    R/W     RESERVED_8                                                  4'b0
    14:12   R/W     RESERVED_7                                                  3'b0
    17:15   R/W     RESERVED_6                                                  3'b0
    20:18   R/W     RESERVED_5                                                  3'b0
    23:21   R/W     RESERVED_4                                                  3'b0
    26:24   R/W     RESERVED_3                                                  3'b0
    29:27   R       RESERVED_2                                                  3'b0
    30      R       RESERVED_1                                                  1'b0
    31      R/W     RESERVED                                                    1'b0
 */
typedef union _AON_C_KOUT1X_MBIAS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_10: 4;
        uint32_t RESERVED_9: 4;
        uint32_t RESERVED_8: 4;
        uint32_t RESERVED_7: 3;
        uint32_t RESERVED_6: 3;
        uint32_t RESERVED_5: 3;
        uint32_t RESERVED_4: 3;
        uint32_t RESERVED_3: 3;
        uint32_t RESERVED_2: 3;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
    };
} AON_C_KOUT1X_MBIAS_TYPE;

/*0x4000_049c AON_C_KOUT1X_MBIAS*/
#define AON_C_KOUT1X_MBIAS_RESERVED_10_Pos                                                                               0U
#define AON_C_KOUT1X_MBIAS_RESERVED_10_Msk                                                                               (0xFUL << AON_C_KOUT1X_MBIAS_RESERVED_10_Pos)

#define AON_C_KOUT1X_MBIAS_RESERVED_9_Pos                                                                                4U
#define AON_C_KOUT1X_MBIAS_RESERVED_9_Msk                                                                                (0xFUL << AON_C_KOUT1X_MBIAS_RESERVED_9_Pos)

#define AON_C_KOUT1X_MBIAS_RESERVED_8_Pos                                                                                8U
#define AON_C_KOUT1X_MBIAS_RESERVED_8_Msk                                                                                (0xFUL << AON_C_KOUT1X_MBIAS_RESERVED_8_Pos)

#define AON_C_KOUT1X_MBIAS_RESERVED_7_Pos                                                                                12U
#define AON_C_KOUT1X_MBIAS_RESERVED_7_Msk                                                                                (0x7UL << AON_C_KOUT1X_MBIAS_RESERVED_7_Pos)

#define AON_C_KOUT1X_MBIAS_RESERVED_6_Pos                                                                                15U
#define AON_C_KOUT1X_MBIAS_RESERVED_6_Msk                                                                                (0x7UL << AON_C_KOUT1X_MBIAS_RESERVED_6_Pos)

#define AON_C_KOUT1X_MBIAS_RESERVED_5_Pos                                                                                18U
#define AON_C_KOUT1X_MBIAS_RESERVED_5_Msk                                                                                (0x7UL << AON_C_KOUT1X_MBIAS_RESERVED_5_Pos)

#define AON_C_KOUT1X_MBIAS_RESERVED_4_Pos                                                                                21U
#define AON_C_KOUT1X_MBIAS_RESERVED_4_Msk                                                                                (0x7UL << AON_C_KOUT1X_MBIAS_RESERVED_4_Pos)

#define AON_C_KOUT1X_MBIAS_RESERVED_3_Pos                                                                                24U
#define AON_C_KOUT1X_MBIAS_RESERVED_3_Msk                                                                                (0x7UL << AON_C_KOUT1X_MBIAS_RESERVED_3_Pos)

#define AON_C_KOUT1X_MBIAS_RESERVED_2_Pos                                                                                27U
#define AON_C_KOUT1X_MBIAS_RESERVED_2_Msk                                                                                (0x7UL << AON_C_KOUT1X_MBIAS_RESERVED_2_Pos)

#define AON_C_KOUT1X_MBIAS_RESERVED_1_Pos                                                                                30U
#define AON_C_KOUT1X_MBIAS_RESERVED_1_Msk                                                                                (0x1UL << AON_C_KOUT1X_MBIAS_RESERVED_1_Pos)

#define AON_C_KOUT1X_MBIAS_RESERVED_Pos                                                                                  31U
#define AON_C_KOUT1X_MBIAS_RESERVED_Msk                                                                                  (0x1UL << AON_C_KOUT1X_MBIAS_RESERVED_Pos)

/* 0x4BC    0x4000_04bc
    7:0     R/W     OSC10M_RCAL                                                 8'd24
    9:8     R/W     OSC10M_SEL_TOK                                              2'b10
    15:10   R/W     REG0X_OSC10M_DUMMY0                                         6'b0
    31:16   R/W     REG1X_OSC10M_DUMMY0                                         16'b0
 */
typedef union _AON_REG0X_OSC10M_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC10M_RCAL: 8;
        uint32_t OSC10M_SEL_TOK: 2;
        uint32_t REG0X_OSC10M_DUMMY0: 6;
        uint32_t REG1X_OSC10M_DUMMY0: 16;
    };
} AON_REG0X_OSC10M_TYPE;

/*0x4000_04bc AON_REG0X_OSC10M*/
#define AON_REG0X_OSC10M_OSC10M_RCAL_Pos                                                                                 0U
#define AON_REG0X_OSC10M_OSC10M_RCAL_Msk                                                                                 (0xFFUL << AON_REG0X_OSC10M_OSC10M_RCAL_Pos)

#define AON_REG0X_OSC10M_OSC10M_SEL_TOK_Pos                                                                              8U
#define AON_REG0X_OSC10M_OSC10M_SEL_TOK_Msk                                                                              (0x3UL << AON_REG0X_OSC10M_OSC10M_SEL_TOK_Pos)

#define AON_REG0X_OSC10M_REG0X_OSC10M_DUMMY0_Pos                                                                         10U
#define AON_REG0X_OSC10M_REG0X_OSC10M_DUMMY0_Msk                                                                         (0x3FUL << AON_REG0X_OSC10M_REG0X_OSC10M_DUMMY0_Pos)

#define AON_REG0X_OSC10M_REG1X_OSC10M_DUMMY0_Pos                                                                         16U
#define AON_REG0X_OSC10M_REG1X_OSC10M_DUMMY0_Msk                                                                         (0xFFFFUL << AON_REG0X_OSC10M_REG1X_OSC10M_DUMMY0_Pos)

/* 0x4C0    0x4000_04c0
    15:0    R/W     REG2X_OSC10M_DUMMY0                                         16'b0
    31:16   R       RSVD                                                        16'b0
 */
typedef union _AON_REG2X_OSC10M_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG2X_OSC10M_DUMMY0: 16;
        uint32_t RSVD: 16;
    };
} AON_REG2X_OSC10M_TYPE;

