rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_04c0 AON_REG2X_OSC10M*/
#define AON_REG2X_OSC10M_REG2X_OSC10M_DUMMY0_Pos                                                                         0U
#define AON_REG2X_OSC10M_REG2X_OSC10M_DUMMY0_Msk                                                                         (0xFFFFUL << AON_REG2X_OSC10M_REG2X_OSC10M_DUMMY0_Pos)

#define AON_REG2X_OSC10M_RSVD_Pos                                                                                        16U
#define AON_REG2X_OSC10M_RSVD_Msk                                                                                        (0xFFFFUL << AON_REG2X_OSC10M_RSVD_Pos)

/* 0x4C4    0x4000_04c4
    5:0     R/W     OSC128K_RCAL                                                6'h20
    6       R/W     OSC128K_EN_DIV4_CKOUT                                       1'b0
    15:7    R/W     REG0X_OSC128K_DUMMY0                                        9'b0
    31:16   R       RSVD                                                        16'b0
 */
typedef union _AON_REG0X_OSC128K_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC128K_RCAL: 6;
        uint32_t OSC128K_EN_DIV4_CKOUT: 1;
        uint32_t REG0X_OSC128K_DUMMY0: 9;
        uint32_t RSVD: 16;
    };
} AON_REG0X_OSC128K_TYPE;

/*0x4000_04c4 AON_REG0X_OSC128K*/
#define AON_REG0X_OSC128K_OSC128K_RCAL_Pos                                                                               0U
#define AON_REG0X_OSC128K_OSC128K_RCAL_Msk                                                                               (0x3FUL << AON_REG0X_OSC128K_OSC128K_RCAL_Pos)

#define AON_REG0X_OSC128K_OSC128K_EN_DIV4_CKOUT_Pos                                                                      6U
#define AON_REG0X_OSC128K_OSC128K_EN_DIV4_CKOUT_Msk                                                                      (0x1UL << AON_REG0X_OSC128K_OSC128K_EN_DIV4_CKOUT_Pos)

#define AON_REG0X_OSC128K_REG0X_OSC128K_DUMMY0_Pos                                                                       7U
#define AON_REG0X_OSC128K_REG0X_OSC128K_DUMMY0_Msk                                                                       (0x1FFUL << AON_REG0X_OSC128K_REG0X_OSC128K_DUMMY0_Pos)

#define AON_REG0X_OSC128K_RSVD_Pos                                                                                       16U
#define AON_REG0X_OSC128K_RSVD_Msk                                                                                       (0xFFFFUL << AON_REG0X_OSC128K_RSVD_Pos)

/* 0x4C8    0x4000_04c8
    0       R/W     POW_32KOSC                                                  1'b1
    1       R/W     POW_10MOSC                                                  1'b0
    15:2    R/W     REG_POW_OSC_DUMMY0                                          14'b0
    31:16   R       RSVD                                                        16'h0
 */
typedef union _AON_REG_POW_OSC_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t POW_32KOSC: 1;
        uint32_t POW_10MOSC: 1;
        uint32_t REG_POW_OSC_DUMMY0: 14;
        uint32_t RSVD: 16;
    };
} AON_REG_POW_OSC_TYPE;

/*0x4000_04c8 AON_REG_POW_OSC*/
#define AON_REG_POW_OSC_POW_32KOSC_Pos                                                                                   0U
#define AON_REG_POW_OSC_POW_32KOSC_Msk                                                                                   (0x1UL << AON_REG_POW_OSC_POW_32KOSC_Pos)

#define AON_REG_POW_OSC_POW_10MOSC_Pos                                                                                   1U
#define AON_REG_POW_OSC_POW_10MOSC_Msk                                                                                   (0x1UL << AON_REG_POW_OSC_POW_10MOSC_Pos)

#define AON_REG_POW_OSC_REG_POW_OSC_DUMMY0_Pos                                                                           2U
#define AON_REG_POW_OSC_REG_POW_OSC_DUMMY0_Msk                                                                           (0x3FFFUL << AON_REG_POW_OSC_REG_POW_OSC_DUMMY0_Pos)

#define AON_REG_POW_OSC_RSVD_Pos                                                                                         16U
#define AON_REG_POW_OSC_RSVD_Msk                                                                                         (0xFFFFUL << AON_REG_POW_OSC_RSVD_Pos)

/* 0x4CC    0x4000_04cc
    0       R       OK_32K                                                      1'b0
    1       R       OK_10MOSC                                                   1'b0
    14:2    R       RSVD_1                                                      13'b0
    15      W1C     PORST_ACTIVE                                                1'b1
    31:16   R       RSVD                                                        16'h0
 */
typedef union _AON_C_KOUT0X_OSC128K10M_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OK_32K: 1;
        uint32_t OK_10MOSC: 1;
        uint32_t RSVD_1: 13;
        uint32_t PORST_ACTIVE: 1;
        uint32_t RSVD: 16;
    };
} AON_C_KOUT0X_OSC128K10M_TYPE;

/*0x4000_04cc AON_C_KOUT0X_OSC128K10M*/
#define AON_C_KOUT0X_OSC128K10M_OK_32K_Pos                                                                               0U
#define AON_C_KOUT0X_OSC128K10M_OK_32K_Msk                                                                               (0x1UL << AON_C_KOUT0X_OSC128K10M_OK_32K_Pos)

#define AON_C_KOUT0X_OSC128K10M_OK_10MOSC_Pos                                                                            1U
#define AON_C_KOUT0X_OSC128K10M_OK_10MOSC_Msk                                                                            (0x1UL << AON_C_KOUT0X_OSC128K10M_OK_10MOSC_Pos)

#define AON_C_KOUT0X_OSC128K10M_RSVD_1_Pos                                                                               2U
#define AON_C_KOUT0X_OSC128K10M_RSVD_1_Msk                                                                               (0x1FFFUL << AON_C_KOUT0X_OSC128K10M_RSVD_1_Pos)

#define AON_C_KOUT0X_OSC128K10M_PORST_ACTIVE_Pos                                                                         15U
#define AON_C_KOUT0X_OSC128K10M_PORST_ACTIVE_Msk                                                                         (0x1UL << AON_C_KOUT0X_OSC128K10M_PORST_ACTIVE_Pos)

#define AON_C_KOUT0X_OSC128K10M_RSVD_Pos                                                                                 16U
#define AON_C_KOUT0X_OSC128K10M_RSVD_Msk                                                                                 (0xFFFFUL << AON_C_KOUT0X_OSC128K10M_RSVD_Pos)

/* 0x500    0x4000_0500
    0       R/W     OSC128_CAL_RESET_N                                          1'b1
    1       R/W     SW_LIN_CAL_EN                                               1'b0
    2       R/W     SW_SDM_CAL_EN                                               1'b0
    3       R/W     OSC128K_CAL_TMETER_MODE                                     1'h0
    4       R/W     OSC128K_CAL_DUMMY2                                          1'b0
    6:5     R/W     DBG_SEL                                                     2'b00
    31:7    R       RSVD                                                        25'b0
 */
typedef union _AON_REG0X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC128_CAL_RESET_N: 1;
        uint32_t SW_LIN_CAL_EN: 1;
        uint32_t SW_SDM_CAL_EN: 1;
        uint32_t OSC128K_CAL_TMETER_MODE: 1;
        uint32_t OSC128K_CAL_DUMMY2: 1;
        uint32_t DBG_SEL: 2;
        uint32_t RSVD: 25;
    };
} AON_REG0X_OSC128K_CAL_TYPE;

/*0x4000_0500 AON_REG0X_OSC128K_CAL*/
#define AON_REG0X_OSC128K_CAL_OSC128_CAL_RESET_N_Pos                                                                     0U
#define AON_REG0X_OSC128K_CAL_OSC128_CAL_RESET_N_Msk                                                                     (0x1UL << AON_REG0X_OSC128K_CAL_OSC128_CAL_RESET_N_Pos)

#define AON_REG0X_OSC128K_CAL_SW_LIN_CAL_EN_Pos                                                                          1U
#define AON_REG0X_OSC128K_CAL_SW_LIN_CAL_EN_Msk                                                                          (0x1UL << AON_REG0X_OSC128K_CAL_SW_LIN_CAL_EN_Pos)

