rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG0X_OSC128K_CAL_SW_SDM_CAL_EN_Pos                                                                          2U
#define AON_REG0X_OSC128K_CAL_SW_SDM_CAL_EN_Msk                                                                          (0x1UL << AON_REG0X_OSC128K_CAL_SW_SDM_CAL_EN_Pos)

#define AON_REG0X_OSC128K_CAL_OSC128K_CAL_TMETER_MODE_Pos                                                                3U
#define AON_REG0X_OSC128K_CAL_OSC128K_CAL_TMETER_MODE_Msk                                                                (0x1UL << AON_REG0X_OSC128K_CAL_OSC128K_CAL_TMETER_MODE_Pos)

#define AON_REG0X_OSC128K_CAL_OSC128K_CAL_DUMMY2_Pos                                                                     4U
#define AON_REG0X_OSC128K_CAL_OSC128K_CAL_DUMMY2_Msk                                                                     (0x1UL << AON_REG0X_OSC128K_CAL_OSC128K_CAL_DUMMY2_Pos)

#define AON_REG0X_OSC128K_CAL_DBG_SEL_Pos                                                                                5U
#define AON_REG0X_OSC128K_CAL_DBG_SEL_Msk                                                                                (0x3UL << AON_REG0X_OSC128K_CAL_DBG_SEL_Pos)

#define AON_REG0X_OSC128K_CAL_RSVD_Pos                                                                                   7U
#define AON_REG0X_OSC128K_CAL_RSVD_Msk                                                                                   (0x1FFFFFFUL << AON_REG0X_OSC128K_CAL_RSVD_Pos)

/* 0x504    0x4000_0504
    3:0     R/W     RCAL_H                                                      4'h9
    10:4    R/W     RCAL_SETTLE_CYC                                             7'h3f
    11      R       RSVD_1                                                      1'b0
    15:12   R/W     INC_STEP                                                    4'h0
    21:16   R/W     KT_LIM                                                      6'h30
    25:22   R/W     DELTA_RCAL_H                                                4'hA
    31:26   R       RSVD                                                        6'b0
 */
typedef union _AON_REG2X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RCAL_H: 4;
        uint32_t RCAL_SETTLE_CYC: 7;
        uint32_t RSVD_1: 1;
        uint32_t INC_STEP: 4;
        uint32_t KT_LIM: 6;
        uint32_t DELTA_RCAL_H: 4;
        uint32_t RSVD: 6;
    };
} AON_REG2X_OSC128K_CAL_TYPE;

/*0x4000_0504 AON_REG2X_OSC128K_CAL*/
#define AON_REG2X_OSC128K_CAL_RCAL_H_Pos                                                                                 0U
#define AON_REG2X_OSC128K_CAL_RCAL_H_Msk                                                                                 (0xFUL << AON_REG2X_OSC128K_CAL_RCAL_H_Pos)

#define AON_REG2X_OSC128K_CAL_RCAL_SETTLE_CYC_Pos                                                                        4U
#define AON_REG2X_OSC128K_CAL_RCAL_SETTLE_CYC_Msk                                                                        (0x7FUL << AON_REG2X_OSC128K_CAL_RCAL_SETTLE_CYC_Pos)

#define AON_REG2X_OSC128K_CAL_RSVD_1_Pos                                                                                 11U
#define AON_REG2X_OSC128K_CAL_RSVD_1_Msk                                                                                 (0x1UL << AON_REG2X_OSC128K_CAL_RSVD_1_Pos)

#define AON_REG2X_OSC128K_CAL_INC_STEP_Pos                                                                               12U
#define AON_REG2X_OSC128K_CAL_INC_STEP_Msk                                                                               (0xFUL << AON_REG2X_OSC128K_CAL_INC_STEP_Pos)

#define AON_REG2X_OSC128K_CAL_KT_LIM_Pos                                                                                 16U
#define AON_REG2X_OSC128K_CAL_KT_LIM_Msk                                                                                 (0x3FUL << AON_REG2X_OSC128K_CAL_KT_LIM_Pos)

#define AON_REG2X_OSC128K_CAL_DELTA_RCAL_H_Pos                                                                           22U
#define AON_REG2X_OSC128K_CAL_DELTA_RCAL_H_Msk                                                                           (0xFUL << AON_REG2X_OSC128K_CAL_DELTA_RCAL_H_Pos)

#define AON_REG2X_OSC128K_CAL_RSVD_Pos                                                                                   26U
#define AON_REG2X_OSC128K_CAL_RSVD_Msk                                                                                   (0x3FUL << AON_REG2X_OSC128K_CAL_RSVD_Pos)

/* 0x508    0x4000_0508
    16:0    R/W     CENTER_CNT_FREF                                             17'h1388
    23:17   R       RSVD_1                                                      7'b0
    27:24   R/W     LIN_K_CNT_CYC                                               4'h3
    31:28   R/W     RSVD                                                        4'h0
 */
typedef union _AON_REG4X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CENTER_CNT_FREF: 17;
        uint32_t RSVD_1: 7;
        uint32_t LIN_K_CNT_CYC: 4;
        uint32_t RSVD: 4;
    };
} AON_REG4X_OSC128K_CAL_TYPE;

/*0x4000_0508 AON_REG4X_OSC128K_CAL*/
#define AON_REG4X_OSC128K_CAL_CENTER_CNT_FREF_Pos                                                                        0U
#define AON_REG4X_OSC128K_CAL_CENTER_CNT_FREF_Msk                                                                        (0x1FFFFUL << AON_REG4X_OSC128K_CAL_CENTER_CNT_FREF_Pos)

#define AON_REG4X_OSC128K_CAL_RSVD_1_Pos                                                                                 17U
#define AON_REG4X_OSC128K_CAL_RSVD_1_Msk                                                                                 (0x7FUL << AON_REG4X_OSC128K_CAL_RSVD_1_Pos)

#define AON_REG4X_OSC128K_CAL_LIN_K_CNT_CYC_Pos                                                                          24U
#define AON_REG4X_OSC128K_CAL_LIN_K_CNT_CYC_Msk                                                                          (0xFUL << AON_REG4X_OSC128K_CAL_LIN_K_CNT_CYC_Pos)

#define AON_REG4X_OSC128K_CAL_RSVD_Pos                                                                                   28U
#define AON_REG4X_OSC128K_CAL_RSVD_Msk                                                                                   (0xFUL << AON_REG4X_OSC128K_CAL_RSVD_Pos)

