rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x50C    0x4000_050c
    9:0     R/W     CRITER0                                                     10'h96
    15:10   R       RSVD                                                        6'b0
    30:16   R/W     RCAL_INIT                                                   15'h20
    31      R/W     TEST_MODE                                                   1'h0
 */
typedef union _AON_REG6X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CRITER0: 10;
        uint32_t RSVD: 6;
        uint32_t RCAL_INIT: 15;
        uint32_t TEST_MODE: 1;
    };
} AON_REG6X_OSC128K_CAL_TYPE;

/*0x4000_050c AON_REG6X_OSC128K_CAL*/
#define AON_REG6X_OSC128K_CAL_CRITER0_Pos                                                                                0U
#define AON_REG6X_OSC128K_CAL_CRITER0_Msk                                                                                (0x3FFUL << AON_REG6X_OSC128K_CAL_CRITER0_Pos)

#define AON_REG6X_OSC128K_CAL_RSVD_Pos                                                                                   10U
#define AON_REG6X_OSC128K_CAL_RSVD_Msk                                                                                   (0x3FUL << AON_REG6X_OSC128K_CAL_RSVD_Pos)

#define AON_REG6X_OSC128K_CAL_RCAL_INIT_Pos                                                                              16U
#define AON_REG6X_OSC128K_CAL_RCAL_INIT_Msk                                                                              (0x7FFFUL << AON_REG6X_OSC128K_CAL_RCAL_INIT_Pos)

#define AON_REG6X_OSC128K_CAL_TEST_MODE_Pos                                                                              31U
#define AON_REG6X_OSC128K_CAL_TEST_MODE_Msk                                                                              (0x1UL << AON_REG6X_OSC128K_CAL_TEST_MODE_Pos)

/* 0x510    0x4000_0510
    2:0     R/W     SDM_K_CNT_CYC                                               3'h3
    3       R       RSVD_3                                                      1'b0
    6:4     R/W     SDM_K_CNT_CYC_ALPHA                                         3'h0
    7       R       RSVD_2                                                      1'b0
    12:8    R/W     ALPHA_PARAM_SET                                             5'd28
    13      R/W     ALPHA_FB_MANUAL_EN                                          1'b0
    14      R/W     ALPHA_ONLY_SEL_EN                                           1'b0
    15      R       RSVD_1                                                      1'b0
    19:16   R/W     SDM2ALPHA_CNT_TARGET                                        4'h7
    31:20   R/W     RSVD                                                        12'h0
 */
typedef union _AON_REG8X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SDM_K_CNT_CYC: 3;
        uint32_t RSVD_3: 1;
        uint32_t SDM_K_CNT_CYC_ALPHA: 3;
        uint32_t RSVD_2: 1;
        uint32_t ALPHA_PARAM_SET: 5;
        uint32_t ALPHA_FB_MANUAL_EN: 1;
        uint32_t ALPHA_ONLY_SEL_EN: 1;
        uint32_t RSVD_1: 1;
        uint32_t SDM2ALPHA_CNT_TARGET: 4;
        uint32_t RSVD: 12;
    };
} AON_REG8X_OSC128K_CAL_TYPE;

/*0x4000_0510 AON_REG8X_OSC128K_CAL*/
#define AON_REG8X_OSC128K_CAL_SDM_K_CNT_CYC_Pos                                                                          0U
#define AON_REG8X_OSC128K_CAL_SDM_K_CNT_CYC_Msk                                                                          (0x7UL << AON_REG8X_OSC128K_CAL_SDM_K_CNT_CYC_Pos)

#define AON_REG8X_OSC128K_CAL_RSVD_3_Pos                                                                                 3U
#define AON_REG8X_OSC128K_CAL_RSVD_3_Msk                                                                                 (0x1UL << AON_REG8X_OSC128K_CAL_RSVD_3_Pos)

#define AON_REG8X_OSC128K_CAL_SDM_K_CNT_CYC_ALPHA_Pos                                                                    4U
#define AON_REG8X_OSC128K_CAL_SDM_K_CNT_CYC_ALPHA_Msk                                                                    (0x7UL << AON_REG8X_OSC128K_CAL_SDM_K_CNT_CYC_ALPHA_Pos)

#define AON_REG8X_OSC128K_CAL_RSVD_2_Pos                                                                                 7U
#define AON_REG8X_OSC128K_CAL_RSVD_2_Msk                                                                                 (0x1UL << AON_REG8X_OSC128K_CAL_RSVD_2_Pos)

#define AON_REG8X_OSC128K_CAL_ALPHA_PARAM_SET_Pos                                                                        8U
#define AON_REG8X_OSC128K_CAL_ALPHA_PARAM_SET_Msk                                                                        (0x1FUL << AON_REG8X_OSC128K_CAL_ALPHA_PARAM_SET_Pos)

#define AON_REG8X_OSC128K_CAL_ALPHA_FB_MANUAL_EN_Pos                                                                     13U
#define AON_REG8X_OSC128K_CAL_ALPHA_FB_MANUAL_EN_Msk                                                                     (0x1UL << AON_REG8X_OSC128K_CAL_ALPHA_FB_MANUAL_EN_Pos)

#define AON_REG8X_OSC128K_CAL_ALPHA_ONLY_SEL_EN_Pos                                                                      14U
#define AON_REG8X_OSC128K_CAL_ALPHA_ONLY_SEL_EN_Msk                                                                      (0x1UL << AON_REG8X_OSC128K_CAL_ALPHA_ONLY_SEL_EN_Pos)

#define AON_REG8X_OSC128K_CAL_RSVD_1_Pos                                                                                 15U
#define AON_REG8X_OSC128K_CAL_RSVD_1_Msk                                                                                 (0x1UL << AON_REG8X_OSC128K_CAL_RSVD_1_Pos)

#define AON_REG8X_OSC128K_CAL_SDM2ALPHA_CNT_TARGET_Pos                                                                   16U
#define AON_REG8X_OSC128K_CAL_SDM2ALPHA_CNT_TARGET_Msk                                                                   (0xFUL << AON_REG8X_OSC128K_CAL_SDM2ALPHA_CNT_TARGET_Pos)

#define AON_REG8X_OSC128K_CAL_RSVD_Pos                                                                                   20U
#define AON_REG8X_OSC128K_CAL_RSVD_Msk                                                                                   (0xFFFUL << AON_REG8X_OSC128K_CAL_RSVD_Pos)

/* 0x514    0x4000_0514
    16:0    R/W     ALPHA_FB_MANUAL                                             17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG10X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ALPHA_FB_MANUAL: 17;
        uint32_t RSVD: 15;
    };
} AON_REG10X_OSC128K_CAL_TYPE;

