rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0514 AON_REG10X_OSC128K_CAL*/
#define AON_REG10X_OSC128K_CAL_ALPHA_FB_MANUAL_Pos                                                                       0U
#define AON_REG10X_OSC128K_CAL_ALPHA_FB_MANUAL_Msk                                                                       (0x1FFFFUL << AON_REG10X_OSC128K_CAL_ALPHA_FB_MANUAL_Pos)

#define AON_REG10X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG10X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG10X_OSC128K_CAL_RSVD_Pos)

/* 0x518    0x4000_0518
    14:0    R/W     MANUAL_SDM_FRAC                                             15'h0
    15      R       RSVD_1                                                      1'h0
    19:16   R/W     MANUAL_SDM_INT                                              4'h0
    30:20   R       RSVD                                                        11'h0
    31      R/W     MANUAL_SDM_MODE                                             1'h0
 */
typedef union _AON_REG12X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t MANUAL_SDM_FRAC: 15;
        uint32_t RSVD_1: 1;
        uint32_t MANUAL_SDM_INT: 4;
        uint32_t RSVD: 11;
        uint32_t MANUAL_SDM_MODE: 1;
    };
} AON_REG12X_OSC128K_CAL_TYPE;

/*0x4000_0518 AON_REG12X_OSC128K_CAL*/
#define AON_REG12X_OSC128K_CAL_MANUAL_SDM_FRAC_Pos                                                                       0U
#define AON_REG12X_OSC128K_CAL_MANUAL_SDM_FRAC_Msk                                                                       (0x7FFFUL << AON_REG12X_OSC128K_CAL_MANUAL_SDM_FRAC_Pos)

#define AON_REG12X_OSC128K_CAL_RSVD_1_Pos                                                                                15U
#define AON_REG12X_OSC128K_CAL_RSVD_1_Msk                                                                                (0x1UL << AON_REG12X_OSC128K_CAL_RSVD_1_Pos)

#define AON_REG12X_OSC128K_CAL_MANUAL_SDM_INT_Pos                                                                        16U
#define AON_REG12X_OSC128K_CAL_MANUAL_SDM_INT_Msk                                                                        (0xFUL << AON_REG12X_OSC128K_CAL_MANUAL_SDM_INT_Pos)

#define AON_REG12X_OSC128K_CAL_RSVD_Pos                                                                                  20U
#define AON_REG12X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFUL << AON_REG12X_OSC128K_CAL_RSVD_Pos)

#define AON_REG12X_OSC128K_CAL_MANUAL_SDM_MODE_Pos                                                                       31U
#define AON_REG12X_OSC128K_CAL_MANUAL_SDM_MODE_Msk                                                                       (0x1UL << AON_REG12X_OSC128K_CAL_MANUAL_SDM_MODE_Pos)

/* 0x51C    0x4000_051c
    14:0    R       RCAL_O                                                      15'h0
    15      R       RSVD_1                                                      1'h0
    21:16   R       KT_CNT                                                      6'h0
    23:22   R       LOCK                                                        2'h0
    28:24   R       SDM_CAL_CNT                                                 5'h0
    31:29   R       RSVD                                                        3'h0
 */
typedef union _AON_REG14X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RCAL_O: 15;
        uint32_t RSVD_1: 1;
        uint32_t KT_CNT: 6;
        uint32_t LOCK: 2;
        uint32_t SDM_CAL_CNT: 5;
        uint32_t RSVD: 3;
    };
} AON_REG14X_OSC128K_CAL_TYPE;

/*0x4000_051c AON_REG14X_OSC128K_CAL*/
#define AON_REG14X_OSC128K_CAL_RCAL_O_Pos                                                                                0U
#define AON_REG14X_OSC128K_CAL_RCAL_O_Msk                                                                                (0x7FFFUL << AON_REG14X_OSC128K_CAL_RCAL_O_Pos)

#define AON_REG14X_OSC128K_CAL_RSVD_1_Pos                                                                                15U
#define AON_REG14X_OSC128K_CAL_RSVD_1_Msk                                                                                (0x1UL << AON_REG14X_OSC128K_CAL_RSVD_1_Pos)

#define AON_REG14X_OSC128K_CAL_KT_CNT_Pos                                                                                16U
#define AON_REG14X_OSC128K_CAL_KT_CNT_Msk                                                                                (0x3FUL << AON_REG14X_OSC128K_CAL_KT_CNT_Pos)

#define AON_REG14X_OSC128K_CAL_LOCK_Pos                                                                                  22U
#define AON_REG14X_OSC128K_CAL_LOCK_Msk                                                                                  (0x3UL << AON_REG14X_OSC128K_CAL_LOCK_Pos)

#define AON_REG14X_OSC128K_CAL_SDM_CAL_CNT_Pos                                                                           24U
#define AON_REG14X_OSC128K_CAL_SDM_CAL_CNT_Msk                                                                           (0x1FUL << AON_REG14X_OSC128K_CAL_SDM_CAL_CNT_Pos)

#define AON_REG14X_OSC128K_CAL_RSVD_Pos                                                                                  29U
#define AON_REG14X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7UL << AON_REG14X_OSC128K_CAL_RSVD_Pos)

/* 0x520    0x4000_0520
    14:0    R       SDM_FRAC                                                    15'h0
    15      R       RSVD_1                                                      1'h0
    19:16   R       SDM_INT                                                     4'h0
    31:20   R       RSVD                                                        12'h0
 */
typedef union _AON_REG16X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SDM_FRAC: 15;
        uint32_t RSVD_1: 1;
        uint32_t SDM_INT: 4;
        uint32_t RSVD: 12;
    };
} AON_REG16X_OSC128K_CAL_TYPE;

/*0x4000_0520 AON_REG16X_OSC128K_CAL*/
#define AON_REG16X_OSC128K_CAL_SDM_FRAC_Pos                                                                              0U
#define AON_REG16X_OSC128K_CAL_SDM_FRAC_Msk                                                                              (0x7FFFUL << AON_REG16X_OSC128K_CAL_SDM_FRAC_Pos)

#define AON_REG16X_OSC128K_CAL_RSVD_1_Pos                                                                                15U
#define AON_REG16X_OSC128K_CAL_RSVD_1_Msk                                                                                (0x1UL << AON_REG16X_OSC128K_CAL_RSVD_1_Pos)

#define AON_REG16X_OSC128K_CAL_SDM_INT_Pos                                                                               16U
#define AON_REG16X_OSC128K_CAL_SDM_INT_Msk                                                                               (0xFUL << AON_REG16X_OSC128K_CAL_SDM_INT_Pos)

