rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG16X_OSC128K_CAL_RSVD_Pos                                                                                  20U
#define AON_REG16X_OSC128K_CAL_RSVD_Msk                                                                                  (0xFFFUL << AON_REG16X_OSC128K_CAL_RSVD_Pos)

/* 0x524    0x4000_0524
    16:0    R       CNT_FREF_REP_0                                              17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG18X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CNT_FREF_REP_0: 17;
        uint32_t RSVD: 15;
    };
} AON_REG18X_OSC128K_CAL_TYPE;

/*0x4000_0524 AON_REG18X_OSC128K_CAL*/
#define AON_REG18X_OSC128K_CAL_CNT_FREF_REP_0_Pos                                                                        0U
#define AON_REG18X_OSC128K_CAL_CNT_FREF_REP_0_Msk                                                                        (0x1FFFFUL << AON_REG18X_OSC128K_CAL_CNT_FREF_REP_0_Pos)

#define AON_REG18X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG18X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG18X_OSC128K_CAL_RSVD_Pos)

/* 0x528    0x4000_0528
    16:0    R       CNT_FREF_REP_1                                              17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG20X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CNT_FREF_REP_1: 17;
        uint32_t RSVD: 15;
    };
} AON_REG20X_OSC128K_CAL_TYPE;

/*0x4000_0528 AON_REG20X_OSC128K_CAL*/
#define AON_REG20X_OSC128K_CAL_CNT_FREF_REP_1_Pos                                                                        0U
#define AON_REG20X_OSC128K_CAL_CNT_FREF_REP_1_Msk                                                                        (0x1FFFFUL << AON_REG20X_OSC128K_CAL_CNT_FREF_REP_1_Pos)

#define AON_REG20X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG20X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG20X_OSC128K_CAL_RSVD_Pos)

/* 0x52C    0x4000_052c
    16:0    R       CNT_FREF_REP_2                                              17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG22X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CNT_FREF_REP_2: 17;
        uint32_t RSVD: 15;
    };
} AON_REG22X_OSC128K_CAL_TYPE;

/*0x4000_052c AON_REG22X_OSC128K_CAL*/
#define AON_REG22X_OSC128K_CAL_CNT_FREF_REP_2_Pos                                                                        0U
#define AON_REG22X_OSC128K_CAL_CNT_FREF_REP_2_Msk                                                                        (0x1FFFFUL << AON_REG22X_OSC128K_CAL_CNT_FREF_REP_2_Pos)

#define AON_REG22X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG22X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG22X_OSC128K_CAL_RSVD_Pos)

/* 0x530    0x4000_0530
    16:0    R       CNT_FREF_REP_3                                              17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG24X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CNT_FREF_REP_3: 17;
        uint32_t RSVD: 15;
    };
} AON_REG24X_OSC128K_CAL_TYPE;

/*0x4000_0530 AON_REG24X_OSC128K_CAL*/
#define AON_REG24X_OSC128K_CAL_CNT_FREF_REP_3_Pos                                                                        0U
#define AON_REG24X_OSC128K_CAL_CNT_FREF_REP_3_Msk                                                                        (0x1FFFFUL << AON_REG24X_OSC128K_CAL_CNT_FREF_REP_3_Pos)

#define AON_REG24X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG24X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG24X_OSC128K_CAL_RSVD_Pos)

/* 0x534    0x4000_0534
    16:0    R       CNT_FREF_REP_4                                              17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG26X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CNT_FREF_REP_4: 17;
        uint32_t RSVD: 15;
    };
} AON_REG26X_OSC128K_CAL_TYPE;

/*0x4000_0534 AON_REG26X_OSC128K_CAL*/
#define AON_REG26X_OSC128K_CAL_CNT_FREF_REP_4_Pos                                                                        0U
#define AON_REG26X_OSC128K_CAL_CNT_FREF_REP_4_Msk                                                                        (0x1FFFFUL << AON_REG26X_OSC128K_CAL_CNT_FREF_REP_4_Pos)

#define AON_REG26X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG26X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG26X_OSC128K_CAL_RSVD_Pos)

/* 0x538    0x4000_0538
    16:0    R       CNT_FREF_REP_5                                              17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG28X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CNT_FREF_REP_5: 17;
        uint32_t RSVD: 15;
    };
} AON_REG28X_OSC128K_CAL_TYPE;

/*0x4000_0538 AON_REG28X_OSC128K_CAL*/
#define AON_REG28X_OSC128K_CAL_CNT_FREF_REP_5_Pos                                                                        0U
#define AON_REG28X_OSC128K_CAL_CNT_FREF_REP_5_Msk                                                                        (0x1FFFFUL << AON_REG28X_OSC128K_CAL_CNT_FREF_REP_5_Pos)

#define AON_REG28X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG28X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG28X_OSC128K_CAL_RSVD_Pos)

/* 0x53C    0x4000_053c
    16:0    R       CNT_FREF_REP_6                                              17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG30X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CNT_FREF_REP_6: 17;
        uint32_t RSVD: 15;
    };
} AON_REG30X_OSC128K_CAL_TYPE;

