rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_053c AON_REG30X_OSC128K_CAL*/
#define AON_REG30X_OSC128K_CAL_CNT_FREF_REP_6_Pos                                                                        0U
#define AON_REG30X_OSC128K_CAL_CNT_FREF_REP_6_Msk                                                                        (0x1FFFFUL << AON_REG30X_OSC128K_CAL_CNT_FREF_REP_6_Pos)

#define AON_REG30X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG30X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG30X_OSC128K_CAL_RSVD_Pos)

/* 0x540    0x4000_0540
    16:0    R       CNT_FREF_REP_7                                              17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG32X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CNT_FREF_REP_7: 17;
        uint32_t RSVD: 15;
    };
} AON_REG32X_OSC128K_CAL_TYPE;

/*0x4000_0540 AON_REG32X_OSC128K_CAL*/
#define AON_REG32X_OSC128K_CAL_CNT_FREF_REP_7_Pos                                                                        0U
#define AON_REG32X_OSC128K_CAL_CNT_FREF_REP_7_Msk                                                                        (0x1FFFFUL << AON_REG32X_OSC128K_CAL_CNT_FREF_REP_7_Pos)

#define AON_REG32X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG32X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG32X_OSC128K_CAL_RSVD_Pos)

/* 0x544    0x4000_0544
    16:0    R       PAST_ALPHA_OUT                                              17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG34X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PAST_ALPHA_OUT: 17;
        uint32_t RSVD: 15;
    };
} AON_REG34X_OSC128K_CAL_TYPE;

/*0x4000_0544 AON_REG34X_OSC128K_CAL*/
#define AON_REG34X_OSC128K_CAL_PAST_ALPHA_OUT_Pos                                                                        0U
#define AON_REG34X_OSC128K_CAL_PAST_ALPHA_OUT_Msk                                                                        (0x1FFFFUL << AON_REG34X_OSC128K_CAL_PAST_ALPHA_OUT_Pos)

#define AON_REG34X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG34X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG34X_OSC128K_CAL_RSVD_Pos)

/* 0x548    0x4000_0548
    16:0    R       LIN_CNT_FREF_REP_0                                          17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG36X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LIN_CNT_FREF_REP_0: 17;
        uint32_t RSVD: 15;
    };
} AON_REG36X_OSC128K_CAL_TYPE;

/*0x4000_0548 AON_REG36X_OSC128K_CAL*/
#define AON_REG36X_OSC128K_CAL_LIN_CNT_FREF_REP_0_Pos                                                                    0U
#define AON_REG36X_OSC128K_CAL_LIN_CNT_FREF_REP_0_Msk                                                                    (0x1FFFFUL << AON_REG36X_OSC128K_CAL_LIN_CNT_FREF_REP_0_Pos)

#define AON_REG36X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG36X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG36X_OSC128K_CAL_RSVD_Pos)

/* 0x54C    0x4000_054c
    16:0    R       LIN_CNT_FREF_REP_1                                          17'h0
    31:17   R       RSVD                                                        15'h0
 */
typedef union _AON_REG38X_OSC128K_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LIN_CNT_FREF_REP_1: 17;
        uint32_t RSVD: 15;
    };
} AON_REG38X_OSC128K_CAL_TYPE;

/*0x4000_054c AON_REG38X_OSC128K_CAL*/
#define AON_REG38X_OSC128K_CAL_LIN_CNT_FREF_REP_1_Pos                                                                    0U
#define AON_REG38X_OSC128K_CAL_LIN_CNT_FREF_REP_1_Msk                                                                    (0x1FFFFUL << AON_REG38X_OSC128K_CAL_LIN_CNT_FREF_REP_1_Pos)

#define AON_REG38X_OSC128K_CAL_RSVD_Pos                                                                                  17U
#define AON_REG38X_OSC128K_CAL_RSVD_Msk                                                                                  (0x7FFFUL << AON_REG38X_OSC128K_CAL_RSVD_Pos)

/* 0x550    0x4000_0550
    0       R/W     OSC128K_CAL_RAP_MODE                                        1'h0
    31:1    R       RSVD                                                        31'b0
 */
typedef union _AON_REG_OSC128K_CAL_RAP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC128K_CAL_RAP_MODE: 1;
        uint32_t RSVD: 31;
    };
} AON_REG_OSC128K_CAL_RAP_TYPE;

/*0x4000_0550 AON_REG_OSC128K_CAL_RAP*/
#define AON_REG_OSC128K_CAL_RAP_OSC128K_CAL_RAP_MODE_Pos                                                                 0U
#define AON_REG_OSC128K_CAL_RAP_OSC128K_CAL_RAP_MODE_Msk                                                                 (0x1UL << AON_REG_OSC128K_CAL_RAP_OSC128K_CAL_RAP_MODE_Pos)

#define AON_REG_OSC128K_CAL_RAP_RSVD_Pos                                                                                 1U
#define AON_REG_OSC128K_CAL_RAP_RSVD_Msk                                                                                 (0x7FFFFFFFUL << AON_REG_OSC128K_CAL_RAP_RSVD_Pos)

/* 0x554    0x4000_0554
    0       R/W     CAL32K_SCLK_QACTIVE_MAN_DATA                                1'b0
    1       R/W     CAL32K_SCLK_QACTIVE_MAN_EN                                  1'b0
    2       R/W     CAL32K_PCLK_QACTIVE_MAN_DATA                                1'b0
    3       R/W     CAL32K_PCLK_QACTIVE_MAN_EN                                  1'b0
    4       R/W     CAL32K_OSC128K_QACTIVE_MAN_DATA                             1'b0
    5       R/W     CAL32K_OSC128K_QACTIVE_MAN_EN                               1'b0
    6       R/W     CAL32K_AONCLK_QACTIVE_MAN_DATA                              1'b0
    7       R/W     CAL32K_AONCLK_QACTIVE_MAN_EN                                1'b0
    31:8    R       RSVD                                                        24'b0
 */
typedef union _AON_REG_OSC128K_CAL_QCH_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CAL32K_SCLK_QACTIVE_MAN_DATA: 1;
        uint32_t CAL32K_SCLK_QACTIVE_MAN_EN: 1;
        uint32_t CAL32K_PCLK_QACTIVE_MAN_DATA: 1;
        uint32_t CAL32K_PCLK_QACTIVE_MAN_EN: 1;
        uint32_t CAL32K_OSC128K_QACTIVE_MAN_DATA: 1;
        uint32_t CAL32K_OSC128K_QACTIVE_MAN_EN: 1;
        uint32_t CAL32K_AONCLK_QACTIVE_MAN_DATA: 1;
        uint32_t CAL32K_AONCLK_QACTIVE_MAN_EN: 1;
        uint32_t RSVD: 24;
    };
} AON_REG_OSC128K_CAL_QCH_TYPE;

/*0x4000_0554 AON_REG_OSC128K_CAL_QCH*/
#define AON_REG_OSC128K_CAL_QCH_CAL32K_SCLK_QACTIVE_MAN_DATA_Pos                                                         0U
#define AON_REG_OSC128K_CAL_QCH_CAL32K_SCLK_QACTIVE_MAN_DATA_Msk                                                         (0x1UL << AON_REG_OSC128K_CAL_QCH_CAL32K_SCLK_QACTIVE_MAN_DATA_Pos)

#define AON_REG_OSC128K_CAL_QCH_CAL32K_SCLK_QACTIVE_MAN_EN_Pos                                                           1U
#define AON_REG_OSC128K_CAL_QCH_CAL32K_SCLK_QACTIVE_MAN_EN_Msk                                                           (0x1UL << AON_REG_OSC128K_CAL_QCH_CAL32K_SCLK_QACTIVE_MAN_EN_Pos)

#define AON_REG_OSC128K_CAL_QCH_CAL32K_PCLK_QACTIVE_MAN_DATA_Pos                                                         2U
#define AON_REG_OSC128K_CAL_QCH_CAL32K_PCLK_QACTIVE_MAN_DATA_Msk                                                         (0x1UL << AON_REG_OSC128K_CAL_QCH_CAL32K_PCLK_QACTIVE_MAN_DATA_Pos)

