rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_OSC128K_CAL_QCH_CAL32K_PCLK_QACTIVE_MAN_EN_Pos                                                           3U
#define AON_REG_OSC128K_CAL_QCH_CAL32K_PCLK_QACTIVE_MAN_EN_Msk                                                           (0x1UL << AON_REG_OSC128K_CAL_QCH_CAL32K_PCLK_QACTIVE_MAN_EN_Pos)

#define AON_REG_OSC128K_CAL_QCH_CAL32K_OSC128K_QACTIVE_MAN_DATA_Pos                                                      4U
#define AON_REG_OSC128K_CAL_QCH_CAL32K_OSC128K_QACTIVE_MAN_DATA_Msk                                                      (0x1UL << AON_REG_OSC128K_CAL_QCH_CAL32K_OSC128K_QACTIVE_MAN_DATA_Pos)

#define AON_REG_OSC128K_CAL_QCH_CAL32K_OSC128K_QACTIVE_MAN_EN_Pos                                                        5U
#define AON_REG_OSC128K_CAL_QCH_CAL32K_OSC128K_QACTIVE_MAN_EN_Msk                                                        (0x1UL << AON_REG_OSC128K_CAL_QCH_CAL32K_OSC128K_QACTIVE_MAN_EN_Pos)

#define AON_REG_OSC128K_CAL_QCH_CAL32K_AONCLK_QACTIVE_MAN_DATA_Pos                                                       6U
#define AON_REG_OSC128K_CAL_QCH_CAL32K_AONCLK_QACTIVE_MAN_DATA_Msk                                                       (0x1UL << AON_REG_OSC128K_CAL_QCH_CAL32K_AONCLK_QACTIVE_MAN_DATA_Pos)

#define AON_REG_OSC128K_CAL_QCH_CAL32K_AONCLK_QACTIVE_MAN_EN_Pos                                                         7U
#define AON_REG_OSC128K_CAL_QCH_CAL32K_AONCLK_QACTIVE_MAN_EN_Msk                                                         (0x1UL << AON_REG_OSC128K_CAL_QCH_CAL32K_AONCLK_QACTIVE_MAN_EN_Pos)

#define AON_REG_OSC128K_CAL_QCH_RSVD_Pos                                                                                 8U
#define AON_REG_OSC128K_CAL_QCH_RSVD_Msk                                                                                 (0xFFFFFFUL << AON_REG_OSC128K_CAL_QCH_RSVD_Pos)

/* 0x600    0x4000_0600
    10:0    R/W     RESERVED1                                                   11'b0000000000000
    11      R       CP_DIS_XTAL_OUT                                             1'b0
    12      R       XTAL_PKDET_OUT                                              1'b0
    13      R/W     RESERVED                                                    1'b0
    14      R       XTAL_CLK_OK                                                 1'b0
    15      R/W     XTAL_EN_DAAC_GM                                             1'b0
    18:16   R/W     XTAL_FREQ_SEL                                               3'h5
    19      R/W     AAC_SEL                                                     1'b0
    25:20   R/W     AAC_GM1                                                     6'h1f
    31:26   R/W     AAC_GM                                                      6'h1f
 */
typedef union _AON_REG_40MXTAL_AON_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED1: 11;
        uint32_t CP_DIS_XTAL_OUT: 1;
        uint32_t XTAL_PKDET_OUT: 1;
        uint32_t RESERVED: 1;
        uint32_t XTAL_CLK_OK: 1;
        uint32_t XTAL_EN_DAAC_GM: 1;
        uint32_t XTAL_FREQ_SEL: 3;
        uint32_t AAC_SEL: 1;
        uint32_t AAC_GM1: 6;
        uint32_t AAC_GM: 6;
    };
} AON_REG_40MXTAL_AON_REG0X_TYPE;

/*0x4000_0600 AON_REG_40MXTAL_AON_REG0X*/
#define AON_REG_40MXTAL_AON_REG0X_RESERVED1_Pos                                                                          0U
#define AON_REG_40MXTAL_AON_REG0X_RESERVED1_Msk                                                                          (0x7FFUL << AON_REG_40MXTAL_AON_REG0X_RESERVED1_Pos)

#define AON_REG_40MXTAL_AON_REG0X_CP_DIS_XTAL_OUT_Pos                                                                    11U
#define AON_REG_40MXTAL_AON_REG0X_CP_DIS_XTAL_OUT_Msk                                                                    (0x1UL << AON_REG_40MXTAL_AON_REG0X_CP_DIS_XTAL_OUT_Pos)

#define AON_REG_40MXTAL_AON_REG0X_XTAL_PKDET_OUT_Pos                                                                     12U
#define AON_REG_40MXTAL_AON_REG0X_XTAL_PKDET_OUT_Msk                                                                     (0x1UL << AON_REG_40MXTAL_AON_REG0X_XTAL_PKDET_OUT_Pos)

#define AON_REG_40MXTAL_AON_REG0X_RESERVED_Pos                                                                           13U
#define AON_REG_40MXTAL_AON_REG0X_RESERVED_Msk                                                                           (0x1UL << AON_REG_40MXTAL_AON_REG0X_RESERVED_Pos)

#define AON_REG_40MXTAL_AON_REG0X_XTAL_CLK_OK_Pos                                                                        14U
#define AON_REG_40MXTAL_AON_REG0X_XTAL_CLK_OK_Msk                                                                        (0x1UL << AON_REG_40MXTAL_AON_REG0X_XTAL_CLK_OK_Pos)

#define AON_REG_40MXTAL_AON_REG0X_XTAL_EN_DAAC_GM_Pos                                                                    15U
#define AON_REG_40MXTAL_AON_REG0X_XTAL_EN_DAAC_GM_Msk                                                                    (0x1UL << AON_REG_40MXTAL_AON_REG0X_XTAL_EN_DAAC_GM_Pos)

#define AON_REG_40MXTAL_AON_REG0X_XTAL_FREQ_SEL_Pos                                                                      16U
#define AON_REG_40MXTAL_AON_REG0X_XTAL_FREQ_SEL_Msk                                                                      (0x7UL << AON_REG_40MXTAL_AON_REG0X_XTAL_FREQ_SEL_Pos)

#define AON_REG_40MXTAL_AON_REG0X_AAC_SEL_Pos                                                                            19U
#define AON_REG_40MXTAL_AON_REG0X_AAC_SEL_Msk                                                                            (0x1UL << AON_REG_40MXTAL_AON_REG0X_AAC_SEL_Pos)

#define AON_REG_40MXTAL_AON_REG0X_AAC_GM1_Pos                                                                            20U
#define AON_REG_40MXTAL_AON_REG0X_AAC_GM1_Msk                                                                            (0x3FUL << AON_REG_40MXTAL_AON_REG0X_AAC_GM1_Pos)

#define AON_REG_40MXTAL_AON_REG0X_AAC_GM_Pos                                                                             26U
#define AON_REG_40MXTAL_AON_REG0X_AAC_GM_Msk                                                                             (0x3FUL << AON_REG_40MXTAL_AON_REG0X_AAC_GM_Pos)

