rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x610    0x4000_0610
    2:0     R/W     XTAL_SEL_MODE                                               3'b000
    5:3     R/W     XTAL_MODE_DEBUG                                             3'h0
    6       R/W     POW_XTAL                                                    1'b0
    7       R/W     XTAL_EN_DEBUG                                               1'b0
    8       R/W     ISO_XTALDIG                                                 1'b1
    9       R/W     XTAL_SUPPLY_MODE                                            1'b0
    10      R/W     ISO_VDDON_XTAL                                              1'b1
    11      R/W     XTAL_EN_OK0_PC                                              1'b1
    15:12   R/W     XTAL_RSVD                                                   4'b0000
    31:16   R       XTAL_DUMMY0                                                 16'b0
 */
typedef union _AON_ANAPAR_XTAL_MODE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_SEL_MODE: 3;
        uint32_t XTAL_MODE_DEBUG: 3;
        uint32_t POW_XTAL: 1;
        uint32_t XTAL_EN_DEBUG: 1;
        uint32_t ISO_XTALDIG: 1;
        uint32_t XTAL_SUPPLY_MODE: 1;
        uint32_t ISO_VDDON_XTAL: 1;
        uint32_t XTAL_EN_OK0_PC: 1;
        uint32_t XTAL_RSVD: 4;
        uint32_t XTAL_DUMMY0: 16;
    };
} AON_ANAPAR_XTAL_MODE_TYPE;

/*0x4000_0610 AON_ANAPAR_XTAL_MODE*/
#define AON_ANAPAR_XTAL_MODE_XTAL_SEL_MODE_Pos                                                                           0U
#define AON_ANAPAR_XTAL_MODE_XTAL_SEL_MODE_Msk                                                                           (0x7UL << AON_ANAPAR_XTAL_MODE_XTAL_SEL_MODE_Pos)

#define AON_ANAPAR_XTAL_MODE_XTAL_MODE_DEBUG_Pos                                                                         3U
#define AON_ANAPAR_XTAL_MODE_XTAL_MODE_DEBUG_Msk                                                                         (0x7UL << AON_ANAPAR_XTAL_MODE_XTAL_MODE_DEBUG_Pos)

#define AON_ANAPAR_XTAL_MODE_POW_XTAL_Pos                                                                                6U
#define AON_ANAPAR_XTAL_MODE_POW_XTAL_Msk                                                                                (0x1UL << AON_ANAPAR_XTAL_MODE_POW_XTAL_Pos)

#define AON_ANAPAR_XTAL_MODE_XTAL_EN_DEBUG_Pos                                                                           7U
#define AON_ANAPAR_XTAL_MODE_XTAL_EN_DEBUG_Msk                                                                           (0x1UL << AON_ANAPAR_XTAL_MODE_XTAL_EN_DEBUG_Pos)

#define AON_ANAPAR_XTAL_MODE_ISO_XTALDIG_Pos                                                                             8U
#define AON_ANAPAR_XTAL_MODE_ISO_XTALDIG_Msk                                                                             (0x1UL << AON_ANAPAR_XTAL_MODE_ISO_XTALDIG_Pos)

#define AON_ANAPAR_XTAL_MODE_XTAL_SUPPLY_MODE_Pos                                                                        9U
#define AON_ANAPAR_XTAL_MODE_XTAL_SUPPLY_MODE_Msk                                                                        (0x1UL << AON_ANAPAR_XTAL_MODE_XTAL_SUPPLY_MODE_Pos)

#define AON_ANAPAR_XTAL_MODE_ISO_VDDON_XTAL_Pos                                                                          10U
#define AON_ANAPAR_XTAL_MODE_ISO_VDDON_XTAL_Msk                                                                          (0x1UL << AON_ANAPAR_XTAL_MODE_ISO_VDDON_XTAL_Pos)

#define AON_ANAPAR_XTAL_MODE_XTAL_EN_OK0_PC_Pos                                                                          11U
#define AON_ANAPAR_XTAL_MODE_XTAL_EN_OK0_PC_Msk                                                                          (0x1UL << AON_ANAPAR_XTAL_MODE_XTAL_EN_OK0_PC_Pos)

#define AON_ANAPAR_XTAL_MODE_XTAL_RSVD_Pos                                                                               12U
#define AON_ANAPAR_XTAL_MODE_XTAL_RSVD_Msk                                                                               (0xFUL << AON_ANAPAR_XTAL_MODE_XTAL_RSVD_Pos)

#define AON_ANAPAR_XTAL_MODE_XTAL_DUMMY0_Pos                                                                             16U
#define AON_ANAPAR_XTAL_MODE_XTAL_DUMMY0_Msk                                                                             (0xFFFFUL << AON_ANAPAR_XTAL_MODE_XTAL_DUMMY0_Pos)

/* 0x614    0x4000_0614
    0       R/W     XTAL_AAC_OK                                                 1'b0
    6:1     R       Reserve1                                                    6'h1f
    7       R       Reserve                                                     1'b0
    8       R/W     XTAL_EN_AAC_PKDET                                           1'b0
    9       R/W     XTAL_EN_LPS_CLK                                             1'b0
    12:10   R/W     XTAL_SEL_DAAC_PK                                            3'b011
    13      R/W     XTAL_BK_BG                                                  1'b0
    14      R/W     XTAL_EN_GM_SEPERATE                                         1'b0
    15      R/W     XTAL_EN_BDRF                                                1'b0
    20:16   R/W     XTAL_SEL_BUF_GM_N                                           5'b01000
    25:21   R/W     XTAL_SEL_BUF_GM_P                                           5'b01000
    26      R/W     XTAL_SEL_AFE_DELAY                                          1'b0
    27      R/W     XTAL_SEL_DIGI_DELAY                                         1'b0
    28      R/W     XTAL_DOUBLE_OP_I                                            1'b0
    30:29   R/W     XTAL_SEL_AFE_DRV                                            2'b00
    31      R/W     XTAL_EN_RF_DRV_LATCH                                        1'b0
 */
typedef union _AON_ANAPAR_XTAL0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_AAC_OK: 1;
        uint32_t Reserve1: 6;
        uint32_t Reserve: 1;
        uint32_t XTAL_EN_AAC_PKDET: 1;
        uint32_t XTAL_EN_LPS_CLK: 1;
        uint32_t XTAL_SEL_DAAC_PK: 3;
        uint32_t XTAL_BK_BG: 1;
        uint32_t XTAL_EN_GM_SEPERATE: 1;
        uint32_t XTAL_EN_BDRF: 1;
        uint32_t XTAL_SEL_BUF_GM_N: 5;
        uint32_t XTAL_SEL_BUF_GM_P: 5;
        uint32_t XTAL_SEL_AFE_DELAY: 1;
        uint32_t XTAL_SEL_DIGI_DELAY: 1;
        uint32_t XTAL_DOUBLE_OP_I: 1;
        uint32_t XTAL_SEL_AFE_DRV: 2;
        uint32_t XTAL_EN_RF_DRV_LATCH: 1;
    };
} AON_ANAPAR_XTAL0_TYPE;

/*0x4000_0614 AON_ANAPAR_XTAL0*/
#define AON_ANAPAR_XTAL0_XTAL_AAC_OK_Pos                                                                                 0U
#define AON_ANAPAR_XTAL0_XTAL_AAC_OK_Msk                                                                                 (0x1UL << AON_ANAPAR_XTAL0_XTAL_AAC_OK_Pos)

#define AON_ANAPAR_XTAL0_Reserve1_Pos                                                                                    1U
#define AON_ANAPAR_XTAL0_Reserve1_Msk                                                                                    (0x3FUL << AON_ANAPAR_XTAL0_Reserve1_Pos)

#define AON_ANAPAR_XTAL0_Reserve_Pos                                                                                     7U
#define AON_ANAPAR_XTAL0_Reserve_Msk                                                                                     (0x1UL << AON_ANAPAR_XTAL0_Reserve_Pos)

#define AON_ANAPAR_XTAL0_XTAL_EN_AAC_PKDET_Pos                                                                           8U
#define AON_ANAPAR_XTAL0_XTAL_EN_AAC_PKDET_Msk                                                                           (0x1UL << AON_ANAPAR_XTAL0_XTAL_EN_AAC_PKDET_Pos)

#define AON_ANAPAR_XTAL0_XTAL_EN_LPS_CLK_Pos                                                                             9U
#define AON_ANAPAR_XTAL0_XTAL_EN_LPS_CLK_Msk                                                                             (0x1UL << AON_ANAPAR_XTAL0_XTAL_EN_LPS_CLK_Pos)

#define AON_ANAPAR_XTAL0_XTAL_SEL_DAAC_PK_Pos                                                                            10U
#define AON_ANAPAR_XTAL0_XTAL_SEL_DAAC_PK_Msk                                                                            (0x7UL << AON_ANAPAR_XTAL0_XTAL_SEL_DAAC_PK_Pos)

