rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_ANAPAR_XTAL0_XTAL_BK_BG_Pos                                                                                  13U
#define AON_ANAPAR_XTAL0_XTAL_BK_BG_Msk                                                                                  (0x1UL << AON_ANAPAR_XTAL0_XTAL_BK_BG_Pos)

#define AON_ANAPAR_XTAL0_XTAL_EN_GM_SEPERATE_Pos                                                                         14U
#define AON_ANAPAR_XTAL0_XTAL_EN_GM_SEPERATE_Msk                                                                         (0x1UL << AON_ANAPAR_XTAL0_XTAL_EN_GM_SEPERATE_Pos)

#define AON_ANAPAR_XTAL0_XTAL_EN_BDRF_Pos                                                                                15U
#define AON_ANAPAR_XTAL0_XTAL_EN_BDRF_Msk                                                                                (0x1UL << AON_ANAPAR_XTAL0_XTAL_EN_BDRF_Pos)

#define AON_ANAPAR_XTAL0_XTAL_SEL_BUF_GM_N_Pos                                                                           16U
#define AON_ANAPAR_XTAL0_XTAL_SEL_BUF_GM_N_Msk                                                                           (0x1FUL << AON_ANAPAR_XTAL0_XTAL_SEL_BUF_GM_N_Pos)

#define AON_ANAPAR_XTAL0_XTAL_SEL_BUF_GM_P_Pos                                                                           21U
#define AON_ANAPAR_XTAL0_XTAL_SEL_BUF_GM_P_Msk                                                                           (0x1FUL << AON_ANAPAR_XTAL0_XTAL_SEL_BUF_GM_P_Pos)

#define AON_ANAPAR_XTAL0_XTAL_SEL_AFE_DELAY_Pos                                                                          26U
#define AON_ANAPAR_XTAL0_XTAL_SEL_AFE_DELAY_Msk                                                                          (0x1UL << AON_ANAPAR_XTAL0_XTAL_SEL_AFE_DELAY_Pos)

#define AON_ANAPAR_XTAL0_XTAL_SEL_DIGI_DELAY_Pos                                                                         27U
#define AON_ANAPAR_XTAL0_XTAL_SEL_DIGI_DELAY_Msk                                                                         (0x1UL << AON_ANAPAR_XTAL0_XTAL_SEL_DIGI_DELAY_Pos)

#define AON_ANAPAR_XTAL0_XTAL_DOUBLE_OP_I_Pos                                                                            28U
#define AON_ANAPAR_XTAL0_XTAL_DOUBLE_OP_I_Msk                                                                            (0x1UL << AON_ANAPAR_XTAL0_XTAL_DOUBLE_OP_I_Pos)

#define AON_ANAPAR_XTAL0_XTAL_SEL_AFE_DRV_Pos                                                                            29U
#define AON_ANAPAR_XTAL0_XTAL_SEL_AFE_DRV_Msk                                                                            (0x3UL << AON_ANAPAR_XTAL0_XTAL_SEL_AFE_DRV_Pos)

#define AON_ANAPAR_XTAL0_XTAL_EN_RF_DRV_LATCH_Pos                                                                        31U
#define AON_ANAPAR_XTAL0_XTAL_EN_RF_DRV_LATCH_Msk                                                                        (0x1UL << AON_ANAPAR_XTAL0_XTAL_EN_RF_DRV_LATCH_Pos)

/* 0x618    0x4000_0618
    1:0     R/W     XTAL_SEL_DIGI_DRV                                           2'b00
    3:2     R/W     XTAL_SEL_RF_DRV                                             2'b00
    4       R/W     XTAL_GATED_AFEP                                             1'b0
    5       R/W     XTAL_GATED_AFEN                                             1'b0
    6       R/W     XTAL_GATED_DIGIP                                            1'b0
    7       R/W     XTAL_GATED_DIGIN                                            1'b0
    8       R/W     XTAL_GATED_RFP                                              1'b0
    9       R/W     XTAL_GATED_RFN                                              1'b0
    11:10   R/W     XTAL_SEL_LPS_DRV                                            2'b00
    12      R/W     XTAL_GATED_LPS                                              1'b0
    15:13   R/W     XTAL_SEL_LPS_DIV                                            3'b111
    18:16   R/W     XTAL_TUNE_LDO_VOUT                                          3'b011
    21:19   R/W     XTAL_TUNE_LDO_VOUT_OK0                                      3'b011
    24:22   R/W     XTAL_SEL_TOK                                                3'b011
    25      R/W     XTAL_EN_LDO2PWRCUT                                          1'b0
    28:26   R/W     XTAL_SEL_XORES                                              3'b000
    29      R/W     XTAL_LDOPC_SEL                                              1'b0
    30      R/W     XTAL_SEL_BUF_LPS                                            1'b0
    31      R/W     XTAL_LPMODE_CLK_SEL                                         1'b0
 */
typedef union _AON_ANAPAR_XTAL2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_SEL_DIGI_DRV: 2;
        uint32_t XTAL_SEL_RF_DRV: 2;
        uint32_t XTAL_GATED_AFEP: 1;
        uint32_t XTAL_GATED_AFEN: 1;
        uint32_t XTAL_GATED_DIGIP: 1;
        uint32_t XTAL_GATED_DIGIN: 1;
        uint32_t XTAL_GATED_RFP: 1;
        uint32_t XTAL_GATED_RFN: 1;
        uint32_t XTAL_SEL_LPS_DRV: 2;
        uint32_t XTAL_GATED_LPS: 1;
        uint32_t XTAL_SEL_LPS_DIV: 3;
        uint32_t XTAL_TUNE_LDO_VOUT: 3;
        uint32_t XTAL_TUNE_LDO_VOUT_OK0: 3;
        uint32_t XTAL_SEL_TOK: 3;
        uint32_t XTAL_EN_LDO2PWRCUT: 1;
        uint32_t XTAL_SEL_XORES: 3;
        uint32_t XTAL_LDOPC_SEL: 1;
        uint32_t XTAL_SEL_BUF_LPS: 1;
        uint32_t XTAL_LPMODE_CLK_SEL: 1;
    };
} AON_ANAPAR_XTAL2_TYPE;

/*0x4000_0618 AON_ANAPAR_XTAL2*/
#define AON_ANAPAR_XTAL2_XTAL_SEL_DIGI_DRV_Pos                                                                           0U
#define AON_ANAPAR_XTAL2_XTAL_SEL_DIGI_DRV_Msk                                                                           (0x3UL << AON_ANAPAR_XTAL2_XTAL_SEL_DIGI_DRV_Pos)

#define AON_ANAPAR_XTAL2_XTAL_SEL_RF_DRV_Pos                                                                             2U
#define AON_ANAPAR_XTAL2_XTAL_SEL_RF_DRV_Msk                                                                             (0x3UL << AON_ANAPAR_XTAL2_XTAL_SEL_RF_DRV_Pos)

