rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_ANAPAR_XTAL2_XTAL_GATED_AFEP_Pos                                                                             4U
#define AON_ANAPAR_XTAL2_XTAL_GATED_AFEP_Msk                                                                             (0x1UL << AON_ANAPAR_XTAL2_XTAL_GATED_AFEP_Pos)

#define AON_ANAPAR_XTAL2_XTAL_GATED_AFEN_Pos                                                                             5U
#define AON_ANAPAR_XTAL2_XTAL_GATED_AFEN_Msk                                                                             (0x1UL << AON_ANAPAR_XTAL2_XTAL_GATED_AFEN_Pos)

#define AON_ANAPAR_XTAL2_XTAL_GATED_DIGIP_Pos                                                                            6U
#define AON_ANAPAR_XTAL2_XTAL_GATED_DIGIP_Msk                                                                            (0x1UL << AON_ANAPAR_XTAL2_XTAL_GATED_DIGIP_Pos)

#define AON_ANAPAR_XTAL2_XTAL_GATED_DIGIN_Pos                                                                            7U
#define AON_ANAPAR_XTAL2_XTAL_GATED_DIGIN_Msk                                                                            (0x1UL << AON_ANAPAR_XTAL2_XTAL_GATED_DIGIN_Pos)

#define AON_ANAPAR_XTAL2_XTAL_GATED_RFP_Pos                                                                              8U
#define AON_ANAPAR_XTAL2_XTAL_GATED_RFP_Msk                                                                              (0x1UL << AON_ANAPAR_XTAL2_XTAL_GATED_RFP_Pos)

#define AON_ANAPAR_XTAL2_XTAL_GATED_RFN_Pos                                                                              9U
#define AON_ANAPAR_XTAL2_XTAL_GATED_RFN_Msk                                                                              (0x1UL << AON_ANAPAR_XTAL2_XTAL_GATED_RFN_Pos)

#define AON_ANAPAR_XTAL2_XTAL_SEL_LPS_DRV_Pos                                                                            10U
#define AON_ANAPAR_XTAL2_XTAL_SEL_LPS_DRV_Msk                                                                            (0x3UL << AON_ANAPAR_XTAL2_XTAL_SEL_LPS_DRV_Pos)

#define AON_ANAPAR_XTAL2_XTAL_GATED_LPS_Pos                                                                              12U
#define AON_ANAPAR_XTAL2_XTAL_GATED_LPS_Msk                                                                              (0x1UL << AON_ANAPAR_XTAL2_XTAL_GATED_LPS_Pos)

#define AON_ANAPAR_XTAL2_XTAL_SEL_LPS_DIV_Pos                                                                            13U
#define AON_ANAPAR_XTAL2_XTAL_SEL_LPS_DIV_Msk                                                                            (0x7UL << AON_ANAPAR_XTAL2_XTAL_SEL_LPS_DIV_Pos)

#define AON_ANAPAR_XTAL2_XTAL_TUNE_LDO_VOUT_Pos                                                                          16U
#define AON_ANAPAR_XTAL2_XTAL_TUNE_LDO_VOUT_Msk                                                                          (0x7UL << AON_ANAPAR_XTAL2_XTAL_TUNE_LDO_VOUT_Pos)

#define AON_ANAPAR_XTAL2_XTAL_TUNE_LDO_VOUT_OK0_Pos                                                                      19U
#define AON_ANAPAR_XTAL2_XTAL_TUNE_LDO_VOUT_OK0_Msk                                                                      (0x7UL << AON_ANAPAR_XTAL2_XTAL_TUNE_LDO_VOUT_OK0_Pos)

#define AON_ANAPAR_XTAL2_XTAL_SEL_TOK_Pos                                                                                22U
#define AON_ANAPAR_XTAL2_XTAL_SEL_TOK_Msk                                                                                (0x7UL << AON_ANAPAR_XTAL2_XTAL_SEL_TOK_Pos)

#define AON_ANAPAR_XTAL2_XTAL_EN_LDO2PWRCUT_Pos                                                                          25U
#define AON_ANAPAR_XTAL2_XTAL_EN_LDO2PWRCUT_Msk                                                                          (0x1UL << AON_ANAPAR_XTAL2_XTAL_EN_LDO2PWRCUT_Pos)

#define AON_ANAPAR_XTAL2_XTAL_SEL_XORES_Pos                                                                              26U
#define AON_ANAPAR_XTAL2_XTAL_SEL_XORES_Msk                                                                              (0x7UL << AON_ANAPAR_XTAL2_XTAL_SEL_XORES_Pos)

#define AON_ANAPAR_XTAL2_XTAL_LDOPC_SEL_Pos                                                                              29U
#define AON_ANAPAR_XTAL2_XTAL_LDOPC_SEL_Msk                                                                              (0x1UL << AON_ANAPAR_XTAL2_XTAL_LDOPC_SEL_Pos)

#define AON_ANAPAR_XTAL2_XTAL_SEL_BUF_LPS_Pos                                                                            30U
#define AON_ANAPAR_XTAL2_XTAL_SEL_BUF_LPS_Msk                                                                            (0x1UL << AON_ANAPAR_XTAL2_XTAL_SEL_BUF_LPS_Pos)

#define AON_ANAPAR_XTAL2_XTAL_LPMODE_CLK_SEL_Pos                                                                         31U
#define AON_ANAPAR_XTAL2_XTAL_LPMODE_CLK_SEL_Msk                                                                         (0x1UL << AON_ANAPAR_XTAL2_XTAL_LPMODE_CLK_SEL_Pos)

/* 0x61C    0x4000_061c
    7:0     R/W     XTAL_TUNE_SC_INI                                            8'b01110000
    15:8    R/W     XTAL_TUNE_SC_LP                                             8'b01111111
    23:16   R/W     XTAL_TUNE_SC_XI_FREQ                                        8'b00111111
    31:24   R/W     XTAL_TUNE_SC_XO_FREQ                                        8'b00111111
 */
typedef union _AON_ANAPAR_XTAL4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_TUNE_SC_INI: 8;
        uint32_t XTAL_TUNE_SC_LP: 8;
        uint32_t XTAL_TUNE_SC_XI_FREQ: 8;
        uint32_t XTAL_TUNE_SC_XO_FREQ: 8;
    };
} AON_ANAPAR_XTAL4_TYPE;

/*0x4000_061c AON_ANAPAR_XTAL4*/
#define AON_ANAPAR_XTAL4_XTAL_TUNE_SC_INI_Pos                                                                            0U
#define AON_ANAPAR_XTAL4_XTAL_TUNE_SC_INI_Msk                                                                            (0xFFUL << AON_ANAPAR_XTAL4_XTAL_TUNE_SC_INI_Pos)

