rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_ANAPAR_XTAL4_XTAL_TUNE_SC_LP_Pos                                                                             8U
#define AON_ANAPAR_XTAL4_XTAL_TUNE_SC_LP_Msk                                                                             (0xFFUL << AON_ANAPAR_XTAL4_XTAL_TUNE_SC_LP_Pos)

#define AON_ANAPAR_XTAL4_XTAL_TUNE_SC_XI_FREQ_Pos                                                                        16U
#define AON_ANAPAR_XTAL4_XTAL_TUNE_SC_XI_FREQ_Msk                                                                        (0xFFUL << AON_ANAPAR_XTAL4_XTAL_TUNE_SC_XI_FREQ_Pos)

#define AON_ANAPAR_XTAL4_XTAL_TUNE_SC_XO_FREQ_Pos                                                                        24U
#define AON_ANAPAR_XTAL4_XTAL_TUNE_SC_XO_FREQ_Msk                                                                        (0xFFUL << AON_ANAPAR_XTAL4_XTAL_TUNE_SC_XO_FREQ_Pos)

/* 0x620    0x4000_0620
    0       R/W     XTAL_LPMODE_CLK_AON                                         1'b1
    1       R/W     XTAL_IOP_SEL                                                1'b0
    2       R/W     XTAL_PKDET_CMP_SWAP                                         1'b0
    3       R/W     XTAL_PKDET_LOAD_SWAP                                        1'b0
    6:4     R/W     XTAL_SEL_TOK01                                              3'b010
    7       R/W     XTAL_EN_XTAL_SEL_TOK01                                      1'b1
    8       R/W     XTAL_EN_XO_CLK_SW                                           1'b0
    9       R/W     XTAL_FASTSET_MANU                                           1'b0
    11:10   R/W     XTAL_SEL_AAAC_CAP                                           2'b11
    13:12   R/W     XTAL_SEL_AAAC_IOFFSET                                       2'b00
    15:14   R/W     XTAL_SEL_AAAC_OP_CUR                                        2'b00
    16      R/W     XTAL_EN_AAAC_TIE_MID                                        1'b0
    17      R/W     XTAL_EN_LPCNT_CLK_DIV                                       1'b0
    18      R/W     XTAL_EN_PDCK_VREF                                           1'b1
    19      R/W     XTAL_EN_CAP_CTRL_OK0                                        1'b0
    20      R/W     XTAL_EN_GM_CTRL_OK0                                         1'b0
    21      R/W     XTAL_EN_GM_CTRL_LP                                          1'b0
    23:22   R/W     XTAL_GM_OV_RATIO                                            2'b10
    25:24   R/W     XTAL_OV_RATIO                                               2'b10
    26      R/W     XTAL_EN_PDCK_MANU                                           1'b0
    27      R/W     XTAL_PDCK_OK                                                1'b0
    28      R/W     XTAL_PDCK_OK_MANU                                           1'b0
    30:29   R/W     XTAL_SEL_AAAC_PKDET_SW                                      2'b01
    31      R/W     XTAL_EN_CAP_CTRL_LPMODE                                     1'b0
 */
typedef union _AON_ANAPAR_XTAL6_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_LPMODE_CLK_AON: 1;
        uint32_t XTAL_IOP_SEL: 1;
        uint32_t XTAL_PKDET_CMP_SWAP: 1;
        uint32_t XTAL_PKDET_LOAD_SWAP: 1;
        uint32_t XTAL_SEL_TOK01: 3;
        uint32_t XTAL_EN_XTAL_SEL_TOK01: 1;
        uint32_t XTAL_EN_XO_CLK_SW: 1;
        uint32_t XTAL_FASTSET_MANU: 1;
        uint32_t XTAL_SEL_AAAC_CAP: 2;
        uint32_t XTAL_SEL_AAAC_IOFFSET: 2;
        uint32_t XTAL_SEL_AAAC_OP_CUR: 2;
        uint32_t XTAL_EN_AAAC_TIE_MID: 1;
        uint32_t XTAL_EN_LPCNT_CLK_DIV: 1;
        uint32_t XTAL_EN_PDCK_VREF: 1;
        uint32_t XTAL_EN_CAP_CTRL_OK0: 1;
        uint32_t XTAL_EN_GM_CTRL_OK0: 1;
        uint32_t XTAL_EN_GM_CTRL_LP: 1;
        uint32_t XTAL_GM_OV_RATIO: 2;
        uint32_t XTAL_OV_RATIO: 2;
        uint32_t XTAL_EN_PDCK_MANU: 1;
        uint32_t XTAL_PDCK_OK: 1;
        uint32_t XTAL_PDCK_OK_MANU: 1;
        uint32_t XTAL_SEL_AAAC_PKDET_SW: 2;
        uint32_t XTAL_EN_CAP_CTRL_LPMODE: 1;
    };
} AON_ANAPAR_XTAL6_TYPE;

/*0x4000_0620 AON_ANAPAR_XTAL6*/
#define AON_ANAPAR_XTAL6_XTAL_LPMODE_CLK_AON_Pos                                                                         0U
#define AON_ANAPAR_XTAL6_XTAL_LPMODE_CLK_AON_Msk                                                                         (0x1UL << AON_ANAPAR_XTAL6_XTAL_LPMODE_CLK_AON_Pos)

#define AON_ANAPAR_XTAL6_XTAL_IOP_SEL_Pos                                                                                1U
#define AON_ANAPAR_XTAL6_XTAL_IOP_SEL_Msk                                                                                (0x1UL << AON_ANAPAR_XTAL6_XTAL_IOP_SEL_Pos)

#define AON_ANAPAR_XTAL6_XTAL_PKDET_CMP_SWAP_Pos                                                                         2U
#define AON_ANAPAR_XTAL6_XTAL_PKDET_CMP_SWAP_Msk                                                                         (0x1UL << AON_ANAPAR_XTAL6_XTAL_PKDET_CMP_SWAP_Pos)

#define AON_ANAPAR_XTAL6_XTAL_PKDET_LOAD_SWAP_Pos                                                                        3U
#define AON_ANAPAR_XTAL6_XTAL_PKDET_LOAD_SWAP_Msk                                                                        (0x1UL << AON_ANAPAR_XTAL6_XTAL_PKDET_LOAD_SWAP_Pos)

#define AON_ANAPAR_XTAL6_XTAL_SEL_TOK01_Pos                                                                              4U
#define AON_ANAPAR_XTAL6_XTAL_SEL_TOK01_Msk                                                                              (0x7UL << AON_ANAPAR_XTAL6_XTAL_SEL_TOK01_Pos)

#define AON_ANAPAR_XTAL6_XTAL_EN_XTAL_SEL_TOK01_Pos                                                                      7U
#define AON_ANAPAR_XTAL6_XTAL_EN_XTAL_SEL_TOK01_Msk                                                                      (0x1UL << AON_ANAPAR_XTAL6_XTAL_EN_XTAL_SEL_TOK01_Pos)

#define AON_ANAPAR_XTAL6_XTAL_EN_XO_CLK_SW_Pos                                                                           8U
#define AON_ANAPAR_XTAL6_XTAL_EN_XO_CLK_SW_Msk                                                                           (0x1UL << AON_ANAPAR_XTAL6_XTAL_EN_XO_CLK_SW_Pos)

#define AON_ANAPAR_XTAL6_XTAL_FASTSET_MANU_Pos                                                                           9U
#define AON_ANAPAR_XTAL6_XTAL_FASTSET_MANU_Msk                                                                           (0x1UL << AON_ANAPAR_XTAL6_XTAL_FASTSET_MANU_Pos)

#define AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_CAP_Pos                                                                           10U
#define AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_CAP_Msk                                                                           (0x3UL << AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_CAP_Pos)

