rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_IOFFSET_Pos                                                                       12U
#define AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_IOFFSET_Msk                                                                       (0x3UL << AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_IOFFSET_Pos)

#define AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_OP_CUR_Pos                                                                        14U
#define AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_OP_CUR_Msk                                                                        (0x3UL << AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_OP_CUR_Pos)

#define AON_ANAPAR_XTAL6_XTAL_EN_AAAC_TIE_MID_Pos                                                                        16U
#define AON_ANAPAR_XTAL6_XTAL_EN_AAAC_TIE_MID_Msk                                                                        (0x1UL << AON_ANAPAR_XTAL6_XTAL_EN_AAAC_TIE_MID_Pos)

#define AON_ANAPAR_XTAL6_XTAL_EN_LPCNT_CLK_DIV_Pos                                                                       17U
#define AON_ANAPAR_XTAL6_XTAL_EN_LPCNT_CLK_DIV_Msk                                                                       (0x1UL << AON_ANAPAR_XTAL6_XTAL_EN_LPCNT_CLK_DIV_Pos)

#define AON_ANAPAR_XTAL6_XTAL_EN_PDCK_VREF_Pos                                                                           18U
#define AON_ANAPAR_XTAL6_XTAL_EN_PDCK_VREF_Msk                                                                           (0x1UL << AON_ANAPAR_XTAL6_XTAL_EN_PDCK_VREF_Pos)

#define AON_ANAPAR_XTAL6_XTAL_EN_CAP_CTRL_OK0_Pos                                                                        19U
#define AON_ANAPAR_XTAL6_XTAL_EN_CAP_CTRL_OK0_Msk                                                                        (0x1UL << AON_ANAPAR_XTAL6_XTAL_EN_CAP_CTRL_OK0_Pos)

#define AON_ANAPAR_XTAL6_XTAL_EN_GM_CTRL_OK0_Pos                                                                         20U
#define AON_ANAPAR_XTAL6_XTAL_EN_GM_CTRL_OK0_Msk                                                                         (0x1UL << AON_ANAPAR_XTAL6_XTAL_EN_GM_CTRL_OK0_Pos)

#define AON_ANAPAR_XTAL6_XTAL_EN_GM_CTRL_LP_Pos                                                                          21U
#define AON_ANAPAR_XTAL6_XTAL_EN_GM_CTRL_LP_Msk                                                                          (0x1UL << AON_ANAPAR_XTAL6_XTAL_EN_GM_CTRL_LP_Pos)

#define AON_ANAPAR_XTAL6_XTAL_GM_OV_RATIO_Pos                                                                            22U
#define AON_ANAPAR_XTAL6_XTAL_GM_OV_RATIO_Msk                                                                            (0x3UL << AON_ANAPAR_XTAL6_XTAL_GM_OV_RATIO_Pos)

#define AON_ANAPAR_XTAL6_XTAL_OV_RATIO_Pos                                                                               24U
#define AON_ANAPAR_XTAL6_XTAL_OV_RATIO_Msk                                                                               (0x3UL << AON_ANAPAR_XTAL6_XTAL_OV_RATIO_Pos)

#define AON_ANAPAR_XTAL6_XTAL_EN_PDCK_MANU_Pos                                                                           26U
#define AON_ANAPAR_XTAL6_XTAL_EN_PDCK_MANU_Msk                                                                           (0x1UL << AON_ANAPAR_XTAL6_XTAL_EN_PDCK_MANU_Pos)

#define AON_ANAPAR_XTAL6_XTAL_PDCK_OK_Pos                                                                                27U
#define AON_ANAPAR_XTAL6_XTAL_PDCK_OK_Msk                                                                                (0x1UL << AON_ANAPAR_XTAL6_XTAL_PDCK_OK_Pos)

#define AON_ANAPAR_XTAL6_XTAL_PDCK_OK_MANU_Pos                                                                           28U
#define AON_ANAPAR_XTAL6_XTAL_PDCK_OK_MANU_Msk                                                                           (0x1UL << AON_ANAPAR_XTAL6_XTAL_PDCK_OK_MANU_Pos)

#define AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_PKDET_SW_Pos                                                                      29U
#define AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_PKDET_SW_Msk                                                                      (0x3UL << AON_ANAPAR_XTAL6_XTAL_SEL_AAAC_PKDET_SW_Pos)

#define AON_ANAPAR_XTAL6_XTAL_EN_CAP_CTRL_LPMODE_Pos                                                                     31U
#define AON_ANAPAR_XTAL6_XTAL_EN_CAP_CTRL_LPMODE_Msk                                                                     (0x1UL << AON_ANAPAR_XTAL6_XTAL_EN_CAP_CTRL_LPMODE_Pos)

/* 0x624    0x4000_0624
    4:0     R/W     XTAL_PDCK_VREF                                              5'b10000
    9:5     R/W     XTAL_AAAC_VREF_MANU                                         5'b10000
    11:10   R/W     XTAL_LPS_CAP_CYC                                            2'b01
    13:12   R/W     XTAL_LPS_CAP_STEP                                           2'b01
    15:14   R/W     XTAL_SEL_CP_DISABLE_CYCLE                                   2'b11
    16      R/W     XTAL_EN_PLL_CP_ALWAYS_ON                                    1'b0
    17      R/W     XTAL_DEBUG_CAP_CTRL                                         1'b0
    18      R/W     XTAL_DEBUG_GM_CTRL                                          1'b0
    19      R/W     XTAL_EN_FW_CTRL_GATED_B                                     1'b1
    25:20   R/W     XTAL_GM                                                     6'b111111
    27:26   R/W     XTAL_GM_CYC                                                 2'b10
    29:28   R/W     XTAL_GM_STEP                                                2'b10
    30      R/W     XTAL_HP_IBGPMU_SEL                                          1'b1
    31      R/W     XTAL_LPLDO_SEL                                              1'b0
 */
typedef union _AON_ANAPAR_XTAL8_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_PDCK_VREF: 5;
        uint32_t XTAL_AAAC_VREF_MANU: 5;
        uint32_t XTAL_LPS_CAP_CYC: 2;
        uint32_t XTAL_LPS_CAP_STEP: 2;
        uint32_t XTAL_SEL_CP_DISABLE_CYCLE: 2;
        uint32_t XTAL_EN_PLL_CP_ALWAYS_ON: 1;
        uint32_t XTAL_DEBUG_CAP_CTRL: 1;
        uint32_t XTAL_DEBUG_GM_CTRL: 1;
        uint32_t XTAL_EN_FW_CTRL_GATED_B: 1;
        uint32_t XTAL_GM: 6;
        uint32_t XTAL_GM_CYC: 2;
        uint32_t XTAL_GM_STEP: 2;
        uint32_t XTAL_HP_IBGPMU_SEL: 1;
        uint32_t XTAL_LPLDO_SEL: 1;
    };
} AON_ANAPAR_XTAL8_TYPE;

