rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0624 AON_ANAPAR_XTAL8*/
#define AON_ANAPAR_XTAL8_XTAL_PDCK_VREF_Pos                                                                              0U
#define AON_ANAPAR_XTAL8_XTAL_PDCK_VREF_Msk                                                                              (0x1FUL << AON_ANAPAR_XTAL8_XTAL_PDCK_VREF_Pos)

#define AON_ANAPAR_XTAL8_XTAL_AAAC_VREF_MANU_Pos                                                                         5U
#define AON_ANAPAR_XTAL8_XTAL_AAAC_VREF_MANU_Msk                                                                         (0x1FUL << AON_ANAPAR_XTAL8_XTAL_AAAC_VREF_MANU_Pos)

#define AON_ANAPAR_XTAL8_XTAL_LPS_CAP_CYC_Pos                                                                            10U
#define AON_ANAPAR_XTAL8_XTAL_LPS_CAP_CYC_Msk                                                                            (0x3UL << AON_ANAPAR_XTAL8_XTAL_LPS_CAP_CYC_Pos)

#define AON_ANAPAR_XTAL8_XTAL_LPS_CAP_STEP_Pos                                                                           12U
#define AON_ANAPAR_XTAL8_XTAL_LPS_CAP_STEP_Msk                                                                           (0x3UL << AON_ANAPAR_XTAL8_XTAL_LPS_CAP_STEP_Pos)

#define AON_ANAPAR_XTAL8_XTAL_SEL_CP_DISABLE_CYCLE_Pos                                                                   14U
#define AON_ANAPAR_XTAL8_XTAL_SEL_CP_DISABLE_CYCLE_Msk                                                                   (0x3UL << AON_ANAPAR_XTAL8_XTAL_SEL_CP_DISABLE_CYCLE_Pos)

#define AON_ANAPAR_XTAL8_XTAL_EN_PLL_CP_ALWAYS_ON_Pos                                                                    16U
#define AON_ANAPAR_XTAL8_XTAL_EN_PLL_CP_ALWAYS_ON_Msk                                                                    (0x1UL << AON_ANAPAR_XTAL8_XTAL_EN_PLL_CP_ALWAYS_ON_Pos)

#define AON_ANAPAR_XTAL8_XTAL_DEBUG_CAP_CTRL_Pos                                                                         17U
#define AON_ANAPAR_XTAL8_XTAL_DEBUG_CAP_CTRL_Msk                                                                         (0x1UL << AON_ANAPAR_XTAL8_XTAL_DEBUG_CAP_CTRL_Pos)

#define AON_ANAPAR_XTAL8_XTAL_DEBUG_GM_CTRL_Pos                                                                          18U
#define AON_ANAPAR_XTAL8_XTAL_DEBUG_GM_CTRL_Msk                                                                          (0x1UL << AON_ANAPAR_XTAL8_XTAL_DEBUG_GM_CTRL_Pos)

#define AON_ANAPAR_XTAL8_XTAL_EN_FW_CTRL_GATED_B_Pos                                                                     19U
#define AON_ANAPAR_XTAL8_XTAL_EN_FW_CTRL_GATED_B_Msk                                                                     (0x1UL << AON_ANAPAR_XTAL8_XTAL_EN_FW_CTRL_GATED_B_Pos)

#define AON_ANAPAR_XTAL8_XTAL_GM_Pos                                                                                     20U
#define AON_ANAPAR_XTAL8_XTAL_GM_Msk                                                                                     (0x3FUL << AON_ANAPAR_XTAL8_XTAL_GM_Pos)

#define AON_ANAPAR_XTAL8_XTAL_GM_CYC_Pos                                                                                 26U
#define AON_ANAPAR_XTAL8_XTAL_GM_CYC_Msk                                                                                 (0x3UL << AON_ANAPAR_XTAL8_XTAL_GM_CYC_Pos)

#define AON_ANAPAR_XTAL8_XTAL_GM_STEP_Pos                                                                                28U
#define AON_ANAPAR_XTAL8_XTAL_GM_STEP_Msk                                                                                (0x3UL << AON_ANAPAR_XTAL8_XTAL_GM_STEP_Pos)

#define AON_ANAPAR_XTAL8_XTAL_HP_IBGPMU_SEL_Pos                                                                          30U
#define AON_ANAPAR_XTAL8_XTAL_HP_IBGPMU_SEL_Msk                                                                          (0x1UL << AON_ANAPAR_XTAL8_XTAL_HP_IBGPMU_SEL_Pos)

#define AON_ANAPAR_XTAL8_XTAL_LPLDO_SEL_Pos                                                                              31U
#define AON_ANAPAR_XTAL8_XTAL_LPLDO_SEL_Msk                                                                              (0x1UL << AON_ANAPAR_XTAL8_XTAL_LPLDO_SEL_Pos)

/* 0x628    0x4000_0628
    1:0     R/W     XTAL_SEL_LDOFASTSET_CYCLE                                   2'b01
    2       R/W     XTAL_EN_LPMODE_AUTO_GATED                                   1'b0
    3       R/W     XTAL_LP_GATE_FW_CTRL_B                                      1'b0
    6:4     R/W     XTAL_MODE_DEBUG_CAP_CTRL                                    3'b000
    9:7     R/W     XTAL_MODE_DEBUG_GM_CTRL                                     3'b000
    10      R/W     XTAL_EN_NMDAAC                                              1'b1
    11      R/W     XTAL_NMPC_SEL                                               1'b1
    12      R/W     XTAL_LPS_GM_CTRL                                            1'b0
    13      R/W     XTAL_EN_SUPPLY_MODE_CTRLBYFASTAON_B                         1'b1
    14      R/W     XTAL_EN_SUPPLY_MODE_FASTAON                                 1'b1
    15      R/W     XTAL_PDCK_BUSY                                              1'b0
    31:16   R/W     XTAL_CTRL                                                   16'b0000000000000000
 */
typedef union _AON_ANAPAR_XTAL10_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_SEL_LDOFASTSET_CYCLE: 2;
        uint32_t XTAL_EN_LPMODE_AUTO_GATED: 1;
        uint32_t XTAL_LP_GATE_FW_CTRL_B: 1;
        uint32_t XTAL_MODE_DEBUG_CAP_CTRL: 3;
        uint32_t XTAL_MODE_DEBUG_GM_CTRL: 3;
        uint32_t XTAL_EN_NMDAAC: 1;
        uint32_t XTAL_NMPC_SEL: 1;
        uint32_t XTAL_LPS_GM_CTRL: 1;
        uint32_t XTAL_EN_SUPPLY_MODE_CTRLBYFASTAON_B: 1;
        uint32_t XTAL_EN_SUPPLY_MODE_FASTAON: 1;
        uint32_t XTAL_PDCK_BUSY: 1;
        uint32_t XTAL_CTRL: 16;
    };
} AON_ANAPAR_XTAL10_TYPE;

/*0x4000_0628 AON_ANAPAR_XTAL10*/
#define AON_ANAPAR_XTAL10_XTAL_SEL_LDOFASTSET_CYCLE_Pos                                                                  0U
#define AON_ANAPAR_XTAL10_XTAL_SEL_LDOFASTSET_CYCLE_Msk                                                                  (0x3UL << AON_ANAPAR_XTAL10_XTAL_SEL_LDOFASTSET_CYCLE_Pos)

