rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_ANAPAR_XTAL10_XTAL_EN_LPMODE_AUTO_GATED_Pos                                                                  2U
#define AON_ANAPAR_XTAL10_XTAL_EN_LPMODE_AUTO_GATED_Msk                                                                  (0x1UL << AON_ANAPAR_XTAL10_XTAL_EN_LPMODE_AUTO_GATED_Pos)

#define AON_ANAPAR_XTAL10_XTAL_LP_GATE_FW_CTRL_B_Pos                                                                     3U
#define AON_ANAPAR_XTAL10_XTAL_LP_GATE_FW_CTRL_B_Msk                                                                     (0x1UL << AON_ANAPAR_XTAL10_XTAL_LP_GATE_FW_CTRL_B_Pos)

#define AON_ANAPAR_XTAL10_XTAL_MODE_DEBUG_CAP_CTRL_Pos                                                                   4U
#define AON_ANAPAR_XTAL10_XTAL_MODE_DEBUG_CAP_CTRL_Msk                                                                   (0x7UL << AON_ANAPAR_XTAL10_XTAL_MODE_DEBUG_CAP_CTRL_Pos)

#define AON_ANAPAR_XTAL10_XTAL_MODE_DEBUG_GM_CTRL_Pos                                                                    7U
#define AON_ANAPAR_XTAL10_XTAL_MODE_DEBUG_GM_CTRL_Msk                                                                    (0x7UL << AON_ANAPAR_XTAL10_XTAL_MODE_DEBUG_GM_CTRL_Pos)

#define AON_ANAPAR_XTAL10_XTAL_EN_NMDAAC_Pos                                                                             10U
#define AON_ANAPAR_XTAL10_XTAL_EN_NMDAAC_Msk                                                                             (0x1UL << AON_ANAPAR_XTAL10_XTAL_EN_NMDAAC_Pos)

#define AON_ANAPAR_XTAL10_XTAL_NMPC_SEL_Pos                                                                              11U
#define AON_ANAPAR_XTAL10_XTAL_NMPC_SEL_Msk                                                                              (0x1UL << AON_ANAPAR_XTAL10_XTAL_NMPC_SEL_Pos)

#define AON_ANAPAR_XTAL10_XTAL_LPS_GM_CTRL_Pos                                                                           12U
#define AON_ANAPAR_XTAL10_XTAL_LPS_GM_CTRL_Msk                                                                           (0x1UL << AON_ANAPAR_XTAL10_XTAL_LPS_GM_CTRL_Pos)

#define AON_ANAPAR_XTAL10_XTAL_EN_SUPPLY_MODE_CTRLBYFASTAON_B_Pos                                                        13U
#define AON_ANAPAR_XTAL10_XTAL_EN_SUPPLY_MODE_CTRLBYFASTAON_B_Msk                                                        (0x1UL << AON_ANAPAR_XTAL10_XTAL_EN_SUPPLY_MODE_CTRLBYFASTAON_B_Pos)

#define AON_ANAPAR_XTAL10_XTAL_EN_SUPPLY_MODE_FASTAON_Pos                                                                14U
#define AON_ANAPAR_XTAL10_XTAL_EN_SUPPLY_MODE_FASTAON_Msk                                                                (0x1UL << AON_ANAPAR_XTAL10_XTAL_EN_SUPPLY_MODE_FASTAON_Pos)

#define AON_ANAPAR_XTAL10_XTAL_PDCK_BUSY_Pos                                                                             15U
#define AON_ANAPAR_XTAL10_XTAL_PDCK_BUSY_Msk                                                                             (0x1UL << AON_ANAPAR_XTAL10_XTAL_PDCK_BUSY_Pos)

#define AON_ANAPAR_XTAL10_XTAL_CTRL_Pos                                                                                  16U
#define AON_ANAPAR_XTAL10_XTAL_CTRL_Msk                                                                                  (0xFFFFUL << AON_ANAPAR_XTAL10_XTAL_CTRL_Pos)

/* 0x62C    0x4000_062c
    15:0    R/W     XTAL_REG12X_DUMMY1                                          16'b0000000000000000
    31:16   R/W     XTAL_REG13X_DUMMY1                                          16'b0000000000000000
 */
typedef union _AON_ANAPAR_XTAL12_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_REG12X_DUMMY1: 16;
        uint32_t XTAL_REG13X_DUMMY1: 16;
    };
} AON_ANAPAR_XTAL12_TYPE;

/*0x4000_062c AON_ANAPAR_XTAL12*/
#define AON_ANAPAR_XTAL12_XTAL_REG12X_DUMMY1_Pos                                                                         0U
#define AON_ANAPAR_XTAL12_XTAL_REG12X_DUMMY1_Msk                                                                         (0xFFFFUL << AON_ANAPAR_XTAL12_XTAL_REG12X_DUMMY1_Pos)

#define AON_ANAPAR_XTAL12_XTAL_REG13X_DUMMY1_Pos                                                                         16U
#define AON_ANAPAR_XTAL12_XTAL_REG13X_DUMMY1_Msk                                                                         (0xFFFFUL << AON_ANAPAR_XTAL12_XTAL_REG13X_DUMMY1_Pos)

/* 0x630    0x4000_0630
    15:0    R/W     XTAL_REG14X_DUMMY1                                          16'b0000000000000000
    31:16   R/W     XTAL_REG15X_DUMMY1                                          16'b0000000000000000
 */
typedef union _AON_ANAPAR_XTAL14_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t XTAL_REG14X_DUMMY1: 16;
        uint32_t XTAL_REG15X_DUMMY1: 16;
    };
} AON_ANAPAR_XTAL14_TYPE;

/*0x4000_0630 AON_ANAPAR_XTAL14*/
#define AON_ANAPAR_XTAL14_XTAL_REG14X_DUMMY1_Pos                                                                         0U
#define AON_ANAPAR_XTAL14_XTAL_REG14X_DUMMY1_Msk                                                                         (0xFFFFUL << AON_ANAPAR_XTAL14_XTAL_REG14X_DUMMY1_Pos)

#define AON_ANAPAR_XTAL14_XTAL_REG15X_DUMMY1_Pos                                                                         16U
#define AON_ANAPAR_XTAL14_XTAL_REG15X_DUMMY1_Msk                                                                         (0xFFFFUL << AON_ANAPAR_XTAL14_XTAL_REG15X_DUMMY1_Pos)

/* 0x650    0x4000_0650
    0       R/W     OSC80M_POW_OSC                                              1'b0
    1       R/W     OSC80M_EN_OSC                                               1'b1
    2       R/W     OSC80M_EN_LDO                                               1'b1
    3       R/W     OSC80M_EN_LDO_VREF                                          1'b1
    4       R/W     OSC80M_EN_FASTSET                                           1'b0
    5       R/W     OSC80M_EN_VPULSE                                            1'b0
    6       R/W     OSC80M_SW_LDO2PWRCUT                                        1'b0
    7       R/W     OSC80M_EN_D2                                                1'b1
    15:8    R/W     OSC80M_RCAL                                                 8'd13
    19:16   R/W     OSC80M_LDO_SW                                               4'h2
    22:20   R/W     OSC80M_OK_SEL                                               3'b101
    23      R/W     OSC80M_LDO_VPULSE                                           1'b0
    26:24   R/W     OSC80M_FASTSET_SEL                                          3'b101
    27      R/W     EN_CKO_80M                                                  1'b0
    30:28   R/W     OSC80M_ISEL                                                 3'b101
    31      R/W     REG1X_OSC80M_DUMMY1                                         1'b0
 */
typedef union _AON_REG0X_OSC80M_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC80M_POW_OSC: 1;
        uint32_t OSC80M_EN_OSC: 1;
        uint32_t OSC80M_EN_LDO: 1;
        uint32_t OSC80M_EN_LDO_VREF: 1;
        uint32_t OSC80M_EN_FASTSET: 1;
        uint32_t OSC80M_EN_VPULSE: 1;
        uint32_t OSC80M_SW_LDO2PWRCUT: 1;
        uint32_t OSC80M_EN_D2: 1;
        uint32_t OSC80M_RCAL: 8;
        uint32_t OSC80M_LDO_SW: 4;
        uint32_t OSC80M_OK_SEL: 3;
        uint32_t OSC80M_LDO_VPULSE: 1;
        uint32_t OSC80M_FASTSET_SEL: 3;
        uint32_t EN_CKO_80M: 1;
        uint32_t OSC80M_ISEL: 3;
        uint32_t REG1X_OSC80M_DUMMY1: 1;
    };
} AON_REG0X_OSC80M_TYPE;

/*0x4000_0650 AON_REG0X_OSC80M*/
#define AON_REG0X_OSC80M_OSC80M_POW_OSC_Pos                                                                              0U
#define AON_REG0X_OSC80M_OSC80M_POW_OSC_Msk                                                                              (0x1UL << AON_REG0X_OSC80M_OSC80M_POW_OSC_Pos)

#define AON_REG0X_OSC80M_OSC80M_EN_OSC_Pos                                                                               1U
#define AON_REG0X_OSC80M_OSC80M_EN_OSC_Msk                                                                               (0x1UL << AON_REG0X_OSC80M_OSC80M_EN_OSC_Pos)

#define AON_REG0X_OSC80M_OSC80M_EN_LDO_Pos                                                                               2U
#define AON_REG0X_OSC80M_OSC80M_EN_LDO_Msk                                                                               (0x1UL << AON_REG0X_OSC80M_OSC80M_EN_LDO_Pos)

