rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG0X_OSC80M_OSC80M_EN_LDO_VREF_Pos                                                                          3U
#define AON_REG0X_OSC80M_OSC80M_EN_LDO_VREF_Msk                                                                          (0x1UL << AON_REG0X_OSC80M_OSC80M_EN_LDO_VREF_Pos)

#define AON_REG0X_OSC80M_OSC80M_EN_FASTSET_Pos                                                                           4U
#define AON_REG0X_OSC80M_OSC80M_EN_FASTSET_Msk                                                                           (0x1UL << AON_REG0X_OSC80M_OSC80M_EN_FASTSET_Pos)

#define AON_REG0X_OSC80M_OSC80M_EN_VPULSE_Pos                                                                            5U
#define AON_REG0X_OSC80M_OSC80M_EN_VPULSE_Msk                                                                            (0x1UL << AON_REG0X_OSC80M_OSC80M_EN_VPULSE_Pos)

#define AON_REG0X_OSC80M_OSC80M_SW_LDO2PWRCUT_Pos                                                                        6U
#define AON_REG0X_OSC80M_OSC80M_SW_LDO2PWRCUT_Msk                                                                        (0x1UL << AON_REG0X_OSC80M_OSC80M_SW_LDO2PWRCUT_Pos)

#define AON_REG0X_OSC80M_OSC80M_EN_D2_Pos                                                                                7U
#define AON_REG0X_OSC80M_OSC80M_EN_D2_Msk                                                                                (0x1UL << AON_REG0X_OSC80M_OSC80M_EN_D2_Pos)

#define AON_REG0X_OSC80M_OSC80M_RCAL_Pos                                                                                 8U
#define AON_REG0X_OSC80M_OSC80M_RCAL_Msk                                                                                 (0xFFUL << AON_REG0X_OSC80M_OSC80M_RCAL_Pos)

#define AON_REG0X_OSC80M_OSC80M_LDO_SW_Pos                                                                               16U
#define AON_REG0X_OSC80M_OSC80M_LDO_SW_Msk                                                                               (0xFUL << AON_REG0X_OSC80M_OSC80M_LDO_SW_Pos)

#define AON_REG0X_OSC80M_OSC80M_OK_SEL_Pos                                                                               20U
#define AON_REG0X_OSC80M_OSC80M_OK_SEL_Msk                                                                               (0x7UL << AON_REG0X_OSC80M_OSC80M_OK_SEL_Pos)

#define AON_REG0X_OSC80M_OSC80M_LDO_VPULSE_Pos                                                                           23U
#define AON_REG0X_OSC80M_OSC80M_LDO_VPULSE_Msk                                                                           (0x1UL << AON_REG0X_OSC80M_OSC80M_LDO_VPULSE_Pos)

#define AON_REG0X_OSC80M_OSC80M_FASTSET_SEL_Pos                                                                          24U
#define AON_REG0X_OSC80M_OSC80M_FASTSET_SEL_Msk                                                                          (0x7UL << AON_REG0X_OSC80M_OSC80M_FASTSET_SEL_Pos)

#define AON_REG0X_OSC80M_EN_CKO_80M_Pos                                                                                  27U
#define AON_REG0X_OSC80M_EN_CKO_80M_Msk                                                                                  (0x1UL << AON_REG0X_OSC80M_EN_CKO_80M_Pos)

#define AON_REG0X_OSC80M_OSC80M_ISEL_Pos                                                                                 28U
#define AON_REG0X_OSC80M_OSC80M_ISEL_Msk                                                                                 (0x7UL << AON_REG0X_OSC80M_OSC80M_ISEL_Pos)

#define AON_REG0X_OSC80M_REG1X_OSC80M_DUMMY1_Pos                                                                         31U
#define AON_REG0X_OSC80M_REG1X_OSC80M_DUMMY1_Msk                                                                         (0x1UL << AON_REG0X_OSC80M_REG1X_OSC80M_DUMMY1_Pos)

/* 0x654    0x4000_0654
    7:0     R/W     OSC80M_TIE_MID                                              8'h00
    8       R/W     OSC80M_TIE_L                                                1'b0
    9       R/W     OSC80M_TIE_H                                                1'b0
    10      R/W     OSC80M_RING_DN                                              1'b0
    11      R/W     OSC80M_RING_UP                                              1'b0
    15:12   R/W     REG2X_OSC80M_DUMMY1                                         4'b1010
    18:16   R/W     OSC80M_VSEL                                                 3'b011
    19      R/W     REG3X_OSC80M_DUMMY1                                         1'b0
    22:20   R/W     OSC80M_STARTUP_SEL                                          3'b011
    23      R/W     REG3X_OSC80M_DUMMY2                                         1'b0
    31:24   R/W     REG3X_OSC80M_DUMMY3                                         8'b10101010
 */
typedef union _AON_REG2X_OSC80M_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC80M_TIE_MID: 8;
        uint32_t OSC80M_TIE_L: 1;
        uint32_t OSC80M_TIE_H: 1;
        uint32_t OSC80M_RING_DN: 1;
        uint32_t OSC80M_RING_UP: 1;
        uint32_t REG2X_OSC80M_DUMMY1: 4;
        uint32_t OSC80M_VSEL: 3;
        uint32_t REG3X_OSC80M_DUMMY1: 1;
        uint32_t OSC80M_STARTUP_SEL: 3;
        uint32_t REG3X_OSC80M_DUMMY2: 1;
        uint32_t REG3X_OSC80M_DUMMY3: 8;
    };
} AON_REG2X_OSC80M_TYPE;

/*0x4000_0654 AON_REG2X_OSC80M*/
#define AON_REG2X_OSC80M_OSC80M_TIE_MID_Pos                                                                              0U
#define AON_REG2X_OSC80M_OSC80M_TIE_MID_Msk                                                                              (0xFFUL << AON_REG2X_OSC80M_OSC80M_TIE_MID_Pos)

#define AON_REG2X_OSC80M_OSC80M_TIE_L_Pos                                                                                8U
#define AON_REG2X_OSC80M_OSC80M_TIE_L_Msk                                                                                (0x1UL << AON_REG2X_OSC80M_OSC80M_TIE_L_Pos)

#define AON_REG2X_OSC80M_OSC80M_TIE_H_Pos                                                                                9U
#define AON_REG2X_OSC80M_OSC80M_TIE_H_Msk                                                                                (0x1UL << AON_REG2X_OSC80M_OSC80M_TIE_H_Pos)

#define AON_REG2X_OSC80M_OSC80M_RING_DN_Pos                                                                              10U
#define AON_REG2X_OSC80M_OSC80M_RING_DN_Msk                                                                              (0x1UL << AON_REG2X_OSC80M_OSC80M_RING_DN_Pos)

