rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG2X_OSC80M_OSC80M_RING_UP_Pos                                                                              11U
#define AON_REG2X_OSC80M_OSC80M_RING_UP_Msk                                                                              (0x1UL << AON_REG2X_OSC80M_OSC80M_RING_UP_Pos)

#define AON_REG2X_OSC80M_REG2X_OSC80M_DUMMY1_Pos                                                                         12U
#define AON_REG2X_OSC80M_REG2X_OSC80M_DUMMY1_Msk                                                                         (0xFUL << AON_REG2X_OSC80M_REG2X_OSC80M_DUMMY1_Pos)

#define AON_REG2X_OSC80M_OSC80M_VSEL_Pos                                                                                 16U
#define AON_REG2X_OSC80M_OSC80M_VSEL_Msk                                                                                 (0x7UL << AON_REG2X_OSC80M_OSC80M_VSEL_Pos)

#define AON_REG2X_OSC80M_REG3X_OSC80M_DUMMY1_Pos                                                                         19U
#define AON_REG2X_OSC80M_REG3X_OSC80M_DUMMY1_Msk                                                                         (0x1UL << AON_REG2X_OSC80M_REG3X_OSC80M_DUMMY1_Pos)

#define AON_REG2X_OSC80M_OSC80M_STARTUP_SEL_Pos                                                                          20U
#define AON_REG2X_OSC80M_OSC80M_STARTUP_SEL_Msk                                                                          (0x7UL << AON_REG2X_OSC80M_OSC80M_STARTUP_SEL_Pos)

#define AON_REG2X_OSC80M_REG3X_OSC80M_DUMMY2_Pos                                                                         23U
#define AON_REG2X_OSC80M_REG3X_OSC80M_DUMMY2_Msk                                                                         (0x1UL << AON_REG2X_OSC80M_REG3X_OSC80M_DUMMY2_Pos)

#define AON_REG2X_OSC80M_REG3X_OSC80M_DUMMY3_Pos                                                                         24U
#define AON_REG2X_OSC80M_REG3X_OSC80M_DUMMY3_Msk                                                                         (0xFFUL << AON_REG2X_OSC80M_REG3X_OSC80M_DUMMY3_Pos)

/* 0x658    0x4000_0658
    0       R       OK_80M                                                      1'b0
    15:1    R       RSVD_1                                                      15'b0
    31:16   R       RSVD                                                        16'h0
 */
typedef union _AON_C_KOUT0X_OSC80M_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OK_80M: 1;
        uint32_t RSVD_1: 15;
        uint32_t RSVD: 16;
    };
} AON_C_KOUT0X_OSC80M_TYPE;

/*0x4000_0658 AON_C_KOUT0X_OSC80M*/
#define AON_C_KOUT0X_OSC80M_OK_80M_Pos                                                                                   0U
#define AON_C_KOUT0X_OSC80M_OK_80M_Msk                                                                                   (0x1UL << AON_C_KOUT0X_OSC80M_OK_80M_Pos)

#define AON_C_KOUT0X_OSC80M_RSVD_1_Pos                                                                                   1U
#define AON_C_KOUT0X_OSC80M_RSVD_1_Msk                                                                                   (0x7FFFUL << AON_C_KOUT0X_OSC80M_RSVD_1_Pos)

#define AON_C_KOUT0X_OSC80M_RSVD_Pos                                                                                     16U
#define AON_C_KOUT0X_OSC80M_RSVD_Msk                                                                                     (0xFFFFUL << AON_C_KOUT0X_OSC80M_RSVD_Pos)

/* 0x674    0x4000_0674
    1:0     R/W     TUNE_MAXZC_1_0                                              2'b00
    2       R/W     FWDT_RSTB                                                   1'b0
    3       R/W     EN_DRVWELL_OPT                                              1'b0
    12:4    R/W     REG0X_DMY1                                                  9'b000011111
    13      R/W     EN_MAX_ZC_K                                                 1'b0
    14      R/W     IO_RSTB33_EN                                                1'b0
    15      R/W     IO_SHDN33_EN                                                1'b0
    18:16   R/W     REG1X_DMY1                                                  3'b000
    19      R/W     L2T                                                         1'b0
    24:20   R/W     U2_OUT_T_5_1                                                5'b11111
    25      R/W     L1T                                                         1'b0
    26      R/W     U1T                                                         1'b1
    27      R/W     TM_DRV                                                      1'b0
    30:28   R/W     TM_MOD_FLAGSEL_2_0                                          3'b000
    31      R/W     TM_ZC_SET                                                   1'b0
 */
typedef union _AON_REG_SIMO_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TUNE_MAXZC_1_0: 2;
        uint32_t FWDT_RSTB: 1;
        uint32_t EN_DRVWELL_OPT: 1;
        uint32_t REG0X_DMY1: 9;
        uint32_t EN_MAX_ZC_K: 1;
        uint32_t IO_RSTB33_EN: 1;
        uint32_t IO_SHDN33_EN: 1;
        uint32_t REG1X_DMY1: 3;
        uint32_t L2T: 1;
        uint32_t U2_OUT_T_5_1: 5;
        uint32_t L1T: 1;
        uint32_t U1T: 1;
        uint32_t TM_DRV: 1;
        uint32_t TM_MOD_FLAGSEL_2_0: 3;
        uint32_t TM_ZC_SET: 1;
    };
} AON_REG_SIMO_REG0X_TYPE;

/*0x4000_0674 AON_REG_SIMO_REG0X*/
#define AON_REG_SIMO_REG0X_TUNE_MAXZC_1_0_Pos                                                                            0U
#define AON_REG_SIMO_REG0X_TUNE_MAXZC_1_0_Msk                                                                            (0x3UL << AON_REG_SIMO_REG0X_TUNE_MAXZC_1_0_Pos)

#define AON_REG_SIMO_REG0X_FWDT_RSTB_Pos                                                                                 2U
#define AON_REG_SIMO_REG0X_FWDT_RSTB_Msk                                                                                 (0x1UL << AON_REG_SIMO_REG0X_FWDT_RSTB_Pos)

#define AON_REG_SIMO_REG0X_EN_DRVWELL_OPT_Pos                                                                            3U
#define AON_REG_SIMO_REG0X_EN_DRVWELL_OPT_Msk                                                                            (0x1UL << AON_REG_SIMO_REG0X_EN_DRVWELL_OPT_Pos)

#define AON_REG_SIMO_REG0X_REG0X_DMY1_Pos                                                                                4U
#define AON_REG_SIMO_REG0X_REG0X_DMY1_Msk                                                                                (0x1FFUL << AON_REG_SIMO_REG0X_REG0X_DMY1_Pos)

#define AON_REG_SIMO_REG0X_EN_MAX_ZC_K_Pos                                                                               13U
#define AON_REG_SIMO_REG0X_EN_MAX_ZC_K_Msk                                                                               (0x1UL << AON_REG_SIMO_REG0X_EN_MAX_ZC_K_Pos)

#define AON_REG_SIMO_REG0X_IO_RSTB33_EN_Pos                                                                              14U
#define AON_REG_SIMO_REG0X_IO_RSTB33_EN_Msk                                                                              (0x1UL << AON_REG_SIMO_REG0X_IO_RSTB33_EN_Pos)

