rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SIMO_REG0X_IO_SHDN33_EN_Pos                                                                              15U
#define AON_REG_SIMO_REG0X_IO_SHDN33_EN_Msk                                                                              (0x1UL << AON_REG_SIMO_REG0X_IO_SHDN33_EN_Pos)

#define AON_REG_SIMO_REG0X_REG1X_DMY1_Pos                                                                                16U
#define AON_REG_SIMO_REG0X_REG1X_DMY1_Msk                                                                                (0x7UL << AON_REG_SIMO_REG0X_REG1X_DMY1_Pos)

#define AON_REG_SIMO_REG0X_L2T_Pos                                                                                       19U
#define AON_REG_SIMO_REG0X_L2T_Msk                                                                                       (0x1UL << AON_REG_SIMO_REG0X_L2T_Pos)

#define AON_REG_SIMO_REG0X_U2_OUT_T_5_1_Pos                                                                              20U
#define AON_REG_SIMO_REG0X_U2_OUT_T_5_1_Msk                                                                              (0x1FUL << AON_REG_SIMO_REG0X_U2_OUT_T_5_1_Pos)

#define AON_REG_SIMO_REG0X_L1T_Pos                                                                                       25U
#define AON_REG_SIMO_REG0X_L1T_Msk                                                                                       (0x1UL << AON_REG_SIMO_REG0X_L1T_Pos)

#define AON_REG_SIMO_REG0X_U1T_Pos                                                                                       26U
#define AON_REG_SIMO_REG0X_U1T_Msk                                                                                       (0x1UL << AON_REG_SIMO_REG0X_U1T_Pos)

#define AON_REG_SIMO_REG0X_TM_DRV_Pos                                                                                    27U
#define AON_REG_SIMO_REG0X_TM_DRV_Msk                                                                                    (0x1UL << AON_REG_SIMO_REG0X_TM_DRV_Pos)

#define AON_REG_SIMO_REG0X_TM_MOD_FLAGSEL_2_0_Pos                                                                        28U
#define AON_REG_SIMO_REG0X_TM_MOD_FLAGSEL_2_0_Msk                                                                        (0x7UL << AON_REG_SIMO_REG0X_TM_MOD_FLAGSEL_2_0_Pos)

#define AON_REG_SIMO_REG0X_TM_ZC_SET_Pos                                                                                 31U
#define AON_REG_SIMO_REG0X_TM_ZC_SET_Msk                                                                                 (0x1UL << AON_REG_SIMO_REG0X_TM_ZC_SET_Pos)

/* 0x678    0x4000_0678
    0       R/W     ENPCCM_TRI                                                  1'b0
    1       R/W     EN_DISCHG_MCM_FLASH                                         1'b0
    2       R/W     REG_ENBPOSTF                                                1'b0
    3       R/W     EN_MCM_FLASH_PC2                                            1'b0
    4       R/W     EN_MCM_FLASH_PC1                                            1'b0
    5       R/W     SEL_EFLASH_HV25                                             1'b1
    6       R/W     SEL_EFLASH_HV18                                             1'b0
    10:7    R/W     REG2X_DMY2                                                  4'b0000
    11      R/W     EN_DMYLOAD_HV25                                             1'b0
    12      R/W     EN_DMYLOAD_HV18                                             1'b1
    13      R/W     EN_DMYLOAD_VDDPA                                            1'b0
    14      R/W     EN_DMYLOAD_VDDANA                                           1'b0
    15      R/W     EN_DMYLOAD_VDDCORE                                          1'b0
    21:16   R/W     TUNE_HV18                                                   6'b100000
    26:22   R/W     VOUTFBSEL                                                   5'b00000
    27      R/W     EN_CMP_LQ_HV25                                              1'b1
    28      R/W     SEL_VO3CMPHQ2_B                                             1'b1
    29      R/W     EN_VO3HQ2BETA                                               1'b1
    30      R/W     EN_VO3CMPHQ2                                                1'b0
    31      R/W     EN_VIN_BLOCK                                                1'b0
 */
typedef union _AON_REG_SIMO_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENPCCM_TRI: 1;
        uint32_t EN_DISCHG_MCM_FLASH: 1;
        uint32_t REG_ENBPOSTF: 1;
        uint32_t EN_MCM_FLASH_PC2: 1;
        uint32_t EN_MCM_FLASH_PC1: 1;
        uint32_t SEL_EFLASH_HV25: 1;
        uint32_t SEL_EFLASH_HV18: 1;
        uint32_t REG2X_DMY2: 4;
        uint32_t EN_DMYLOAD_HV25: 1;
        uint32_t EN_DMYLOAD_HV18: 1;
        uint32_t EN_DMYLOAD_VDDPA: 1;
        uint32_t EN_DMYLOAD_VDDANA: 1;
        uint32_t EN_DMYLOAD_VDDCORE: 1;
        uint32_t TUNE_HV18: 6;
        uint32_t VOUTFBSEL: 5;
        uint32_t EN_CMP_LQ_HV25: 1;
        uint32_t SEL_VO3CMPHQ2_B: 1;
        uint32_t EN_VO3HQ2BETA: 1;
        uint32_t EN_VO3CMPHQ2: 1;
        uint32_t EN_VIN_BLOCK: 1;
    };
} AON_REG_SIMO_REG1X_TYPE;

/*0x4000_0678 AON_REG_SIMO_REG1X*/
#define AON_REG_SIMO_REG1X_ENPCCM_TRI_Pos                                                                                0U
#define AON_REG_SIMO_REG1X_ENPCCM_TRI_Msk                                                                                (0x1UL << AON_REG_SIMO_REG1X_ENPCCM_TRI_Pos)

#define AON_REG_SIMO_REG1X_EN_DISCHG_MCM_FLASH_Pos                                                                       1U
#define AON_REG_SIMO_REG1X_EN_DISCHG_MCM_FLASH_Msk                                                                       (0x1UL << AON_REG_SIMO_REG1X_EN_DISCHG_MCM_FLASH_Pos)

#define AON_REG_SIMO_REG1X_REG_ENBPOSTF_Pos                                                                              2U
#define AON_REG_SIMO_REG1X_REG_ENBPOSTF_Msk                                                                              (0x1UL << AON_REG_SIMO_REG1X_REG_ENBPOSTF_Pos)

