rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SIMO_REG1X_EN_MCM_FLASH_PC2_Pos                                                                          3U
#define AON_REG_SIMO_REG1X_EN_MCM_FLASH_PC2_Msk                                                                          (0x1UL << AON_REG_SIMO_REG1X_EN_MCM_FLASH_PC2_Pos)

#define AON_REG_SIMO_REG1X_EN_MCM_FLASH_PC1_Pos                                                                          4U
#define AON_REG_SIMO_REG1X_EN_MCM_FLASH_PC1_Msk                                                                          (0x1UL << AON_REG_SIMO_REG1X_EN_MCM_FLASH_PC1_Pos)

#define AON_REG_SIMO_REG1X_SEL_EFLASH_HV25_Pos                                                                           5U
#define AON_REG_SIMO_REG1X_SEL_EFLASH_HV25_Msk                                                                           (0x1UL << AON_REG_SIMO_REG1X_SEL_EFLASH_HV25_Pos)

#define AON_REG_SIMO_REG1X_SEL_EFLASH_HV18_Pos                                                                           6U
#define AON_REG_SIMO_REG1X_SEL_EFLASH_HV18_Msk                                                                           (0x1UL << AON_REG_SIMO_REG1X_SEL_EFLASH_HV18_Pos)

#define AON_REG_SIMO_REG1X_REG2X_DMY2_Pos                                                                                7U
#define AON_REG_SIMO_REG1X_REG2X_DMY2_Msk                                                                                (0xFUL << AON_REG_SIMO_REG1X_REG2X_DMY2_Pos)

#define AON_REG_SIMO_REG1X_EN_DMYLOAD_HV25_Pos                                                                           11U
#define AON_REG_SIMO_REG1X_EN_DMYLOAD_HV25_Msk                                                                           (0x1UL << AON_REG_SIMO_REG1X_EN_DMYLOAD_HV25_Pos)

#define AON_REG_SIMO_REG1X_EN_DMYLOAD_HV18_Pos                                                                           12U
#define AON_REG_SIMO_REG1X_EN_DMYLOAD_HV18_Msk                                                                           (0x1UL << AON_REG_SIMO_REG1X_EN_DMYLOAD_HV18_Pos)

#define AON_REG_SIMO_REG1X_EN_DMYLOAD_VDDPA_Pos                                                                          13U
#define AON_REG_SIMO_REG1X_EN_DMYLOAD_VDDPA_Msk                                                                          (0x1UL << AON_REG_SIMO_REG1X_EN_DMYLOAD_VDDPA_Pos)

#define AON_REG_SIMO_REG1X_EN_DMYLOAD_VDDANA_Pos                                                                         14U
#define AON_REG_SIMO_REG1X_EN_DMYLOAD_VDDANA_Msk                                                                         (0x1UL << AON_REG_SIMO_REG1X_EN_DMYLOAD_VDDANA_Pos)

#define AON_REG_SIMO_REG1X_EN_DMYLOAD_VDDCORE_Pos                                                                        15U
#define AON_REG_SIMO_REG1X_EN_DMYLOAD_VDDCORE_Msk                                                                        (0x1UL << AON_REG_SIMO_REG1X_EN_DMYLOAD_VDDCORE_Pos)

#define AON_REG_SIMO_REG1X_TUNE_HV18_Pos                                                                                 16U
#define AON_REG_SIMO_REG1X_TUNE_HV18_Msk                                                                                 (0x3FUL << AON_REG_SIMO_REG1X_TUNE_HV18_Pos)

#define AON_REG_SIMO_REG1X_VOUTFBSEL_Pos                                                                                 22U
#define AON_REG_SIMO_REG1X_VOUTFBSEL_Msk                                                                                 (0x1FUL << AON_REG_SIMO_REG1X_VOUTFBSEL_Pos)

#define AON_REG_SIMO_REG1X_EN_CMP_LQ_HV25_Pos                                                                            27U
#define AON_REG_SIMO_REG1X_EN_CMP_LQ_HV25_Msk                                                                            (0x1UL << AON_REG_SIMO_REG1X_EN_CMP_LQ_HV25_Pos)

#define AON_REG_SIMO_REG1X_SEL_VO3CMPHQ2_B_Pos                                                                           28U
#define AON_REG_SIMO_REG1X_SEL_VO3CMPHQ2_B_Msk                                                                           (0x1UL << AON_REG_SIMO_REG1X_SEL_VO3CMPHQ2_B_Pos)

#define AON_REG_SIMO_REG1X_EN_VO3HQ2BETA_Pos                                                                             29U
#define AON_REG_SIMO_REG1X_EN_VO3HQ2BETA_Msk                                                                             (0x1UL << AON_REG_SIMO_REG1X_EN_VO3HQ2BETA_Pos)

#define AON_REG_SIMO_REG1X_EN_VO3CMPHQ2_Pos                                                                              30U
#define AON_REG_SIMO_REG1X_EN_VO3CMPHQ2_Msk                                                                              (0x1UL << AON_REG_SIMO_REG1X_EN_VO3CMPHQ2_Pos)

#define AON_REG_SIMO_REG1X_EN_VIN_BLOCK_Pos                                                                              31U
#define AON_REG_SIMO_REG1X_EN_VIN_BLOCK_Msk                                                                              (0x1UL << AON_REG_SIMO_REG1X_EN_VIN_BLOCK_Pos)

/* 0x684    0x4000_0684
    7:0     R/W     TUNE_VDDANA                                                 8'b01111010
    15:8    R/W     TUNE_VDDPA                                                  8'b00100010
    16      R/W     EN_CMP_LQ_HV18                                              1'b0
    17      R/W     POW_VDIV_LQ_HV18                                            1'b0
    23:18   R/W     TUNE_LPM_HV18                                               6'b100000
    31:24   R/W     TUNE_VDDCORE                                                8'b01100010
 */
typedef union _AON_REG_SIMO_REG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TUNE_VDDANA: 8;
        uint32_t TUNE_VDDPA: 8;
        uint32_t EN_CMP_LQ_HV18: 1;
        uint32_t POW_VDIV_LQ_HV18: 1;
        uint32_t TUNE_LPM_HV18: 6;
        uint32_t TUNE_VDDCORE: 8;
    };
} AON_REG_SIMO_REG2X_TYPE;

/*0x4000_0684 AON_REG_SIMO_REG2X*/
#define AON_REG_SIMO_REG2X_TUNE_VDDANA_Pos                                                                               0U
#define AON_REG_SIMO_REG2X_TUNE_VDDANA_Msk                                                                               (0xFFUL << AON_REG_SIMO_REG2X_TUNE_VDDANA_Pos)

