rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SIMO_REG2X_TUNE_VDDPA_Pos                                                                                8U
#define AON_REG_SIMO_REG2X_TUNE_VDDPA_Msk                                                                                (0xFFUL << AON_REG_SIMO_REG2X_TUNE_VDDPA_Pos)

#define AON_REG_SIMO_REG2X_EN_CMP_LQ_HV18_Pos                                                                            16U
#define AON_REG_SIMO_REG2X_EN_CMP_LQ_HV18_Msk                                                                            (0x1UL << AON_REG_SIMO_REG2X_EN_CMP_LQ_HV18_Pos)

#define AON_REG_SIMO_REG2X_POW_VDIV_LQ_HV18_Pos                                                                          17U
#define AON_REG_SIMO_REG2X_POW_VDIV_LQ_HV18_Msk                                                                          (0x1UL << AON_REG_SIMO_REG2X_POW_VDIV_LQ_HV18_Pos)

#define AON_REG_SIMO_REG2X_TUNE_LPM_HV18_Pos                                                                             18U
#define AON_REG_SIMO_REG2X_TUNE_LPM_HV18_Msk                                                                             (0x3FUL << AON_REG_SIMO_REG2X_TUNE_LPM_HV18_Pos)

#define AON_REG_SIMO_REG2X_TUNE_VDDCORE_Pos                                                                              24U
#define AON_REG_SIMO_REG2X_TUNE_VDDCORE_Msk                                                                              (0xFFUL << AON_REG_SIMO_REG2X_TUNE_VDDCORE_Pos)

/* 0x688    0x4000_0688
    0       R/W     EN_CMP_LQ_VDDANA                                            1'b0
    1       R/W     EN_CMP_LQ_VDDCORE                                           1'b0
    2       R/W     POW_VDIV_LQ_VDDANA                                          1'b0
    3       R/W     POW_VDIV_LQ_VDDCORE                                         1'b0
    4       R/W     EN_CMP_HQ_HV25                                              1'b1
    5       R/W     EN_CMP_HQ_HV18                                              1'b0
    6       R/W     EN_CMP_HQ_VDDPA                                             1'b0
    7       R/W     EN_CMP_HQ_VDDANA                                            1'b1
    8       R/W     EN_CMP_HQ_VDDCORE                                           1'b0
    9       R/W     POW_VDIV_HQ_HV25                                            1'b1
    10      R/W     POW_VDIV_HQ_HV18                                            1'b0
    11      R/W     POW_VDIV_HQ_VDDPA                                           1'b0
    12      R/W     POW_VDIV_HQ_VDDANA                                          1'b1
    13      R/W     POW_VDIV_HQ_VDDCORE                                         1'b0
    14      R/W     TUNE_LPM_HV25_RANGE                                         1'b0
    15      R/W     TUNE_HV25_RANGE                                             1'b0
    16      R/W     ENCCM_OUT_HV25                                              1'b1
    17      R/W     ENCCM_OUT_HV18                                              1'b1
    18      R/W     ENCCM_OUT_VDDPA                                             1'b0
    19      R/W     ENCCM_OUT_VDDANA                                            1'b1
    20      R/W     ENCCM_OUT_VDDCORE                                           1'b1
    21      R/W     EN_TON_PLUS                                                 1'b0
    31:22   R/W     REG7X_DMY                                                   10'b0000000000
 */
typedef union _AON_REG_SIMO_REG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t EN_CMP_LQ_VDDANA: 1;
        uint32_t EN_CMP_LQ_VDDCORE: 1;
        uint32_t POW_VDIV_LQ_VDDANA: 1;
        uint32_t POW_VDIV_LQ_VDDCORE: 1;
        uint32_t EN_CMP_HQ_HV25: 1;
        uint32_t EN_CMP_HQ_HV18: 1;
        uint32_t EN_CMP_HQ_VDDPA: 1;
        uint32_t EN_CMP_HQ_VDDANA: 1;
        uint32_t EN_CMP_HQ_VDDCORE: 1;
        uint32_t POW_VDIV_HQ_HV25: 1;
        uint32_t POW_VDIV_HQ_HV18: 1;
        uint32_t POW_VDIV_HQ_VDDPA: 1;
        uint32_t POW_VDIV_HQ_VDDANA: 1;
        uint32_t POW_VDIV_HQ_VDDCORE: 1;
        uint32_t TUNE_LPM_HV25_RANGE: 1;
        uint32_t TUNE_HV25_RANGE: 1;
        uint32_t ENCCM_OUT_HV25: 1;
        uint32_t ENCCM_OUT_HV18: 1;
        uint32_t ENCCM_OUT_VDDPA: 1;
        uint32_t ENCCM_OUT_VDDANA: 1;
        uint32_t ENCCM_OUT_VDDCORE: 1;
        uint32_t EN_TON_PLUS: 1;
        uint32_t REG7X_DMY: 10;
    };
} AON_REG_SIMO_REG3X_TYPE;

/*0x4000_0688 AON_REG_SIMO_REG3X*/
#define AON_REG_SIMO_REG3X_EN_CMP_LQ_VDDANA_Pos                                                                          0U
#define AON_REG_SIMO_REG3X_EN_CMP_LQ_VDDANA_Msk                                                                          (0x1UL << AON_REG_SIMO_REG3X_EN_CMP_LQ_VDDANA_Pos)

#define AON_REG_SIMO_REG3X_EN_CMP_LQ_VDDCORE_Pos                                                                         1U
#define AON_REG_SIMO_REG3X_EN_CMP_LQ_VDDCORE_Msk                                                                         (0x1UL << AON_REG_SIMO_REG3X_EN_CMP_LQ_VDDCORE_Pos)

#define AON_REG_SIMO_REG3X_POW_VDIV_LQ_VDDANA_Pos                                                                        2U
#define AON_REG_SIMO_REG3X_POW_VDIV_LQ_VDDANA_Msk                                                                        (0x1UL << AON_REG_SIMO_REG3X_POW_VDIV_LQ_VDDANA_Pos)

#define AON_REG_SIMO_REG3X_POW_VDIV_LQ_VDDCORE_Pos                                                                       3U
#define AON_REG_SIMO_REG3X_POW_VDIV_LQ_VDDCORE_Msk                                                                       (0x1UL << AON_REG_SIMO_REG3X_POW_VDIV_LQ_VDDCORE_Pos)

#define AON_REG_SIMO_REG3X_EN_CMP_HQ_HV25_Pos                                                                            4U
#define AON_REG_SIMO_REG3X_EN_CMP_HQ_HV25_Msk                                                                            (0x1UL << AON_REG_SIMO_REG3X_EN_CMP_HQ_HV25_Pos)

#define AON_REG_SIMO_REG3X_EN_CMP_HQ_HV18_Pos                                                                            5U
#define AON_REG_SIMO_REG3X_EN_CMP_HQ_HV18_Msk                                                                            (0x1UL << AON_REG_SIMO_REG3X_EN_CMP_HQ_HV18_Pos)

