rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SIMO_REG3X_EN_CMP_HQ_VDDPA_Pos                                                                           6U
#define AON_REG_SIMO_REG3X_EN_CMP_HQ_VDDPA_Msk                                                                           (0x1UL << AON_REG_SIMO_REG3X_EN_CMP_HQ_VDDPA_Pos)

#define AON_REG_SIMO_REG3X_EN_CMP_HQ_VDDANA_Pos                                                                          7U
#define AON_REG_SIMO_REG3X_EN_CMP_HQ_VDDANA_Msk                                                                          (0x1UL << AON_REG_SIMO_REG3X_EN_CMP_HQ_VDDANA_Pos)

#define AON_REG_SIMO_REG3X_EN_CMP_HQ_VDDCORE_Pos                                                                         8U
#define AON_REG_SIMO_REG3X_EN_CMP_HQ_VDDCORE_Msk                                                                         (0x1UL << AON_REG_SIMO_REG3X_EN_CMP_HQ_VDDCORE_Pos)

#define AON_REG_SIMO_REG3X_POW_VDIV_HQ_HV25_Pos                                                                          9U
#define AON_REG_SIMO_REG3X_POW_VDIV_HQ_HV25_Msk                                                                          (0x1UL << AON_REG_SIMO_REG3X_POW_VDIV_HQ_HV25_Pos)

#define AON_REG_SIMO_REG3X_POW_VDIV_HQ_HV18_Pos                                                                          10U
#define AON_REG_SIMO_REG3X_POW_VDIV_HQ_HV18_Msk                                                                          (0x1UL << AON_REG_SIMO_REG3X_POW_VDIV_HQ_HV18_Pos)

#define AON_REG_SIMO_REG3X_POW_VDIV_HQ_VDDPA_Pos                                                                         11U
#define AON_REG_SIMO_REG3X_POW_VDIV_HQ_VDDPA_Msk                                                                         (0x1UL << AON_REG_SIMO_REG3X_POW_VDIV_HQ_VDDPA_Pos)

#define AON_REG_SIMO_REG3X_POW_VDIV_HQ_VDDANA_Pos                                                                        12U
#define AON_REG_SIMO_REG3X_POW_VDIV_HQ_VDDANA_Msk                                                                        (0x1UL << AON_REG_SIMO_REG3X_POW_VDIV_HQ_VDDANA_Pos)

#define AON_REG_SIMO_REG3X_POW_VDIV_HQ_VDDCORE_Pos                                                                       13U
#define AON_REG_SIMO_REG3X_POW_VDIV_HQ_VDDCORE_Msk                                                                       (0x1UL << AON_REG_SIMO_REG3X_POW_VDIV_HQ_VDDCORE_Pos)

#define AON_REG_SIMO_REG3X_TUNE_LPM_HV25_RANGE_Pos                                                                       14U
#define AON_REG_SIMO_REG3X_TUNE_LPM_HV25_RANGE_Msk                                                                       (0x1UL << AON_REG_SIMO_REG3X_TUNE_LPM_HV25_RANGE_Pos)

#define AON_REG_SIMO_REG3X_TUNE_HV25_RANGE_Pos                                                                           15U
#define AON_REG_SIMO_REG3X_TUNE_HV25_RANGE_Msk                                                                           (0x1UL << AON_REG_SIMO_REG3X_TUNE_HV25_RANGE_Pos)

#define AON_REG_SIMO_REG3X_ENCCM_OUT_HV25_Pos                                                                            16U
#define AON_REG_SIMO_REG3X_ENCCM_OUT_HV25_Msk                                                                            (0x1UL << AON_REG_SIMO_REG3X_ENCCM_OUT_HV25_Pos)

#define AON_REG_SIMO_REG3X_ENCCM_OUT_HV18_Pos                                                                            17U
#define AON_REG_SIMO_REG3X_ENCCM_OUT_HV18_Msk                                                                            (0x1UL << AON_REG_SIMO_REG3X_ENCCM_OUT_HV18_Pos)

#define AON_REG_SIMO_REG3X_ENCCM_OUT_VDDPA_Pos                                                                           18U
#define AON_REG_SIMO_REG3X_ENCCM_OUT_VDDPA_Msk                                                                           (0x1UL << AON_REG_SIMO_REG3X_ENCCM_OUT_VDDPA_Pos)

#define AON_REG_SIMO_REG3X_ENCCM_OUT_VDDANA_Pos                                                                          19U
#define AON_REG_SIMO_REG3X_ENCCM_OUT_VDDANA_Msk                                                                          (0x1UL << AON_REG_SIMO_REG3X_ENCCM_OUT_VDDANA_Pos)

#define AON_REG_SIMO_REG3X_ENCCM_OUT_VDDCORE_Pos                                                                         20U
#define AON_REG_SIMO_REG3X_ENCCM_OUT_VDDCORE_Msk                                                                         (0x1UL << AON_REG_SIMO_REG3X_ENCCM_OUT_VDDCORE_Pos)

#define AON_REG_SIMO_REG3X_EN_TON_PLUS_Pos                                                                               21U
#define AON_REG_SIMO_REG3X_EN_TON_PLUS_Msk                                                                               (0x1UL << AON_REG_SIMO_REG3X_EN_TON_PLUS_Pos)

#define AON_REG_SIMO_REG3X_REG7X_DMY_Pos                                                                                 22U
#define AON_REG_SIMO_REG3X_REG7X_DMY_Msk                                                                                 (0x3FFUL << AON_REG_SIMO_REG3X_REG7X_DMY_Pos)

/* 0x68C    0x4000_068c
    1:0     R/W     ENCCMDLYSET                                                 2'b00
    3:2     R/W     LPMCMPDLY_SET                                               2'b01
    5:4     R/W     IBRDY2SET                                                   2'b01
    7:6     R/W     IBRDY1SET                                                   2'b01
    8       R/W     BYP_OPOR_LD                                                 1'b1
    9       R/W     EN_SYNC                                                     1'b0
    10      R/W     REG_FORCE_ENPOSTD                                           1'b0
    11      R/W     REG_FORCE_ENPOST                                            1'b0
    12      R/W     REG_ENNCP                                                   1'b0
    13      R/W     REG_ENPCCM                                                  1'b0
    14      R/W     REG_ENHQ_REFCMP                                             1'b1
    15      R/W     REG_ENLPM                                                   1'b0
    16      R/W     EN_DBGO                                                     1'b0
    17      R/W     EN_BBX                                                      1'b0
    19:18   R/W     SDZ2D                                                       2'b00
    22:20   R/W     SDZ2                                                        3'b000
    24:23   R/W     SDZ1                                                        2'b00
    26:25   R/W     ZCDLY_SET                                                   2'b10
    28:27   R/W     ENZCDLY2_SET                                                2'b00
    30:29   R/W     ENZCDLY1_SET                                                2'b01
    31      R/W     ENDLY_FOR_K                                                 1'b1
 */
typedef union _AON_REG_SIMO_REG4X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENCCMDLYSET: 2;
        uint32_t LPMCMPDLY_SET: 2;
        uint32_t IBRDY2SET: 2;
        uint32_t IBRDY1SET: 2;
        uint32_t BYP_OPOR_LD: 1;
        uint32_t EN_SYNC: 1;
        uint32_t REG_FORCE_ENPOSTD: 1;
        uint32_t REG_FORCE_ENPOST: 1;
        uint32_t REG_ENNCP: 1;
        uint32_t REG_ENPCCM: 1;
        uint32_t REG_ENHQ_REFCMP: 1;
        uint32_t REG_ENLPM: 1;
        uint32_t EN_DBGO: 1;
        uint32_t EN_BBX: 1;
        uint32_t SDZ2D: 2;
        uint32_t SDZ2: 3;
        uint32_t SDZ1: 2;
        uint32_t ZCDLY_SET: 2;
        uint32_t ENZCDLY2_SET: 2;
        uint32_t ENZCDLY1_SET: 2;
        uint32_t ENDLY_FOR_K: 1;
    };
} AON_REG_SIMO_REG4X_TYPE;

/*0x4000_068c AON_REG_SIMO_REG4X*/
#define AON_REG_SIMO_REG4X_ENCCMDLYSET_Pos                                                                               0U
#define AON_REG_SIMO_REG4X_ENCCMDLYSET_Msk                                                                               (0x3UL << AON_REG_SIMO_REG4X_ENCCMDLYSET_Pos)

#define AON_REG_SIMO_REG4X_LPMCMPDLY_SET_Pos                                                                             2U
#define AON_REG_SIMO_REG4X_LPMCMPDLY_SET_Msk                                                                             (0x3UL << AON_REG_SIMO_REG4X_LPMCMPDLY_SET_Pos)

#define AON_REG_SIMO_REG4X_IBRDY2SET_Pos                                                                                 4U
#define AON_REG_SIMO_REG4X_IBRDY2SET_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG4X_IBRDY2SET_Pos)

