rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SIMO_REG4X_IBRDY1SET_Pos                                                                                 6U
#define AON_REG_SIMO_REG4X_IBRDY1SET_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG4X_IBRDY1SET_Pos)

#define AON_REG_SIMO_REG4X_BYP_OPOR_LD_Pos                                                                               8U
#define AON_REG_SIMO_REG4X_BYP_OPOR_LD_Msk                                                                               (0x1UL << AON_REG_SIMO_REG4X_BYP_OPOR_LD_Pos)

#define AON_REG_SIMO_REG4X_EN_SYNC_Pos                                                                                   9U
#define AON_REG_SIMO_REG4X_EN_SYNC_Msk                                                                                   (0x1UL << AON_REG_SIMO_REG4X_EN_SYNC_Pos)

#define AON_REG_SIMO_REG4X_REG_FORCE_ENPOSTD_Pos                                                                         10U
#define AON_REG_SIMO_REG4X_REG_FORCE_ENPOSTD_Msk                                                                         (0x1UL << AON_REG_SIMO_REG4X_REG_FORCE_ENPOSTD_Pos)

#define AON_REG_SIMO_REG4X_REG_FORCE_ENPOST_Pos                                                                          11U
#define AON_REG_SIMO_REG4X_REG_FORCE_ENPOST_Msk                                                                          (0x1UL << AON_REG_SIMO_REG4X_REG_FORCE_ENPOST_Pos)

#define AON_REG_SIMO_REG4X_REG_ENNCP_Pos                                                                                 12U
#define AON_REG_SIMO_REG4X_REG_ENNCP_Msk                                                                                 (0x1UL << AON_REG_SIMO_REG4X_REG_ENNCP_Pos)

#define AON_REG_SIMO_REG4X_REG_ENPCCM_Pos                                                                                13U
#define AON_REG_SIMO_REG4X_REG_ENPCCM_Msk                                                                                (0x1UL << AON_REG_SIMO_REG4X_REG_ENPCCM_Pos)

#define AON_REG_SIMO_REG4X_REG_ENHQ_REFCMP_Pos                                                                           14U
#define AON_REG_SIMO_REG4X_REG_ENHQ_REFCMP_Msk                                                                           (0x1UL << AON_REG_SIMO_REG4X_REG_ENHQ_REFCMP_Pos)

#define AON_REG_SIMO_REG4X_REG_ENLPM_Pos                                                                                 15U
#define AON_REG_SIMO_REG4X_REG_ENLPM_Msk                                                                                 (0x1UL << AON_REG_SIMO_REG4X_REG_ENLPM_Pos)

#define AON_REG_SIMO_REG4X_EN_DBGO_Pos                                                                                   16U
#define AON_REG_SIMO_REG4X_EN_DBGO_Msk                                                                                   (0x1UL << AON_REG_SIMO_REG4X_EN_DBGO_Pos)

#define AON_REG_SIMO_REG4X_EN_BBX_Pos                                                                                    17U
#define AON_REG_SIMO_REG4X_EN_BBX_Msk                                                                                    (0x1UL << AON_REG_SIMO_REG4X_EN_BBX_Pos)

#define AON_REG_SIMO_REG4X_SDZ2D_Pos                                                                                     18U
#define AON_REG_SIMO_REG4X_SDZ2D_Msk                                                                                     (0x3UL << AON_REG_SIMO_REG4X_SDZ2D_Pos)

#define AON_REG_SIMO_REG4X_SDZ2_Pos                                                                                      20U
#define AON_REG_SIMO_REG4X_SDZ2_Msk                                                                                      (0x7UL << AON_REG_SIMO_REG4X_SDZ2_Pos)

#define AON_REG_SIMO_REG4X_SDZ1_Pos                                                                                      23U
#define AON_REG_SIMO_REG4X_SDZ1_Msk                                                                                      (0x3UL << AON_REG_SIMO_REG4X_SDZ1_Pos)

#define AON_REG_SIMO_REG4X_ZCDLY_SET_Pos                                                                                 25U
#define AON_REG_SIMO_REG4X_ZCDLY_SET_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG4X_ZCDLY_SET_Pos)

#define AON_REG_SIMO_REG4X_ENZCDLY2_SET_Pos                                                                              27U
#define AON_REG_SIMO_REG4X_ENZCDLY2_SET_Msk                                                                              (0x3UL << AON_REG_SIMO_REG4X_ENZCDLY2_SET_Pos)

#define AON_REG_SIMO_REG4X_ENZCDLY1_SET_Pos                                                                              29U
#define AON_REG_SIMO_REG4X_ENZCDLY1_SET_Msk                                                                              (0x3UL << AON_REG_SIMO_REG4X_ENZCDLY1_SET_Pos)

#define AON_REG_SIMO_REG4X_ENDLY_FOR_K_Pos                                                                               31U
#define AON_REG_SIMO_REG4X_ENDLY_FOR_K_Msk                                                                               (0x1UL << AON_REG_SIMO_REG4X_ENDLY_FOR_K_Pos)

/* 0x690    0x4000_0690
    1:0     R/W     MINTON2_SET                                                 2'b01
    3:2     R/W     MINTON1_SET                                                 2'b01
    5:4     R/W     EXTRA_TON_2_1                                               2'b00
    10:6    R/W     TON2_TUNE                                                   5'b10000
    15:11   R/W     TON1_TUNE                                                   5'b10000
    16      R/W     EN_CMPLQ_RSTPUL                                             1'b1
    17      R/W     BYP_LPMCMPDLY                                               1'b1
    18      R/W     CK_CS_LCH                                                   1'b0
    19      R/W     BYP_CSSS                                                    1'b0
    22:20   R/W     TUNE_DC_MODDET                                              3'b011
    24:23   R/W     MAXTON2_SET                                                 2'b01
    25      R/W     ENB_AC_MODDET                                               1'b0
    27:26   R/W     REG11X_DMY1                                                 2'b10
    28      R/W     EN_DC_MODDET                                                1'b1
    31:29   R/W     TUNE_ITON                                                   3'b100
 */
typedef union _AON_REG_SIMO_REG5X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t MINTON2_SET: 2;
        uint32_t MINTON1_SET: 2;
        uint32_t EXTRA_TON_2_1: 2;
        uint32_t TON2_TUNE: 5;
        uint32_t TON1_TUNE: 5;
        uint32_t EN_CMPLQ_RSTPUL: 1;
        uint32_t BYP_LPMCMPDLY: 1;
        uint32_t CK_CS_LCH: 1;
        uint32_t BYP_CSSS: 1;
        uint32_t TUNE_DC_MODDET: 3;
        uint32_t MAXTON2_SET: 2;
        uint32_t ENB_AC_MODDET: 1;
        uint32_t REG11X_DMY1: 2;
        uint32_t EN_DC_MODDET: 1;
        uint32_t TUNE_ITON: 3;
    };
} AON_REG_SIMO_REG5X_TYPE;

/*0x4000_0690 AON_REG_SIMO_REG5X*/
#define AON_REG_SIMO_REG5X_MINTON2_SET_Pos                                                                               0U
#define AON_REG_SIMO_REG5X_MINTON2_SET_Msk                                                                               (0x3UL << AON_REG_SIMO_REG5X_MINTON2_SET_Pos)

