rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SIMO_REG5X_MINTON1_SET_Pos                                                                               2U
#define AON_REG_SIMO_REG5X_MINTON1_SET_Msk                                                                               (0x3UL << AON_REG_SIMO_REG5X_MINTON1_SET_Pos)

#define AON_REG_SIMO_REG5X_EXTRA_TON_2_1_Pos                                                                             4U
#define AON_REG_SIMO_REG5X_EXTRA_TON_2_1_Msk                                                                             (0x3UL << AON_REG_SIMO_REG5X_EXTRA_TON_2_1_Pos)

#define AON_REG_SIMO_REG5X_TON2_TUNE_Pos                                                                                 6U
#define AON_REG_SIMO_REG5X_TON2_TUNE_Msk                                                                                 (0x1FUL << AON_REG_SIMO_REG5X_TON2_TUNE_Pos)

#define AON_REG_SIMO_REG5X_TON1_TUNE_Pos                                                                                 11U
#define AON_REG_SIMO_REG5X_TON1_TUNE_Msk                                                                                 (0x1FUL << AON_REG_SIMO_REG5X_TON1_TUNE_Pos)

#define AON_REG_SIMO_REG5X_EN_CMPLQ_RSTPUL_Pos                                                                           16U
#define AON_REG_SIMO_REG5X_EN_CMPLQ_RSTPUL_Msk                                                                           (0x1UL << AON_REG_SIMO_REG5X_EN_CMPLQ_RSTPUL_Pos)

#define AON_REG_SIMO_REG5X_BYP_LPMCMPDLY_Pos                                                                             17U
#define AON_REG_SIMO_REG5X_BYP_LPMCMPDLY_Msk                                                                             (0x1UL << AON_REG_SIMO_REG5X_BYP_LPMCMPDLY_Pos)

#define AON_REG_SIMO_REG5X_CK_CS_LCH_Pos                                                                                 18U
#define AON_REG_SIMO_REG5X_CK_CS_LCH_Msk                                                                                 (0x1UL << AON_REG_SIMO_REG5X_CK_CS_LCH_Pos)

#define AON_REG_SIMO_REG5X_BYP_CSSS_Pos                                                                                  19U
#define AON_REG_SIMO_REG5X_BYP_CSSS_Msk                                                                                  (0x1UL << AON_REG_SIMO_REG5X_BYP_CSSS_Pos)

#define AON_REG_SIMO_REG5X_TUNE_DC_MODDET_Pos                                                                            20U
#define AON_REG_SIMO_REG5X_TUNE_DC_MODDET_Msk                                                                            (0x7UL << AON_REG_SIMO_REG5X_TUNE_DC_MODDET_Pos)

#define AON_REG_SIMO_REG5X_MAXTON2_SET_Pos                                                                               23U
#define AON_REG_SIMO_REG5X_MAXTON2_SET_Msk                                                                               (0x3UL << AON_REG_SIMO_REG5X_MAXTON2_SET_Pos)

#define AON_REG_SIMO_REG5X_ENB_AC_MODDET_Pos                                                                             25U
#define AON_REG_SIMO_REG5X_ENB_AC_MODDET_Msk                                                                             (0x1UL << AON_REG_SIMO_REG5X_ENB_AC_MODDET_Pos)

#define AON_REG_SIMO_REG5X_REG11X_DMY1_Pos                                                                               26U
#define AON_REG_SIMO_REG5X_REG11X_DMY1_Msk                                                                               (0x3UL << AON_REG_SIMO_REG5X_REG11X_DMY1_Pos)

#define AON_REG_SIMO_REG5X_EN_DC_MODDET_Pos                                                                              28U
#define AON_REG_SIMO_REG5X_EN_DC_MODDET_Msk                                                                              (0x1UL << AON_REG_SIMO_REG5X_EN_DC_MODDET_Pos)

#define AON_REG_SIMO_REG5X_TUNE_ITON_Pos                                                                                 29U
#define AON_REG_SIMO_REG5X_TUNE_ITON_Msk                                                                                 (0x7UL << AON_REG_SIMO_REG5X_TUNE_ITON_Pos)

/* 0x694    0x4000_0694
    1:0     R/W     REG12X_DMY                                                  2'b00
    8:2     R/W     ZCDOFFSET2                                                  7'b0001100
    15:9    R/W     ZCDOFFSET1                                                  7'b0001100
    17:16   R/W     REG13X_DMY                                                  2'b00
    24:18   R/W     ZCDOFFSET4                                                  7'b0001100
    31:25   R/W     ZCDOFFSET3                                                  7'b0001100
 */
typedef union _AON_REG_SIMO_REG6X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG12X_DMY: 2;
        uint32_t ZCDOFFSET2: 7;
        uint32_t ZCDOFFSET1: 7;
        uint32_t REG13X_DMY: 2;
        uint32_t ZCDOFFSET4: 7;
        uint32_t ZCDOFFSET3: 7;
    };
} AON_REG_SIMO_REG6X_TYPE;

/*0x4000_0694 AON_REG_SIMO_REG6X*/
#define AON_REG_SIMO_REG6X_REG12X_DMY_Pos                                                                                0U
#define AON_REG_SIMO_REG6X_REG12X_DMY_Msk                                                                                (0x3UL << AON_REG_SIMO_REG6X_REG12X_DMY_Pos)

#define AON_REG_SIMO_REG6X_ZCDOFFSET2_Pos                                                                                2U
#define AON_REG_SIMO_REG6X_ZCDOFFSET2_Msk                                                                                (0x7FUL << AON_REG_SIMO_REG6X_ZCDOFFSET2_Pos)

#define AON_REG_SIMO_REG6X_ZCDOFFSET1_Pos                                                                                9U
#define AON_REG_SIMO_REG6X_ZCDOFFSET1_Msk                                                                                (0x7FUL << AON_REG_SIMO_REG6X_ZCDOFFSET1_Pos)

#define AON_REG_SIMO_REG6X_REG13X_DMY_Pos                                                                                16U
#define AON_REG_SIMO_REG6X_REG13X_DMY_Msk                                                                                (0x3UL << AON_REG_SIMO_REG6X_REG13X_DMY_Pos)

#define AON_REG_SIMO_REG6X_ZCDOFFSET4_Pos                                                                                18U
#define AON_REG_SIMO_REG6X_ZCDOFFSET4_Msk                                                                                (0x7FUL << AON_REG_SIMO_REG6X_ZCDOFFSET4_Pos)

#define AON_REG_SIMO_REG6X_ZCDOFFSET3_Pos                                                                                25U
#define AON_REG_SIMO_REG6X_ZCDOFFSET3_Msk                                                                                (0x7FUL << AON_REG_SIMO_REG6X_ZCDOFFSET3_Pos)

/* 0x698    0x4000_0698
    3:0     R/W     REG14X_DMY                                                  4'b0000
    8:4     R/W     FORCE_CODE                                                  5'b00000
    15:9    R/W     ZCDOFFSET5                                                  7'b0001100
    16      R/W     ENFBC_1245                                                  1'b0
    17      R/W     ENFBC_3                                                     1'b0
    18      R/W     SEL_CMPLQ_IQ2X_14                                           1'b0
    19      R/W     SEL_CMPLQ_IQ2X_25                                           1'b0
    20      R/W     SEL_CMPHQ_IQ2X_1245                                         1'b0
    21      R/W     SEL_CMPHQ_IQ2X_3                                            1'b0
    23:22   R/W     SEL_PS_1_0                                                  2'b01
    24      R/W     ENB_AUTO_PS                                                 1'b1
    25      R/W     SEL_SYNC2                                                   1'b1
    26      R/W     EN_SYNC2                                                    1'b0
    31:27   R/W     STICKY_CODE                                                 5'b00000
 */
typedef union _AON_REG_SIMO_REG7X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG14X_DMY: 4;
        uint32_t FORCE_CODE: 5;
        uint32_t ZCDOFFSET5: 7;
        uint32_t ENFBC_1245: 1;
        uint32_t ENFBC_3: 1;
        uint32_t SEL_CMPLQ_IQ2X_14: 1;
        uint32_t SEL_CMPLQ_IQ2X_25: 1;
        uint32_t SEL_CMPHQ_IQ2X_1245: 1;
        uint32_t SEL_CMPHQ_IQ2X_3: 1;
        uint32_t SEL_PS_1_0: 2;
        uint32_t ENB_AUTO_PS: 1;
        uint32_t SEL_SYNC2: 1;
        uint32_t EN_SYNC2: 1;
        uint32_t STICKY_CODE: 5;
    };
} AON_REG_SIMO_REG7X_TYPE;

/*0x4000_0698 AON_REG_SIMO_REG7X*/
#define AON_REG_SIMO_REG7X_REG14X_DMY_Pos                                                                                0U
#define AON_REG_SIMO_REG7X_REG14X_DMY_Msk                                                                                (0xFUL << AON_REG_SIMO_REG7X_REG14X_DMY_Pos)

