rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SIMO_REG7X_FORCE_CODE_Pos                                                                                4U
#define AON_REG_SIMO_REG7X_FORCE_CODE_Msk                                                                                (0x1FUL << AON_REG_SIMO_REG7X_FORCE_CODE_Pos)

#define AON_REG_SIMO_REG7X_ZCDOFFSET5_Pos                                                                                9U
#define AON_REG_SIMO_REG7X_ZCDOFFSET5_Msk                                                                                (0x7FUL << AON_REG_SIMO_REG7X_ZCDOFFSET5_Pos)

#define AON_REG_SIMO_REG7X_ENFBC_1245_Pos                                                                                16U
#define AON_REG_SIMO_REG7X_ENFBC_1245_Msk                                                                                (0x1UL << AON_REG_SIMO_REG7X_ENFBC_1245_Pos)

#define AON_REG_SIMO_REG7X_ENFBC_3_Pos                                                                                   17U
#define AON_REG_SIMO_REG7X_ENFBC_3_Msk                                                                                   (0x1UL << AON_REG_SIMO_REG7X_ENFBC_3_Pos)

#define AON_REG_SIMO_REG7X_SEL_CMPLQ_IQ2X_14_Pos                                                                         18U
#define AON_REG_SIMO_REG7X_SEL_CMPLQ_IQ2X_14_Msk                                                                         (0x1UL << AON_REG_SIMO_REG7X_SEL_CMPLQ_IQ2X_14_Pos)

#define AON_REG_SIMO_REG7X_SEL_CMPLQ_IQ2X_25_Pos                                                                         19U
#define AON_REG_SIMO_REG7X_SEL_CMPLQ_IQ2X_25_Msk                                                                         (0x1UL << AON_REG_SIMO_REG7X_SEL_CMPLQ_IQ2X_25_Pos)

#define AON_REG_SIMO_REG7X_SEL_CMPHQ_IQ2X_1245_Pos                                                                       20U
#define AON_REG_SIMO_REG7X_SEL_CMPHQ_IQ2X_1245_Msk                                                                       (0x1UL << AON_REG_SIMO_REG7X_SEL_CMPHQ_IQ2X_1245_Pos)

#define AON_REG_SIMO_REG7X_SEL_CMPHQ_IQ2X_3_Pos                                                                          21U
#define AON_REG_SIMO_REG7X_SEL_CMPHQ_IQ2X_3_Msk                                                                          (0x1UL << AON_REG_SIMO_REG7X_SEL_CMPHQ_IQ2X_3_Pos)

#define AON_REG_SIMO_REG7X_SEL_PS_1_0_Pos                                                                                22U
#define AON_REG_SIMO_REG7X_SEL_PS_1_0_Msk                                                                                (0x3UL << AON_REG_SIMO_REG7X_SEL_PS_1_0_Pos)

#define AON_REG_SIMO_REG7X_ENB_AUTO_PS_Pos                                                                               24U
#define AON_REG_SIMO_REG7X_ENB_AUTO_PS_Msk                                                                               (0x1UL << AON_REG_SIMO_REG7X_ENB_AUTO_PS_Pos)

#define AON_REG_SIMO_REG7X_SEL_SYNC2_Pos                                                                                 25U
#define AON_REG_SIMO_REG7X_SEL_SYNC2_Msk                                                                                 (0x1UL << AON_REG_SIMO_REG7X_SEL_SYNC2_Pos)

#define AON_REG_SIMO_REG7X_EN_SYNC2_Pos                                                                                  26U
#define AON_REG_SIMO_REG7X_EN_SYNC2_Msk                                                                                  (0x1UL << AON_REG_SIMO_REG7X_EN_SYNC2_Pos)

#define AON_REG_SIMO_REG7X_STICKY_CODE_Pos                                                                               27U
#define AON_REG_SIMO_REG7X_STICKY_CODE_Msk                                                                               (0x1FUL << AON_REG_SIMO_REG7X_STICKY_CODE_Pos)

/* 0x69C    0x4000_069c
    1:0     R/W     C2DT2_SET                                                   2'b00
    2       R/W     C2DT2_LDLY                                                  1'b0
    3       R/W     C2DT2_BP                                                    1'b1
    5:4     R/W     C2DT1_SET                                                   2'b00
    6       R/W     C2DT1_LDLY                                                  1'b0
    7       R/W     C2DT1_BP                                                    1'b1
    9:8     R/W     C1DT2_SET                                                   2'b00
    10      R/W     C1DT2_LDLY                                                  1'b0
    11      R/W     C1DT2_BP                                                    1'b1
    13:12   R/W     C1DT1_SET                                                   2'b00
    14      R/W     C1DT1_LDLY                                                  1'b0
    15      R/W     C1DT1_BP                                                    1'b1
    16      R/W     REG17X_DMY2                                                 1'b0
    18:17   R/W     DRV41_DT                                                    2'b00
    20:19   R/W     DRV3_SRC                                                    2'b11
    22:21   R/W     DRV3_SNK                                                    2'b11
    24:23   R/W     DRV2_SRC                                                    2'b11
    26:25   R/W     DRV2_SNK                                                    2'b11
    28:27   R/W     DRV1_SRC                                                    2'b11
    30:29   R/W     DRV1_SNK                                                    2'b11
    31      R/W     REG17X_DMY1                                                 1'b0
 */
typedef union _AON_REG_SIMO_REG8X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t C2DT2_SET: 2;
        uint32_t C2DT2_LDLY: 1;
        uint32_t C2DT2_BP: 1;
        uint32_t C2DT1_SET: 2;
        uint32_t C2DT1_LDLY: 1;
        uint32_t C2DT1_BP: 1;
        uint32_t C1DT2_SET: 2;
        uint32_t C1DT2_LDLY: 1;
        uint32_t C1DT2_BP: 1;
        uint32_t C1DT1_SET: 2;
        uint32_t C1DT1_LDLY: 1;
        uint32_t C1DT1_BP: 1;
        uint32_t REG17X_DMY2: 1;
        uint32_t DRV41_DT: 2;
        uint32_t DRV3_SRC: 2;
        uint32_t DRV3_SNK: 2;
        uint32_t DRV2_SRC: 2;
        uint32_t DRV2_SNK: 2;
        uint32_t DRV1_SRC: 2;
        uint32_t DRV1_SNK: 2;
        uint32_t REG17X_DMY1: 1;
    };
} AON_REG_SIMO_REG8X_TYPE;

/*0x4000_069c AON_REG_SIMO_REG8X*/
#define AON_REG_SIMO_REG8X_C2DT2_SET_Pos                                                                                 0U
#define AON_REG_SIMO_REG8X_C2DT2_SET_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG8X_C2DT2_SET_Pos)

#define AON_REG_SIMO_REG8X_C2DT2_LDLY_Pos                                                                                2U
#define AON_REG_SIMO_REG8X_C2DT2_LDLY_Msk                                                                                (0x1UL << AON_REG_SIMO_REG8X_C2DT2_LDLY_Pos)

#define AON_REG_SIMO_REG8X_C2DT2_BP_Pos                                                                                  3U
#define AON_REG_SIMO_REG8X_C2DT2_BP_Msk                                                                                  (0x1UL << AON_REG_SIMO_REG8X_C2DT2_BP_Pos)

