rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SIMO_REG8X_C2DT1_SET_Pos                                                                                 4U
#define AON_REG_SIMO_REG8X_C2DT1_SET_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG8X_C2DT1_SET_Pos)

#define AON_REG_SIMO_REG8X_C2DT1_LDLY_Pos                                                                                6U
#define AON_REG_SIMO_REG8X_C2DT1_LDLY_Msk                                                                                (0x1UL << AON_REG_SIMO_REG8X_C2DT1_LDLY_Pos)

#define AON_REG_SIMO_REG8X_C2DT1_BP_Pos                                                                                  7U
#define AON_REG_SIMO_REG8X_C2DT1_BP_Msk                                                                                  (0x1UL << AON_REG_SIMO_REG8X_C2DT1_BP_Pos)

#define AON_REG_SIMO_REG8X_C1DT2_SET_Pos                                                                                 8U
#define AON_REG_SIMO_REG8X_C1DT2_SET_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG8X_C1DT2_SET_Pos)

#define AON_REG_SIMO_REG8X_C1DT2_LDLY_Pos                                                                                10U
#define AON_REG_SIMO_REG8X_C1DT2_LDLY_Msk                                                                                (0x1UL << AON_REG_SIMO_REG8X_C1DT2_LDLY_Pos)

#define AON_REG_SIMO_REG8X_C1DT2_BP_Pos                                                                                  11U
#define AON_REG_SIMO_REG8X_C1DT2_BP_Msk                                                                                  (0x1UL << AON_REG_SIMO_REG8X_C1DT2_BP_Pos)

#define AON_REG_SIMO_REG8X_C1DT1_SET_Pos                                                                                 12U
#define AON_REG_SIMO_REG8X_C1DT1_SET_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG8X_C1DT1_SET_Pos)

#define AON_REG_SIMO_REG8X_C1DT1_LDLY_Pos                                                                                14U
#define AON_REG_SIMO_REG8X_C1DT1_LDLY_Msk                                                                                (0x1UL << AON_REG_SIMO_REG8X_C1DT1_LDLY_Pos)

#define AON_REG_SIMO_REG8X_C1DT1_BP_Pos                                                                                  15U
#define AON_REG_SIMO_REG8X_C1DT1_BP_Msk                                                                                  (0x1UL << AON_REG_SIMO_REG8X_C1DT1_BP_Pos)

#define AON_REG_SIMO_REG8X_REG17X_DMY2_Pos                                                                               16U
#define AON_REG_SIMO_REG8X_REG17X_DMY2_Msk                                                                               (0x1UL << AON_REG_SIMO_REG8X_REG17X_DMY2_Pos)

#define AON_REG_SIMO_REG8X_DRV41_DT_Pos                                                                                  17U
#define AON_REG_SIMO_REG8X_DRV41_DT_Msk                                                                                  (0x3UL << AON_REG_SIMO_REG8X_DRV41_DT_Pos)

#define AON_REG_SIMO_REG8X_DRV3_SRC_Pos                                                                                  19U
#define AON_REG_SIMO_REG8X_DRV3_SRC_Msk                                                                                  (0x3UL << AON_REG_SIMO_REG8X_DRV3_SRC_Pos)

#define AON_REG_SIMO_REG8X_DRV3_SNK_Pos                                                                                  21U
#define AON_REG_SIMO_REG8X_DRV3_SNK_Msk                                                                                  (0x3UL << AON_REG_SIMO_REG8X_DRV3_SNK_Pos)

#define AON_REG_SIMO_REG8X_DRV2_SRC_Pos                                                                                  23U
#define AON_REG_SIMO_REG8X_DRV2_SRC_Msk                                                                                  (0x3UL << AON_REG_SIMO_REG8X_DRV2_SRC_Pos)

#define AON_REG_SIMO_REG8X_DRV2_SNK_Pos                                                                                  25U
#define AON_REG_SIMO_REG8X_DRV2_SNK_Msk                                                                                  (0x3UL << AON_REG_SIMO_REG8X_DRV2_SNK_Pos)

#define AON_REG_SIMO_REG8X_DRV1_SRC_Pos                                                                                  27U
#define AON_REG_SIMO_REG8X_DRV1_SRC_Msk                                                                                  (0x3UL << AON_REG_SIMO_REG8X_DRV1_SRC_Pos)

#define AON_REG_SIMO_REG8X_DRV1_SNK_Pos                                                                                  29U
#define AON_REG_SIMO_REG8X_DRV1_SNK_Msk                                                                                  (0x3UL << AON_REG_SIMO_REG8X_DRV1_SNK_Pos)

#define AON_REG_SIMO_REG8X_REG17X_DMY1_Pos                                                                               31U
#define AON_REG_SIMO_REG8X_REG17X_DMY1_Msk                                                                               (0x1UL << AON_REG_SIMO_REG8X_REG17X_DMY1_Pos)

/* 0x6A0    0x4000_06a0
    3:0     R/W     REG18X_DMY                                                  4'b0000
    5:4     R/W     DRV43_SRC                                                   2'b11
    6       R/W     DRV43_EN_WELL_LX2                                           1'b1
    8:7     R/W     DRV43_DT                                                    2'b00
    9       R/W     DRV42_EN_WELL_LX2                                           1'b1
    11:10   R/W     DRV42_DT                                                    2'b00
    13:12   R/W     DRV41_SRC                                                   2'b11
    15:14   R/W     DRV41_SNK                                                   2'b11
    16      R/W     VDDIO_EN_DISCHG                                             1'b0
    17      R/W     VDDIO_EN_PC2                                                1'b0
    18      R/W     VDDIO_EN_PC1                                                1'b0
    21:19   R/W     DRV4DT_BP_2_0                                               3'b000
    23:22   R/W     DRV45_SRC                                                   2'b11
    24      R/W     DRV45_EN_WELL_LX2                                           1'b1
    26:25   R/W     DRV45_DT                                                    2'b00
    28:27   R/W     DRV44_SRC                                                   2'b11
    29      R/W     DRV44_EN_WELL_LX2                                           1'b1
    31:30   R/W     DRV44_DT                                                    2'b00
 */
typedef union _AON_REG_SIMO_REG9X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG18X_DMY: 4;
        uint32_t DRV43_SRC: 2;
        uint32_t DRV43_EN_WELL_LX2: 1;
        uint32_t DRV43_DT: 2;
        uint32_t DRV42_EN_WELL_LX2: 1;
        uint32_t DRV42_DT: 2;
        uint32_t DRV41_SRC: 2;
        uint32_t DRV41_SNK: 2;
        uint32_t VDDIO_EN_DISCHG: 1;
        uint32_t VDDIO_EN_PC2: 1;
        uint32_t VDDIO_EN_PC1: 1;
        uint32_t DRV4DT_BP_2_0: 3;
        uint32_t DRV45_SRC: 2;
        uint32_t DRV45_EN_WELL_LX2: 1;
        uint32_t DRV45_DT: 2;
        uint32_t DRV44_SRC: 2;
        uint32_t DRV44_EN_WELL_LX2: 1;
        uint32_t DRV44_DT: 2;
    };
} AON_REG_SIMO_REG9X_TYPE;

/*0x4000_06a0 AON_REG_SIMO_REG9X*/
#define AON_REG_SIMO_REG9X_REG18X_DMY_Pos                                                                                0U
#define AON_REG_SIMO_REG9X_REG18X_DMY_Msk                                                                                (0xFUL << AON_REG_SIMO_REG9X_REG18X_DMY_Pos)

#define AON_REG_SIMO_REG9X_DRV43_SRC_Pos                                                                                 4U
#define AON_REG_SIMO_REG9X_DRV43_SRC_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG9X_DRV43_SRC_Pos)

