rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SIMO_REG9X_DRV43_EN_WELL_LX2_Pos                                                                         6U
#define AON_REG_SIMO_REG9X_DRV43_EN_WELL_LX2_Msk                                                                         (0x1UL << AON_REG_SIMO_REG9X_DRV43_EN_WELL_LX2_Pos)

#define AON_REG_SIMO_REG9X_DRV43_DT_Pos                                                                                  7U
#define AON_REG_SIMO_REG9X_DRV43_DT_Msk                                                                                  (0x3UL << AON_REG_SIMO_REG9X_DRV43_DT_Pos)

#define AON_REG_SIMO_REG9X_DRV42_EN_WELL_LX2_Pos                                                                         9U
#define AON_REG_SIMO_REG9X_DRV42_EN_WELL_LX2_Msk                                                                         (0x1UL << AON_REG_SIMO_REG9X_DRV42_EN_WELL_LX2_Pos)

#define AON_REG_SIMO_REG9X_DRV42_DT_Pos                                                                                  10U
#define AON_REG_SIMO_REG9X_DRV42_DT_Msk                                                                                  (0x3UL << AON_REG_SIMO_REG9X_DRV42_DT_Pos)

#define AON_REG_SIMO_REG9X_DRV41_SRC_Pos                                                                                 12U
#define AON_REG_SIMO_REG9X_DRV41_SRC_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG9X_DRV41_SRC_Pos)

#define AON_REG_SIMO_REG9X_DRV41_SNK_Pos                                                                                 14U
#define AON_REG_SIMO_REG9X_DRV41_SNK_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG9X_DRV41_SNK_Pos)

#define AON_REG_SIMO_REG9X_VDDIO_EN_DISCHG_Pos                                                                           16U
#define AON_REG_SIMO_REG9X_VDDIO_EN_DISCHG_Msk                                                                           (0x1UL << AON_REG_SIMO_REG9X_VDDIO_EN_DISCHG_Pos)

#define AON_REG_SIMO_REG9X_VDDIO_EN_PC2_Pos                                                                              17U
#define AON_REG_SIMO_REG9X_VDDIO_EN_PC2_Msk                                                                              (0x1UL << AON_REG_SIMO_REG9X_VDDIO_EN_PC2_Pos)

#define AON_REG_SIMO_REG9X_VDDIO_EN_PC1_Pos                                                                              18U
#define AON_REG_SIMO_REG9X_VDDIO_EN_PC1_Msk                                                                              (0x1UL << AON_REG_SIMO_REG9X_VDDIO_EN_PC1_Pos)

#define AON_REG_SIMO_REG9X_DRV4DT_BP_2_0_Pos                                                                             19U
#define AON_REG_SIMO_REG9X_DRV4DT_BP_2_0_Msk                                                                             (0x7UL << AON_REG_SIMO_REG9X_DRV4DT_BP_2_0_Pos)

#define AON_REG_SIMO_REG9X_DRV45_SRC_Pos                                                                                 22U
#define AON_REG_SIMO_REG9X_DRV45_SRC_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG9X_DRV45_SRC_Pos)

#define AON_REG_SIMO_REG9X_DRV45_EN_WELL_LX2_Pos                                                                         24U
#define AON_REG_SIMO_REG9X_DRV45_EN_WELL_LX2_Msk                                                                         (0x1UL << AON_REG_SIMO_REG9X_DRV45_EN_WELL_LX2_Pos)

#define AON_REG_SIMO_REG9X_DRV45_DT_Pos                                                                                  25U
#define AON_REG_SIMO_REG9X_DRV45_DT_Msk                                                                                  (0x3UL << AON_REG_SIMO_REG9X_DRV45_DT_Pos)

#define AON_REG_SIMO_REG9X_DRV44_SRC_Pos                                                                                 27U
#define AON_REG_SIMO_REG9X_DRV44_SRC_Msk                                                                                 (0x3UL << AON_REG_SIMO_REG9X_DRV44_SRC_Pos)

#define AON_REG_SIMO_REG9X_DRV44_EN_WELL_LX2_Pos                                                                         29U
#define AON_REG_SIMO_REG9X_DRV44_EN_WELL_LX2_Msk                                                                         (0x1UL << AON_REG_SIMO_REG9X_DRV44_EN_WELL_LX2_Pos)

#define AON_REG_SIMO_REG9X_DRV44_DT_Pos                                                                                  30U
#define AON_REG_SIMO_REG9X_DRV44_DT_Msk                                                                                  (0x3UL << AON_REG_SIMO_REG9X_DRV44_DT_Pos)

/* 0x6A4    0x4000_06a4
    0       R       ENHQ_RDY_SYNC                                               1'b0
    1       R       EN_POST_SYNC                                                1'b0
    2       R       ZC_SET_O                                                    1'b0
    3       R       ZC_POR_O                                                    1'b0
    4       R       PRI_SEL_OK                                                  1'b0
    5       R       PRI_TRIG                                                    1'b0
    6       R       MINOFFOK                                                    1'b0
    7       R       ENTON                                                       1'b0
    8       R       ENTON1                                                      1'b0
    9       R       OCCUPY_OR                                                   1'b0
    10      R       PWMTONU1_0                                                  1'b0
    11      R       PWMTONL2_0                                                  1'b0
    12      R       HYS_BUCK_AC                                                 1'b0
    13      R       HYS_BST_AC                                                  1'b0
    14      R       CMP_BUCK_DC_OUT                                             1'b0
    15      R       CMP_BST_DC_OUT                                              1'b0
    16      R       ENPOST_D                                                    1'b0
    17      R       ENPOST                                                      1'b0
    18      R       VOUT2_ZCPOR                                                 1'b0
    19      R       PORB_VOUTT1                                                 1'b0
    20      R       SEL_A_I                                                     1'b0
    21      R       CCM_NEED                                                    1'b0
    22      R       ENLPM_SYNC                                                  1'b0
    23      R       DRV1_EN_NCP                                                 1'b0
    24      R       ENTON2_UG2                                                  1'b0
    25      R       POWTONL2                                                    1'b0
    26      R       ENLG1                                                       1'b0
    27      R       POWTONU1                                                    1'b0
    28      R       IBTHR_RDY                                                   1'b0
    29      R       UABIAS_RDY2                                                 1'b0
    30      R       UABIAS_RDY                                                  1'b0
    31      R       ENUABIAS                                                    1'b0
 */
typedef union _AON_C_KOUT0X_SIMO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENHQ_RDY_SYNC: 1;
        uint32_t EN_POST_SYNC: 1;
        uint32_t ZC_SET_O: 1;
        uint32_t ZC_POR_O: 1;
        uint32_t PRI_SEL_OK: 1;
        uint32_t PRI_TRIG: 1;
        uint32_t MINOFFOK: 1;
        uint32_t ENTON: 1;
        uint32_t ENTON1: 1;
        uint32_t OCCUPY_OR: 1;
        uint32_t PWMTONU1_0: 1;
        uint32_t PWMTONL2_0: 1;
        uint32_t HYS_BUCK_AC: 1;
        uint32_t HYS_BST_AC: 1;
        uint32_t CMP_BUCK_DC_OUT: 1;
        uint32_t CMP_BST_DC_OUT: 1;
        uint32_t ENPOST_D: 1;
        uint32_t ENPOST: 1;
        uint32_t VOUT2_ZCPOR: 1;
        uint32_t PORB_VOUTT1: 1;
        uint32_t SEL_A_I: 1;
        uint32_t CCM_NEED: 1;
        uint32_t ENLPM_SYNC: 1;
        uint32_t DRV1_EN_NCP: 1;
        uint32_t ENTON2_UG2: 1;
        uint32_t POWTONL2: 1;
        uint32_t ENLG1: 1;
        uint32_t POWTONU1: 1;
        uint32_t IBTHR_RDY: 1;
        uint32_t UABIAS_RDY2: 1;
        uint32_t UABIAS_RDY: 1;
        uint32_t ENUABIAS: 1;
    };
} AON_C_KOUT0X_SIMO_TYPE;

