rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_06a4 AON_C_KOUT0X_SIMO*/
#define AON_C_KOUT0X_SIMO_ENHQ_RDY_SYNC_Pos                                                                              0U
#define AON_C_KOUT0X_SIMO_ENHQ_RDY_SYNC_Msk                                                                              (0x1UL << AON_C_KOUT0X_SIMO_ENHQ_RDY_SYNC_Pos)

#define AON_C_KOUT0X_SIMO_EN_POST_SYNC_Pos                                                                               1U
#define AON_C_KOUT0X_SIMO_EN_POST_SYNC_Msk                                                                               (0x1UL << AON_C_KOUT0X_SIMO_EN_POST_SYNC_Pos)

#define AON_C_KOUT0X_SIMO_ZC_SET_O_Pos                                                                                   2U
#define AON_C_KOUT0X_SIMO_ZC_SET_O_Msk                                                                                   (0x1UL << AON_C_KOUT0X_SIMO_ZC_SET_O_Pos)

#define AON_C_KOUT0X_SIMO_ZC_POR_O_Pos                                                                                   3U
#define AON_C_KOUT0X_SIMO_ZC_POR_O_Msk                                                                                   (0x1UL << AON_C_KOUT0X_SIMO_ZC_POR_O_Pos)

#define AON_C_KOUT0X_SIMO_PRI_SEL_OK_Pos                                                                                 4U
#define AON_C_KOUT0X_SIMO_PRI_SEL_OK_Msk                                                                                 (0x1UL << AON_C_KOUT0X_SIMO_PRI_SEL_OK_Pos)

#define AON_C_KOUT0X_SIMO_PRI_TRIG_Pos                                                                                   5U
#define AON_C_KOUT0X_SIMO_PRI_TRIG_Msk                                                                                   (0x1UL << AON_C_KOUT0X_SIMO_PRI_TRIG_Pos)

#define AON_C_KOUT0X_SIMO_MINOFFOK_Pos                                                                                   6U
#define AON_C_KOUT0X_SIMO_MINOFFOK_Msk                                                                                   (0x1UL << AON_C_KOUT0X_SIMO_MINOFFOK_Pos)

#define AON_C_KOUT0X_SIMO_ENTON_Pos                                                                                      7U
#define AON_C_KOUT0X_SIMO_ENTON_Msk                                                                                      (0x1UL << AON_C_KOUT0X_SIMO_ENTON_Pos)

#define AON_C_KOUT0X_SIMO_ENTON1_Pos                                                                                     8U
#define AON_C_KOUT0X_SIMO_ENTON1_Msk                                                                                     (0x1UL << AON_C_KOUT0X_SIMO_ENTON1_Pos)

#define AON_C_KOUT0X_SIMO_OCCUPY_OR_Pos                                                                                  9U
#define AON_C_KOUT0X_SIMO_OCCUPY_OR_Msk                                                                                  (0x1UL << AON_C_KOUT0X_SIMO_OCCUPY_OR_Pos)

#define AON_C_KOUT0X_SIMO_PWMTONU1_0_Pos                                                                                 10U
#define AON_C_KOUT0X_SIMO_PWMTONU1_0_Msk                                                                                 (0x1UL << AON_C_KOUT0X_SIMO_PWMTONU1_0_Pos)

#define AON_C_KOUT0X_SIMO_PWMTONL2_0_Pos                                                                                 11U
#define AON_C_KOUT0X_SIMO_PWMTONL2_0_Msk                                                                                 (0x1UL << AON_C_KOUT0X_SIMO_PWMTONL2_0_Pos)

#define AON_C_KOUT0X_SIMO_HYS_BUCK_AC_Pos                                                                                12U
#define AON_C_KOUT0X_SIMO_HYS_BUCK_AC_Msk                                                                                (0x1UL << AON_C_KOUT0X_SIMO_HYS_BUCK_AC_Pos)

#define AON_C_KOUT0X_SIMO_HYS_BST_AC_Pos                                                                                 13U
#define AON_C_KOUT0X_SIMO_HYS_BST_AC_Msk                                                                                 (0x1UL << AON_C_KOUT0X_SIMO_HYS_BST_AC_Pos)

#define AON_C_KOUT0X_SIMO_CMP_BUCK_DC_OUT_Pos                                                                            14U
#define AON_C_KOUT0X_SIMO_CMP_BUCK_DC_OUT_Msk                                                                            (0x1UL << AON_C_KOUT0X_SIMO_CMP_BUCK_DC_OUT_Pos)

#define AON_C_KOUT0X_SIMO_CMP_BST_DC_OUT_Pos                                                                             15U
#define AON_C_KOUT0X_SIMO_CMP_BST_DC_OUT_Msk                                                                             (0x1UL << AON_C_KOUT0X_SIMO_CMP_BST_DC_OUT_Pos)

#define AON_C_KOUT0X_SIMO_ENPOST_D_Pos                                                                                   16U
#define AON_C_KOUT0X_SIMO_ENPOST_D_Msk                                                                                   (0x1UL << AON_C_KOUT0X_SIMO_ENPOST_D_Pos)

#define AON_C_KOUT0X_SIMO_ENPOST_Pos                                                                                     17U
#define AON_C_KOUT0X_SIMO_ENPOST_Msk                                                                                     (0x1UL << AON_C_KOUT0X_SIMO_ENPOST_Pos)

#define AON_C_KOUT0X_SIMO_VOUT2_ZCPOR_Pos                                                                                18U
#define AON_C_KOUT0X_SIMO_VOUT2_ZCPOR_Msk                                                                                (0x1UL << AON_C_KOUT0X_SIMO_VOUT2_ZCPOR_Pos)

#define AON_C_KOUT0X_SIMO_PORB_VOUTT1_Pos                                                                                19U
#define AON_C_KOUT0X_SIMO_PORB_VOUTT1_Msk                                                                                (0x1UL << AON_C_KOUT0X_SIMO_PORB_VOUTT1_Pos)

#define AON_C_KOUT0X_SIMO_SEL_A_I_Pos                                                                                    20U
#define AON_C_KOUT0X_SIMO_SEL_A_I_Msk                                                                                    (0x1UL << AON_C_KOUT0X_SIMO_SEL_A_I_Pos)

