rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_C_KOUT0X_SIMO_CCM_NEED_Pos                                                                                   21U
#define AON_C_KOUT0X_SIMO_CCM_NEED_Msk                                                                                   (0x1UL << AON_C_KOUT0X_SIMO_CCM_NEED_Pos)

#define AON_C_KOUT0X_SIMO_ENLPM_SYNC_Pos                                                                                 22U
#define AON_C_KOUT0X_SIMO_ENLPM_SYNC_Msk                                                                                 (0x1UL << AON_C_KOUT0X_SIMO_ENLPM_SYNC_Pos)

#define AON_C_KOUT0X_SIMO_DRV1_EN_NCP_Pos                                                                                23U
#define AON_C_KOUT0X_SIMO_DRV1_EN_NCP_Msk                                                                                (0x1UL << AON_C_KOUT0X_SIMO_DRV1_EN_NCP_Pos)

#define AON_C_KOUT0X_SIMO_ENTON2_UG2_Pos                                                                                 24U
#define AON_C_KOUT0X_SIMO_ENTON2_UG2_Msk                                                                                 (0x1UL << AON_C_KOUT0X_SIMO_ENTON2_UG2_Pos)

#define AON_C_KOUT0X_SIMO_POWTONL2_Pos                                                                                   25U
#define AON_C_KOUT0X_SIMO_POWTONL2_Msk                                                                                   (0x1UL << AON_C_KOUT0X_SIMO_POWTONL2_Pos)

#define AON_C_KOUT0X_SIMO_ENLG1_Pos                                                                                      26U
#define AON_C_KOUT0X_SIMO_ENLG1_Msk                                                                                      (0x1UL << AON_C_KOUT0X_SIMO_ENLG1_Pos)

#define AON_C_KOUT0X_SIMO_POWTONU1_Pos                                                                                   27U
#define AON_C_KOUT0X_SIMO_POWTONU1_Msk                                                                                   (0x1UL << AON_C_KOUT0X_SIMO_POWTONU1_Pos)

#define AON_C_KOUT0X_SIMO_IBTHR_RDY_Pos                                                                                  28U
#define AON_C_KOUT0X_SIMO_IBTHR_RDY_Msk                                                                                  (0x1UL << AON_C_KOUT0X_SIMO_IBTHR_RDY_Pos)

#define AON_C_KOUT0X_SIMO_UABIAS_RDY2_Pos                                                                                29U
#define AON_C_KOUT0X_SIMO_UABIAS_RDY2_Msk                                                                                (0x1UL << AON_C_KOUT0X_SIMO_UABIAS_RDY2_Pos)

#define AON_C_KOUT0X_SIMO_UABIAS_RDY_Pos                                                                                 30U
#define AON_C_KOUT0X_SIMO_UABIAS_RDY_Msk                                                                                 (0x1UL << AON_C_KOUT0X_SIMO_UABIAS_RDY_Pos)

#define AON_C_KOUT0X_SIMO_ENUABIAS_Pos                                                                                   31U
#define AON_C_KOUT0X_SIMO_ENUABIAS_Msk                                                                                   (0x1UL << AON_C_KOUT0X_SIMO_ENUABIAS_Pos)

/* 0x6A8    0x4000_06a8
    0       R       LX_DET1                                                     1'b0
    7:1     R       ZCDQ1                                                       7'b0000000
    8       R       ZCD_SET                                                     1'b0
    9       R       ENZCK                                                       1'b0
    10      R       ENZC_D                                                      1'b0
    11      R       ENPCCM                                                      1'b0
    12      R       ZCK_DLY3                                                    1'b0
    13      R       ZCK_DLY2                                                    1'b0
    14      R       ZCK_DLY1                                                    1'b0
    15      R       ZC_LCH                                                      1'b0
    16      R       LX_DET345                                                   1'b0
    23:17   R       ZCDQ345                                                     7'b0000000
    24      R       LX_DET2                                                     1'b0
    31:25   R       ZCDQ2                                                       7'b0000000
 */
typedef union _AON_C_KOUT1X_SIMO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LX_DET1: 1;
        uint32_t ZCDQ1: 7;
        uint32_t ZCD_SET: 1;
        uint32_t ENZCK: 1;
        uint32_t ENZC_D: 1;
        uint32_t ENPCCM: 1;
        uint32_t ZCK_DLY3: 1;
        uint32_t ZCK_DLY2: 1;
        uint32_t ZCK_DLY1: 1;
        uint32_t ZC_LCH: 1;
        uint32_t LX_DET345: 1;
        uint32_t ZCDQ345: 7;
        uint32_t LX_DET2: 1;
        uint32_t ZCDQ2: 7;
    };
} AON_C_KOUT1X_SIMO_TYPE;

/*0x4000_06a8 AON_C_KOUT1X_SIMO*/
#define AON_C_KOUT1X_SIMO_LX_DET1_Pos                                                                                    0U
#define AON_C_KOUT1X_SIMO_LX_DET1_Msk                                                                                    (0x1UL << AON_C_KOUT1X_SIMO_LX_DET1_Pos)

#define AON_C_KOUT1X_SIMO_ZCDQ1_Pos                                                                                      1U
#define AON_C_KOUT1X_SIMO_ZCDQ1_Msk                                                                                      (0x7FUL << AON_C_KOUT1X_SIMO_ZCDQ1_Pos)

#define AON_C_KOUT1X_SIMO_ZCD_SET_Pos                                                                                    8U
#define AON_C_KOUT1X_SIMO_ZCD_SET_Msk                                                                                    (0x1UL << AON_C_KOUT1X_SIMO_ZCD_SET_Pos)

#define AON_C_KOUT1X_SIMO_ENZCK_Pos                                                                                      9U
#define AON_C_KOUT1X_SIMO_ENZCK_Msk                                                                                      (0x1UL << AON_C_KOUT1X_SIMO_ENZCK_Pos)

