rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_C_KOUT1X_SIMO_ENZC_D_Pos                                                                                     10U
#define AON_C_KOUT1X_SIMO_ENZC_D_Msk                                                                                     (0x1UL << AON_C_KOUT1X_SIMO_ENZC_D_Pos)

#define AON_C_KOUT1X_SIMO_ENPCCM_Pos                                                                                     11U
#define AON_C_KOUT1X_SIMO_ENPCCM_Msk                                                                                     (0x1UL << AON_C_KOUT1X_SIMO_ENPCCM_Pos)

#define AON_C_KOUT1X_SIMO_ZCK_DLY3_Pos                                                                                   12U
#define AON_C_KOUT1X_SIMO_ZCK_DLY3_Msk                                                                                   (0x1UL << AON_C_KOUT1X_SIMO_ZCK_DLY3_Pos)

#define AON_C_KOUT1X_SIMO_ZCK_DLY2_Pos                                                                                   13U
#define AON_C_KOUT1X_SIMO_ZCK_DLY2_Msk                                                                                   (0x1UL << AON_C_KOUT1X_SIMO_ZCK_DLY2_Pos)

#define AON_C_KOUT1X_SIMO_ZCK_DLY1_Pos                                                                                   14U
#define AON_C_KOUT1X_SIMO_ZCK_DLY1_Msk                                                                                   (0x1UL << AON_C_KOUT1X_SIMO_ZCK_DLY1_Pos)

#define AON_C_KOUT1X_SIMO_ZC_LCH_Pos                                                                                     15U
#define AON_C_KOUT1X_SIMO_ZC_LCH_Msk                                                                                     (0x1UL << AON_C_KOUT1X_SIMO_ZC_LCH_Pos)

#define AON_C_KOUT1X_SIMO_LX_DET345_Pos                                                                                  16U
#define AON_C_KOUT1X_SIMO_LX_DET345_Msk                                                                                  (0x1UL << AON_C_KOUT1X_SIMO_LX_DET345_Pos)

#define AON_C_KOUT1X_SIMO_ZCDQ345_Pos                                                                                    17U
#define AON_C_KOUT1X_SIMO_ZCDQ345_Msk                                                                                    (0x7FUL << AON_C_KOUT1X_SIMO_ZCDQ345_Pos)

#define AON_C_KOUT1X_SIMO_LX_DET2_Pos                                                                                    24U
#define AON_C_KOUT1X_SIMO_LX_DET2_Msk                                                                                    (0x1UL << AON_C_KOUT1X_SIMO_LX_DET2_Pos)

#define AON_C_KOUT1X_SIMO_ZCDQ2_Pos                                                                                      25U
#define AON_C_KOUT1X_SIMO_ZCDQ2_Msk                                                                                      (0x7FUL << AON_C_KOUT1X_SIMO_ZCDQ2_Pos)

/* 0x6AC    0x4000_06ac
    2:0     R       CKOUT4X_DMY                                                 3'b000
    3       R       LG2_S_OFF                                                   1'b0
    4       R       U2_S                                                        1'b0
    5       R       LG1_S_OFF                                                   1'b0
    6       R       UG1_S_OFF                                                   1'b0
    7       R       L2                                                          1'b0
    8       R       U2                                                          1'b0
    9       R       L1                                                          1'b0
    10      R       U1                                                          1'b0
    15:11   R       CMP                                                         5'b00000
    19:16   R       CKOUT5X_DMY                                                 4'b0000
    20      R       TM_BUCK_DC                                                  1'b0
    21      R       TM_BST_DC                                                   1'b0
    22      R       OPOR_LD_LPM                                                 1'b0
    23      R       ENPOST_F_SYNC                                               1'b0
    24      R       ENPCCM_LV2                                                  1'b0
    25      R       BUCK_DET_H                                                  1'b0
    26      R       BST_DET_H                                                   1'b0
    27      R       ENZC                                                        1'b0
    28      R       IPTAT_OK_D_SIMO                                             1'b0
    29      R       IPTAT_OK_SIMO                                               1'b0
    30      R       EN_D                                                        1'b0
    31      R       EN                                                          1'b0
 */
typedef union _AON_C_KOUT2X_SIMO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CKOUT4X_DMY: 3;
        uint32_t LG2_S_OFF: 1;
        uint32_t U2_S: 1;
        uint32_t LG1_S_OFF: 1;
        uint32_t UG1_S_OFF: 1;
        uint32_t L2: 1;
        uint32_t U2: 1;
        uint32_t L1: 1;
        uint32_t U1: 1;
        uint32_t CMP: 5;
        uint32_t CKOUT5X_DMY: 4;
        uint32_t TM_BUCK_DC: 1;
        uint32_t TM_BST_DC: 1;
        uint32_t OPOR_LD_LPM: 1;
        uint32_t ENPOST_F_SYNC: 1;
        uint32_t ENPCCM_LV2: 1;
        uint32_t BUCK_DET_H: 1;
        uint32_t BST_DET_H: 1;
        uint32_t ENZC: 1;
        uint32_t IPTAT_OK_D_SIMO: 1;
        uint32_t IPTAT_OK_SIMO: 1;
        uint32_t EN_D: 1;
        uint32_t EN: 1;
    };
} AON_C_KOUT2X_SIMO_TYPE;

/*0x4000_06ac AON_C_KOUT2X_SIMO*/
#define AON_C_KOUT2X_SIMO_CKOUT4X_DMY_Pos                                                                                0U
#define AON_C_KOUT2X_SIMO_CKOUT4X_DMY_Msk                                                                                (0x7UL << AON_C_KOUT2X_SIMO_CKOUT4X_DMY_Pos)

#define AON_C_KOUT2X_SIMO_LG2_S_OFF_Pos                                                                                  3U
#define AON_C_KOUT2X_SIMO_LG2_S_OFF_Msk                                                                                  (0x1UL << AON_C_KOUT2X_SIMO_LG2_S_OFF_Pos)

