rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_C_KOUT2X_SIMO_U2_S_Pos                                                                                       4U
#define AON_C_KOUT2X_SIMO_U2_S_Msk                                                                                       (0x1UL << AON_C_KOUT2X_SIMO_U2_S_Pos)

#define AON_C_KOUT2X_SIMO_LG1_S_OFF_Pos                                                                                  5U
#define AON_C_KOUT2X_SIMO_LG1_S_OFF_Msk                                                                                  (0x1UL << AON_C_KOUT2X_SIMO_LG1_S_OFF_Pos)

#define AON_C_KOUT2X_SIMO_UG1_S_OFF_Pos                                                                                  6U
#define AON_C_KOUT2X_SIMO_UG1_S_OFF_Msk                                                                                  (0x1UL << AON_C_KOUT2X_SIMO_UG1_S_OFF_Pos)

#define AON_C_KOUT2X_SIMO_L2_Pos                                                                                         7U
#define AON_C_KOUT2X_SIMO_L2_Msk                                                                                         (0x1UL << AON_C_KOUT2X_SIMO_L2_Pos)

#define AON_C_KOUT2X_SIMO_U2_Pos                                                                                         8U
#define AON_C_KOUT2X_SIMO_U2_Msk                                                                                         (0x1UL << AON_C_KOUT2X_SIMO_U2_Pos)

#define AON_C_KOUT2X_SIMO_L1_Pos                                                                                         9U
#define AON_C_KOUT2X_SIMO_L1_Msk                                                                                         (0x1UL << AON_C_KOUT2X_SIMO_L1_Pos)

#define AON_C_KOUT2X_SIMO_U1_Pos                                                                                         10U
#define AON_C_KOUT2X_SIMO_U1_Msk                                                                                         (0x1UL << AON_C_KOUT2X_SIMO_U1_Pos)

#define AON_C_KOUT2X_SIMO_CMP_Pos                                                                                        11U
#define AON_C_KOUT2X_SIMO_CMP_Msk                                                                                        (0x1FUL << AON_C_KOUT2X_SIMO_CMP_Pos)

#define AON_C_KOUT2X_SIMO_CKOUT5X_DMY_Pos                                                                                16U
#define AON_C_KOUT2X_SIMO_CKOUT5X_DMY_Msk                                                                                (0xFUL << AON_C_KOUT2X_SIMO_CKOUT5X_DMY_Pos)

#define AON_C_KOUT2X_SIMO_TM_BUCK_DC_Pos                                                                                 20U
#define AON_C_KOUT2X_SIMO_TM_BUCK_DC_Msk                                                                                 (0x1UL << AON_C_KOUT2X_SIMO_TM_BUCK_DC_Pos)

#define AON_C_KOUT2X_SIMO_TM_BST_DC_Pos                                                                                  21U
#define AON_C_KOUT2X_SIMO_TM_BST_DC_Msk                                                                                  (0x1UL << AON_C_KOUT2X_SIMO_TM_BST_DC_Pos)

#define AON_C_KOUT2X_SIMO_OPOR_LD_LPM_Pos                                                                                22U
#define AON_C_KOUT2X_SIMO_OPOR_LD_LPM_Msk                                                                                (0x1UL << AON_C_KOUT2X_SIMO_OPOR_LD_LPM_Pos)

#define AON_C_KOUT2X_SIMO_ENPOST_F_SYNC_Pos                                                                              23U
#define AON_C_KOUT2X_SIMO_ENPOST_F_SYNC_Msk                                                                              (0x1UL << AON_C_KOUT2X_SIMO_ENPOST_F_SYNC_Pos)

#define AON_C_KOUT2X_SIMO_ENPCCM_LV2_Pos                                                                                 24U
#define AON_C_KOUT2X_SIMO_ENPCCM_LV2_Msk                                                                                 (0x1UL << AON_C_KOUT2X_SIMO_ENPCCM_LV2_Pos)

#define AON_C_KOUT2X_SIMO_BUCK_DET_H_Pos                                                                                 25U
#define AON_C_KOUT2X_SIMO_BUCK_DET_H_Msk                                                                                 (0x1UL << AON_C_KOUT2X_SIMO_BUCK_DET_H_Pos)

#define AON_C_KOUT2X_SIMO_BST_DET_H_Pos                                                                                  26U
#define AON_C_KOUT2X_SIMO_BST_DET_H_Msk                                                                                  (0x1UL << AON_C_KOUT2X_SIMO_BST_DET_H_Pos)

#define AON_C_KOUT2X_SIMO_ENZC_Pos                                                                                       27U
#define AON_C_KOUT2X_SIMO_ENZC_Msk                                                                                       (0x1UL << AON_C_KOUT2X_SIMO_ENZC_Pos)

#define AON_C_KOUT2X_SIMO_IPTAT_OK_D_SIMO_Pos                                                                            28U
#define AON_C_KOUT2X_SIMO_IPTAT_OK_D_SIMO_Msk                                                                            (0x1UL << AON_C_KOUT2X_SIMO_IPTAT_OK_D_SIMO_Pos)

#define AON_C_KOUT2X_SIMO_IPTAT_OK_SIMO_Pos                                                                              29U
#define AON_C_KOUT2X_SIMO_IPTAT_OK_SIMO_Msk                                                                              (0x1UL << AON_C_KOUT2X_SIMO_IPTAT_OK_SIMO_Pos)

#define AON_C_KOUT2X_SIMO_EN_D_Pos                                                                                       30U
#define AON_C_KOUT2X_SIMO_EN_D_Msk                                                                                       (0x1UL << AON_C_KOUT2X_SIMO_EN_D_Pos)

#define AON_C_KOUT2X_SIMO_EN_Pos                                                                                         31U
#define AON_C_KOUT2X_SIMO_EN_Msk                                                                                         (0x1UL << AON_C_KOUT2X_SIMO_EN_Pos)

