rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x6D4    0x4000_06d4
    0       R/W     LDO_POW_BIAS_LDOANA                                         1'b0
    1       R/W     LDO_ENPC_LDOANA                                             1'b0
    2       R/W     LDO_POW_LDOANA                                              1'b0
    4:3     R/W     EN_LDO_VREF_SEL                                             2'b00
    5       R/W     EN_PC_USE_LARGE                                             1'b0
    6       R/W     LDO_POW_LDOANA_FB                                           1'b1
    7       R/W     LDO_R_HALF                                                  1'b1
    8       R/W     LDO_TOFS_LDOANA                                             1'b1
    13:9    R/W     LDO_TUNE_LDOANA                                             5'b10001
    14      R/W     LDO_ENB_DMYL_50U_LDOANA                                     1'b1
    15      R/W     LDO_ENB_DMYL_200U_LDOANA                                    1'b1
    18:16   R       POS_VDDANA_NO_USE_LSB                                       3'b000
    21:19   R       POS_VDDANA_VREF                                             3'b000
    23:22   R       POS_VDDANA_NO_USE_MSB                                       2'b00
    24      R       EN_LDO_R3S                                                  1'b1
    25      R/W     EN_LDO_R2S                                                  1'b1
    28:26   R/W     EN_LDO_ISET                                                 3'b100
    29      R/W     EN_BIG_R                                                    1'b1
    30      R/W     EN_FAST_TRNAS                                               1'b1
    31      R       DUMMY                                                       1'b0
 */
typedef union _AON_REG_LDO_ANA_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LDO_POW_BIAS_LDOANA: 1;
        uint32_t LDO_ENPC_LDOANA: 1;
        uint32_t LDO_POW_LDOANA: 1;
        uint32_t EN_LDO_VREF_SEL: 2;
        uint32_t EN_PC_USE_LARGE: 1;
        uint32_t LDO_POW_LDOANA_FB: 1;
        uint32_t LDO_R_HALF: 1;
        uint32_t LDO_TOFS_LDOANA: 1;
        uint32_t LDO_TUNE_LDOANA: 5;
        uint32_t LDO_ENB_DMYL_50U_LDOANA: 1;
        uint32_t LDO_ENB_DMYL_200U_LDOANA: 1;
        uint32_t POS_VDDANA_NO_USE_LSB: 3;
        uint32_t POS_VDDANA_VREF: 3;
        uint32_t POS_VDDANA_NO_USE_MSB: 2;
        uint32_t EN_LDO_R3S: 1;
        uint32_t EN_LDO_R2S: 1;
        uint32_t EN_LDO_ISET: 3;
        uint32_t EN_BIG_R: 1;
        uint32_t EN_FAST_TRNAS: 1;
        uint32_t DUMMY: 1;
    };
} AON_REG_LDO_ANA_REG0X_TYPE;

/*0x4000_06d4 AON_REG_LDO_ANA_REG0X*/
#define AON_REG_LDO_ANA_REG0X_LDO_POW_BIAS_LDOANA_Pos                                                                    0U
#define AON_REG_LDO_ANA_REG0X_LDO_POW_BIAS_LDOANA_Msk                                                                    (0x1UL << AON_REG_LDO_ANA_REG0X_LDO_POW_BIAS_LDOANA_Pos)

#define AON_REG_LDO_ANA_REG0X_LDO_ENPC_LDOANA_Pos                                                                        1U
#define AON_REG_LDO_ANA_REG0X_LDO_ENPC_LDOANA_Msk                                                                        (0x1UL << AON_REG_LDO_ANA_REG0X_LDO_ENPC_LDOANA_Pos)

#define AON_REG_LDO_ANA_REG0X_LDO_POW_LDOANA_Pos                                                                         2U
#define AON_REG_LDO_ANA_REG0X_LDO_POW_LDOANA_Msk                                                                         (0x1UL << AON_REG_LDO_ANA_REG0X_LDO_POW_LDOANA_Pos)

#define AON_REG_LDO_ANA_REG0X_EN_LDO_VREF_SEL_Pos                                                                        3U
#define AON_REG_LDO_ANA_REG0X_EN_LDO_VREF_SEL_Msk                                                                        (0x3UL << AON_REG_LDO_ANA_REG0X_EN_LDO_VREF_SEL_Pos)

#define AON_REG_LDO_ANA_REG0X_EN_PC_USE_LARGE_Pos                                                                        5U
#define AON_REG_LDO_ANA_REG0X_EN_PC_USE_LARGE_Msk                                                                        (0x1UL << AON_REG_LDO_ANA_REG0X_EN_PC_USE_LARGE_Pos)

#define AON_REG_LDO_ANA_REG0X_LDO_POW_LDOANA_FB_Pos                                                                      6U
#define AON_REG_LDO_ANA_REG0X_LDO_POW_LDOANA_FB_Msk                                                                      (0x1UL << AON_REG_LDO_ANA_REG0X_LDO_POW_LDOANA_FB_Pos)

#define AON_REG_LDO_ANA_REG0X_LDO_R_HALF_Pos                                                                             7U
#define AON_REG_LDO_ANA_REG0X_LDO_R_HALF_Msk                                                                             (0x1UL << AON_REG_LDO_ANA_REG0X_LDO_R_HALF_Pos)

#define AON_REG_LDO_ANA_REG0X_LDO_TOFS_LDOANA_Pos                                                                        8U
#define AON_REG_LDO_ANA_REG0X_LDO_TOFS_LDOANA_Msk                                                                        (0x1UL << AON_REG_LDO_ANA_REG0X_LDO_TOFS_LDOANA_Pos)

#define AON_REG_LDO_ANA_REG0X_LDO_TUNE_LDOANA_Pos                                                                        9U
#define AON_REG_LDO_ANA_REG0X_LDO_TUNE_LDOANA_Msk                                                                        (0x1FUL << AON_REG_LDO_ANA_REG0X_LDO_TUNE_LDOANA_Pos)

#define AON_REG_LDO_ANA_REG0X_LDO_ENB_DMYL_50U_LDOANA_Pos                                                                14U
#define AON_REG_LDO_ANA_REG0X_LDO_ENB_DMYL_50U_LDOANA_Msk                                                                (0x1UL << AON_REG_LDO_ANA_REG0X_LDO_ENB_DMYL_50U_LDOANA_Pos)

#define AON_REG_LDO_ANA_REG0X_LDO_ENB_DMYL_200U_LDOANA_Pos                                                               15U
#define AON_REG_LDO_ANA_REG0X_LDO_ENB_DMYL_200U_LDOANA_Msk                                                               (0x1UL << AON_REG_LDO_ANA_REG0X_LDO_ENB_DMYL_200U_LDOANA_Pos)

#define AON_REG_LDO_ANA_REG0X_POS_VDDANA_NO_USE_LSB_Pos                                                                  16U
#define AON_REG_LDO_ANA_REG0X_POS_VDDANA_NO_USE_LSB_Msk                                                                  (0x7UL << AON_REG_LDO_ANA_REG0X_POS_VDDANA_NO_USE_LSB_Pos)

#define AON_REG_LDO_ANA_REG0X_POS_VDDANA_VREF_Pos                                                                        19U
#define AON_REG_LDO_ANA_REG0X_POS_VDDANA_VREF_Msk                                                                        (0x7UL << AON_REG_LDO_ANA_REG0X_POS_VDDANA_VREF_Pos)

