rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_LDO_ANA_REG0X_POS_VDDANA_NO_USE_MSB_Pos                                                                  22U
#define AON_REG_LDO_ANA_REG0X_POS_VDDANA_NO_USE_MSB_Msk                                                                  (0x3UL << AON_REG_LDO_ANA_REG0X_POS_VDDANA_NO_USE_MSB_Pos)

#define AON_REG_LDO_ANA_REG0X_EN_LDO_R3S_Pos                                                                             24U
#define AON_REG_LDO_ANA_REG0X_EN_LDO_R3S_Msk                                                                             (0x1UL << AON_REG_LDO_ANA_REG0X_EN_LDO_R3S_Pos)

#define AON_REG_LDO_ANA_REG0X_EN_LDO_R2S_Pos                                                                             25U
#define AON_REG_LDO_ANA_REG0X_EN_LDO_R2S_Msk                                                                             (0x1UL << AON_REG_LDO_ANA_REG0X_EN_LDO_R2S_Pos)

#define AON_REG_LDO_ANA_REG0X_EN_LDO_ISET_Pos                                                                            26U
#define AON_REG_LDO_ANA_REG0X_EN_LDO_ISET_Msk                                                                            (0x7UL << AON_REG_LDO_ANA_REG0X_EN_LDO_ISET_Pos)

#define AON_REG_LDO_ANA_REG0X_EN_BIG_R_Pos                                                                               29U
#define AON_REG_LDO_ANA_REG0X_EN_BIG_R_Msk                                                                               (0x1UL << AON_REG_LDO_ANA_REG0X_EN_BIG_R_Pos)

#define AON_REG_LDO_ANA_REG0X_EN_FAST_TRNAS_Pos                                                                          30U
#define AON_REG_LDO_ANA_REG0X_EN_FAST_TRNAS_Msk                                                                          (0x1UL << AON_REG_LDO_ANA_REG0X_EN_FAST_TRNAS_Pos)

#define AON_REG_LDO_ANA_REG0X_DUMMY_Pos                                                                                  31U
#define AON_REG_LDO_ANA_REG0X_DUMMY_Msk                                                                                  (0x1UL << AON_REG_LDO_ANA_REG0X_DUMMY_Pos)

/* 0x6E4    0x4000_06e4
    0       R/W     LDO_POW_BIAS_LDOPA                                          1'b0
    1       R/W     LDO_ENPC_LDOPA                                              1'b0
    2       R/W     LDO_POW_LDOPA                                               1'b0
    4:3     R/W     DUMMY2                                                      2'b00
    5       R/W     EN_PC_USE_LARGE                                             1'b0
    6       R/W     LDO_POW_LDOPA_FB                                            1'b1
    7       R/W     LDO_R_HALF                                                  1'b1
    13:8    R/W     LDO_TUNE_LDOPA                                              6'b010000
    14      R/W     LDO_ENB_DMYL_50U_LDOPA                                      1'b1
    15      R/W     LDO_ENB_DMYL_200U_LDOPA                                     1'b1
    18:16   R       POS_VDDPA_NO_USE_LSB                                        3'b000
    21:19   R       POS_VDDPA_VREF                                              3'b000
    23:22   R       POS_VDDPA_NO_USE_MSB                                        2'b00
    31:24   R       DUMMY                                                       8'b00000000
 */
typedef union _AON_REG_LDO_PA_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LDO_POW_BIAS_LDOPA: 1;
        uint32_t LDO_ENPC_LDOPA: 1;
        uint32_t LDO_POW_LDOPA: 1;
        uint32_t DUMMY2: 2;
        uint32_t EN_PC_USE_LARGE: 1;
        uint32_t LDO_POW_LDOPA_FB: 1;
        uint32_t LDO_R_HALF: 1;
        uint32_t LDO_TUNE_LDOPA: 6;
        uint32_t LDO_ENB_DMYL_50U_LDOPA: 1;
        uint32_t LDO_ENB_DMYL_200U_LDOPA: 1;
        uint32_t POS_VDDPA_NO_USE_LSB: 3;
        uint32_t POS_VDDPA_VREF: 3;
        uint32_t POS_VDDPA_NO_USE_MSB: 2;
        uint32_t DUMMY: 8;
    };
} AON_REG_LDO_PA_REG0X_TYPE;

/*0x4000_06e4 AON_REG_LDO_PA_REG0X*/
#define AON_REG_LDO_PA_REG0X_LDO_POW_BIAS_LDOPA_Pos                                                                      0U
#define AON_REG_LDO_PA_REG0X_LDO_POW_BIAS_LDOPA_Msk                                                                      (0x1UL << AON_REG_LDO_PA_REG0X_LDO_POW_BIAS_LDOPA_Pos)

#define AON_REG_LDO_PA_REG0X_LDO_ENPC_LDOPA_Pos                                                                          1U
#define AON_REG_LDO_PA_REG0X_LDO_ENPC_LDOPA_Msk                                                                          (0x1UL << AON_REG_LDO_PA_REG0X_LDO_ENPC_LDOPA_Pos)

#define AON_REG_LDO_PA_REG0X_LDO_POW_LDOPA_Pos                                                                           2U
#define AON_REG_LDO_PA_REG0X_LDO_POW_LDOPA_Msk                                                                           (0x1UL << AON_REG_LDO_PA_REG0X_LDO_POW_LDOPA_Pos)

#define AON_REG_LDO_PA_REG0X_DUMMY2_Pos                                                                                  3U
#define AON_REG_LDO_PA_REG0X_DUMMY2_Msk                                                                                  (0x3UL << AON_REG_LDO_PA_REG0X_DUMMY2_Pos)

#define AON_REG_LDO_PA_REG0X_EN_PC_USE_LARGE_Pos                                                                         5U
#define AON_REG_LDO_PA_REG0X_EN_PC_USE_LARGE_Msk                                                                         (0x1UL << AON_REG_LDO_PA_REG0X_EN_PC_USE_LARGE_Pos)

#define AON_REG_LDO_PA_REG0X_LDO_POW_LDOPA_FB_Pos                                                                        6U
#define AON_REG_LDO_PA_REG0X_LDO_POW_LDOPA_FB_Msk                                                                        (0x1UL << AON_REG_LDO_PA_REG0X_LDO_POW_LDOPA_FB_Pos)

#define AON_REG_LDO_PA_REG0X_LDO_R_HALF_Pos                                                                              7U
#define AON_REG_LDO_PA_REG0X_LDO_R_HALF_Msk                                                                              (0x1UL << AON_REG_LDO_PA_REG0X_LDO_R_HALF_Pos)

