rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_LDO_PA_REG0X_LDO_TUNE_LDOPA_Pos                                                                          8U
#define AON_REG_LDO_PA_REG0X_LDO_TUNE_LDOPA_Msk                                                                          (0x3FUL << AON_REG_LDO_PA_REG0X_LDO_TUNE_LDOPA_Pos)

#define AON_REG_LDO_PA_REG0X_LDO_ENB_DMYL_50U_LDOPA_Pos                                                                  14U
#define AON_REG_LDO_PA_REG0X_LDO_ENB_DMYL_50U_LDOPA_Msk                                                                  (0x1UL << AON_REG_LDO_PA_REG0X_LDO_ENB_DMYL_50U_LDOPA_Pos)

#define AON_REG_LDO_PA_REG0X_LDO_ENB_DMYL_200U_LDOPA_Pos                                                                 15U
#define AON_REG_LDO_PA_REG0X_LDO_ENB_DMYL_200U_LDOPA_Msk                                                                 (0x1UL << AON_REG_LDO_PA_REG0X_LDO_ENB_DMYL_200U_LDOPA_Pos)

#define AON_REG_LDO_PA_REG0X_POS_VDDPA_NO_USE_LSB_Pos                                                                    16U
#define AON_REG_LDO_PA_REG0X_POS_VDDPA_NO_USE_LSB_Msk                                                                    (0x7UL << AON_REG_LDO_PA_REG0X_POS_VDDPA_NO_USE_LSB_Pos)

#define AON_REG_LDO_PA_REG0X_POS_VDDPA_VREF_Pos                                                                          19U
#define AON_REG_LDO_PA_REG0X_POS_VDDPA_VREF_Msk                                                                          (0x7UL << AON_REG_LDO_PA_REG0X_POS_VDDPA_VREF_Pos)

#define AON_REG_LDO_PA_REG0X_POS_VDDPA_NO_USE_MSB_Pos                                                                    22U
#define AON_REG_LDO_PA_REG0X_POS_VDDPA_NO_USE_MSB_Msk                                                                    (0x3UL << AON_REG_LDO_PA_REG0X_POS_VDDPA_NO_USE_MSB_Pos)

#define AON_REG_LDO_PA_REG0X_DUMMY_Pos                                                                                   24U
#define AON_REG_LDO_PA_REG0X_DUMMY_Msk                                                                                   (0xFFUL << AON_REG_LDO_PA_REG0X_DUMMY_Pos)

/* 0x6F4    0x4000_06f4
    0       R/W     PLL1_POW_PLL                                                1'b0
    1       R/W     PLL1_REF_FREF_EDGE                                          1'b1
    2       R/W     PLL1_POW_CPOP                                               1'b1
    4:3     R/W     PLL1_LPF_CP_SEL                                             2'b10
    6:5     R/W     PLL1_LPF_CS_SEL                                             2'b10
    9:7     R/W     PLL1_LPF_RS_SEL                                             3'b011
    10      R/W     REG0X_PLL1_DUMMY_LPF_C3_SEL                                 1'b0
    13:11   R/W     REG0X_PLL1_DUMMY_LPF_R3_SEL                                 3'b100
    15:14   R/W     PLL1_DAC_DN_SEL                                             2'b0
    18:16   R/W     PLL1_KVCO_TUNE                                              3'b100
    19      R/W     PLL1_CKO1_EN                                                1'b0
    21:20   R/W     PLL1_DN_SEL                                                 2'b00
    22      R/W     PLL1_WDG_ENB                                                1'b0
    24:23   R/W     PLL1_LPF_VCTHL                                              2'b00
    25      R/W     AGPIO_GPE                                                   1'b0
    26      R/W     AGPIO_GPO                                                   1'b0
    28:27   R/W     AGPIO_GPDRV                                                 2'b00
    29      R/W     REG1X_PLL1_DUMMY0                                           1'b0
    30      R/W     REG1X_PLL1_DUMMY1                                           1'b0
    31      R/W     REG1X_PLL1_DUMMY2                                           1'b0
 */
typedef union _AON_REG0X_PLL1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PLL1_POW_PLL: 1;
        uint32_t PLL1_REF_FREF_EDGE: 1;
        uint32_t PLL1_POW_CPOP: 1;
        uint32_t PLL1_LPF_CP_SEL: 2;
        uint32_t PLL1_LPF_CS_SEL: 2;
        uint32_t PLL1_LPF_RS_SEL: 3;
        uint32_t REG0X_PLL1_DUMMY_LPF_C3_SEL: 1;
        uint32_t REG0X_PLL1_DUMMY_LPF_R3_SEL: 3;
        uint32_t PLL1_DAC_DN_SEL: 2;
        uint32_t PLL1_KVCO_TUNE: 3;
        uint32_t PLL1_CKO1_EN: 1;
        uint32_t PLL1_DN_SEL: 2;
        uint32_t PLL1_WDG_ENB: 1;
        uint32_t PLL1_LPF_VCTHL: 2;
        uint32_t AGPIO_GPE: 1;
        uint32_t AGPIO_GPO: 1;
        uint32_t AGPIO_GPDRV: 2;
        uint32_t REG1X_PLL1_DUMMY0: 1;
        uint32_t REG1X_PLL1_DUMMY1: 1;
        uint32_t REG1X_PLL1_DUMMY2: 1;
    };
} AON_REG0X_PLL1_TYPE;

/*0x4000_06f4 AON_REG0X_PLL1*/
#define AON_REG0X_PLL1_PLL1_POW_PLL_Pos                                                                                  0U
#define AON_REG0X_PLL1_PLL1_POW_PLL_Msk                                                                                  (0x1UL << AON_REG0X_PLL1_PLL1_POW_PLL_Pos)

#define AON_REG0X_PLL1_PLL1_REF_FREF_EDGE_Pos                                                                            1U
#define AON_REG0X_PLL1_PLL1_REF_FREF_EDGE_Msk                                                                            (0x1UL << AON_REG0X_PLL1_PLL1_REF_FREF_EDGE_Pos)

#define AON_REG0X_PLL1_PLL1_POW_CPOP_Pos                                                                                 2U
#define AON_REG0X_PLL1_PLL1_POW_CPOP_Msk                                                                                 (0x1UL << AON_REG0X_PLL1_PLL1_POW_CPOP_Pos)

#define AON_REG0X_PLL1_PLL1_LPF_CP_SEL_Pos                                                                               3U
#define AON_REG0X_PLL1_PLL1_LPF_CP_SEL_Msk                                                                               (0x3UL << AON_REG0X_PLL1_PLL1_LPF_CP_SEL_Pos)

#define AON_REG0X_PLL1_PLL1_LPF_CS_SEL_Pos                                                                               5U
#define AON_REG0X_PLL1_PLL1_LPF_CS_SEL_Msk                                                                               (0x3UL << AON_REG0X_PLL1_PLL1_LPF_CS_SEL_Pos)

#define AON_REG0X_PLL1_PLL1_LPF_RS_SEL_Pos                                                                               7U
#define AON_REG0X_PLL1_PLL1_LPF_RS_SEL_Msk                                                                               (0x7UL << AON_REG0X_PLL1_PLL1_LPF_RS_SEL_Pos)

#define AON_REG0X_PLL1_REG0X_PLL1_DUMMY_LPF_C3_SEL_Pos                                                                   10U
#define AON_REG0X_PLL1_REG0X_PLL1_DUMMY_LPF_C3_SEL_Msk                                                                   (0x1UL << AON_REG0X_PLL1_REG0X_PLL1_DUMMY_LPF_C3_SEL_Pos)

#define AON_REG0X_PLL1_REG0X_PLL1_DUMMY_LPF_R3_SEL_Pos                                                                   11U
#define AON_REG0X_PLL1_REG0X_PLL1_DUMMY_LPF_R3_SEL_Msk                                                                   (0x7UL << AON_REG0X_PLL1_REG0X_PLL1_DUMMY_LPF_R3_SEL_Pos)

#define AON_REG0X_PLL1_PLL1_DAC_DN_SEL_Pos                                                                               14U
#define AON_REG0X_PLL1_PLL1_DAC_DN_SEL_Msk                                                                               (0x3UL << AON_REG0X_PLL1_PLL1_DAC_DN_SEL_Pos)

#define AON_REG0X_PLL1_PLL1_KVCO_TUNE_Pos                                                                                16U
#define AON_REG0X_PLL1_PLL1_KVCO_TUNE_Msk                                                                                (0x7UL << AON_REG0X_PLL1_PLL1_KVCO_TUNE_Pos)

#define AON_REG0X_PLL1_PLL1_CKO1_EN_Pos                                                                                  19U
#define AON_REG0X_PLL1_PLL1_CKO1_EN_Msk                                                                                  (0x1UL << AON_REG0X_PLL1_PLL1_CKO1_EN_Pos)

#define AON_REG0X_PLL1_PLL1_DN_SEL_Pos                                                                                   20U
#define AON_REG0X_PLL1_PLL1_DN_SEL_Msk                                                                                   (0x3UL << AON_REG0X_PLL1_PLL1_DN_SEL_Pos)

