rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG0X_PLL1_PLL1_WDG_ENB_Pos                                                                                  22U
#define AON_REG0X_PLL1_PLL1_WDG_ENB_Msk                                                                                  (0x1UL << AON_REG0X_PLL1_PLL1_WDG_ENB_Pos)

#define AON_REG0X_PLL1_PLL1_LPF_VCTHL_Pos                                                                                23U
#define AON_REG0X_PLL1_PLL1_LPF_VCTHL_Msk                                                                                (0x3UL << AON_REG0X_PLL1_PLL1_LPF_VCTHL_Pos)

#define AON_REG0X_PLL1_AGPIO_GPE_Pos                                                                                     25U
#define AON_REG0X_PLL1_AGPIO_GPE_Msk                                                                                     (0x1UL << AON_REG0X_PLL1_AGPIO_GPE_Pos)

#define AON_REG0X_PLL1_AGPIO_GPO_Pos                                                                                     26U
#define AON_REG0X_PLL1_AGPIO_GPO_Msk                                                                                     (0x1UL << AON_REG0X_PLL1_AGPIO_GPO_Pos)

#define AON_REG0X_PLL1_AGPIO_GPDRV_Pos                                                                                   27U
#define AON_REG0X_PLL1_AGPIO_GPDRV_Msk                                                                                   (0x3UL << AON_REG0X_PLL1_AGPIO_GPDRV_Pos)

#define AON_REG0X_PLL1_REG1X_PLL1_DUMMY0_Pos                                                                             29U
#define AON_REG0X_PLL1_REG1X_PLL1_DUMMY0_Msk                                                                             (0x1UL << AON_REG0X_PLL1_REG1X_PLL1_DUMMY0_Pos)

#define AON_REG0X_PLL1_REG1X_PLL1_DUMMY1_Pos                                                                             30U
#define AON_REG0X_PLL1_REG1X_PLL1_DUMMY1_Msk                                                                             (0x1UL << AON_REG0X_PLL1_REG1X_PLL1_DUMMY1_Pos)

#define AON_REG0X_PLL1_REG1X_PLL1_DUMMY2_Pos                                                                             31U
#define AON_REG0X_PLL1_REG1X_PLL1_DUMMY2_Msk                                                                             (0x1UL << AON_REG0X_PLL1_REG1X_PLL1_DUMMY2_Pos)

/* 0x6F8    0x4000_06f8
    3:0     R/W     REG2X_PLL1_DUMMY0                                           4'b0
    4       R/W     PLL1_CK_BTADC_EN                                            1'b1
    5       R/W     REG2X_PLL1_DUMMY1                                           1'b0
    6       R/W     PLL1_CK_BTDAC_EN                                            1'b0
    7       R/W     REG2X_PLL1_DUMMY2                                           1'b0
    8       R/W     PLL1_BT_CKI_PLL_DAC_ANA_EN                                  1'b0
    9       R/W     PLL1_BT_CKI_PLL_ADC_ANA_EN                                  1'b1
    11:10   R/W     CKO_DBG_FREQ_SEL                                            2'b0
    12      R/W     PLL1_TESTMODE_EN                                            1'b0
    14:13   R/W     PLL1_TESTMODE_CKO_SEL                                       2'b00
    15      R/W     PLL1_CK_BTADC_AND_CK_BTDAC_EN                               1'b1
    31:16   R       RSVD                                                        16'b0
 */
typedef union _AON_REG2X_PLL1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG2X_PLL1_DUMMY0: 4;
        uint32_t PLL1_CK_BTADC_EN: 1;
        uint32_t REG2X_PLL1_DUMMY1: 1;
        uint32_t PLL1_CK_BTDAC_EN: 1;
        uint32_t REG2X_PLL1_DUMMY2: 1;
        uint32_t PLL1_BT_CKI_PLL_DAC_ANA_EN: 1;
        uint32_t PLL1_BT_CKI_PLL_ADC_ANA_EN: 1;
        uint32_t CKO_DBG_FREQ_SEL: 2;
        uint32_t PLL1_TESTMODE_EN: 1;
        uint32_t PLL1_TESTMODE_CKO_SEL: 2;
        uint32_t PLL1_CK_BTADC_AND_CK_BTDAC_EN: 1;
        uint32_t RSVD: 16;
    };
} AON_REG2X_PLL1_TYPE;

/*0x4000_06f8 AON_REG2X_PLL1*/
#define AON_REG2X_PLL1_REG2X_PLL1_DUMMY0_Pos                                                                             0U
#define AON_REG2X_PLL1_REG2X_PLL1_DUMMY0_Msk                                                                             (0xFUL << AON_REG2X_PLL1_REG2X_PLL1_DUMMY0_Pos)

#define AON_REG2X_PLL1_PLL1_CK_BTADC_EN_Pos                                                                              4U
#define AON_REG2X_PLL1_PLL1_CK_BTADC_EN_Msk                                                                              (0x1UL << AON_REG2X_PLL1_PLL1_CK_BTADC_EN_Pos)

#define AON_REG2X_PLL1_REG2X_PLL1_DUMMY1_Pos                                                                             5U
#define AON_REG2X_PLL1_REG2X_PLL1_DUMMY1_Msk                                                                             (0x1UL << AON_REG2X_PLL1_REG2X_PLL1_DUMMY1_Pos)

#define AON_REG2X_PLL1_PLL1_CK_BTDAC_EN_Pos                                                                              6U
#define AON_REG2X_PLL1_PLL1_CK_BTDAC_EN_Msk                                                                              (0x1UL << AON_REG2X_PLL1_PLL1_CK_BTDAC_EN_Pos)

#define AON_REG2X_PLL1_REG2X_PLL1_DUMMY2_Pos                                                                             7U
#define AON_REG2X_PLL1_REG2X_PLL1_DUMMY2_Msk                                                                             (0x1UL << AON_REG2X_PLL1_REG2X_PLL1_DUMMY2_Pos)

#define AON_REG2X_PLL1_PLL1_BT_CKI_PLL_DAC_ANA_EN_Pos                                                                    8U
#define AON_REG2X_PLL1_PLL1_BT_CKI_PLL_DAC_ANA_EN_Msk                                                                    (0x1UL << AON_REG2X_PLL1_PLL1_BT_CKI_PLL_DAC_ANA_EN_Pos)

#define AON_REG2X_PLL1_PLL1_BT_CKI_PLL_ADC_ANA_EN_Pos                                                                    9U
#define AON_REG2X_PLL1_PLL1_BT_CKI_PLL_ADC_ANA_EN_Msk                                                                    (0x1UL << AON_REG2X_PLL1_PLL1_BT_CKI_PLL_ADC_ANA_EN_Pos)

#define AON_REG2X_PLL1_CKO_DBG_FREQ_SEL_Pos                                                                              10U
#define AON_REG2X_PLL1_CKO_DBG_FREQ_SEL_Msk                                                                              (0x3UL << AON_REG2X_PLL1_CKO_DBG_FREQ_SEL_Pos)

#define AON_REG2X_PLL1_PLL1_TESTMODE_EN_Pos                                                                              12U
#define AON_REG2X_PLL1_PLL1_TESTMODE_EN_Msk                                                                              (0x1UL << AON_REG2X_PLL1_PLL1_TESTMODE_EN_Pos)

#define AON_REG2X_PLL1_PLL1_TESTMODE_CKO_SEL_Pos                                                                         13U
#define AON_REG2X_PLL1_PLL1_TESTMODE_CKO_SEL_Msk                                                                         (0x3UL << AON_REG2X_PLL1_PLL1_TESTMODE_CKO_SEL_Pos)

#define AON_REG2X_PLL1_PLL1_CK_BTADC_AND_CK_BTDAC_EN_Pos                                                                 15U
#define AON_REG2X_PLL1_PLL1_CK_BTADC_AND_CK_BTDAC_EN_Msk                                                                 (0x1UL << AON_REG2X_PLL1_PLL1_CK_BTADC_AND_CK_BTDAC_EN_Pos)

