rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG2X_PLL1_RSVD_Pos                                                                                          16U
#define AON_REG2X_PLL1_RSVD_Msk                                                                                          (0xFFFFUL << AON_REG2X_PLL1_RSVD_Pos)

/* 0x6FC    0x4000_06fc
    0       R       PLL1_READY                                                  1'b0
    15:1    R       RSVD_1                                                      15'b0
    31:16   R       RSVD                                                        16'b0
 */
typedef union _AON_C_KOUT0X_PLL1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PLL1_READY: 1;
        uint32_t RSVD_1: 15;
        uint32_t RSVD: 16;
    };
} AON_C_KOUT0X_PLL1_TYPE;

/*0x4000_06fc AON_C_KOUT0X_PLL1*/
#define AON_C_KOUT0X_PLL1_PLL1_READY_Pos                                                                                 0U
#define AON_C_KOUT0X_PLL1_PLL1_READY_Msk                                                                                 (0x1UL << AON_C_KOUT0X_PLL1_PLL1_READY_Pos)

#define AON_C_KOUT0X_PLL1_RSVD_1_Pos                                                                                     1U
#define AON_C_KOUT0X_PLL1_RSVD_1_Msk                                                                                     (0x7FFFUL << AON_C_KOUT0X_PLL1_RSVD_1_Pos)

#define AON_C_KOUT0X_PLL1_RSVD_Pos                                                                                       16U
#define AON_C_KOUT0X_PLL1_RSVD_Msk                                                                                       (0xFFFFUL << AON_C_KOUT0X_PLL1_RSVD_Pos)

/* 0x708    0x4000_0708
    0       R/W     PLL1_LDO_DIG_SW_LDO2PWRCUT                                  1'b0
    1       R/W     PLL1_LDO_DIG_POW_LDO                                        1'b0
    2       R/W     PLL1_LDO_DIG_LDO_VPULSE                                     1'b0
    6:3     R/W     PLL1_LDO_DIG_LDO_SW                                         4'b0110
    7       R/W     PLL1_LDO_DIG_DOUBLE_OP_I                                    1'b0
    8       R/W     PLL1_LDO_DIG_IB_EN                                          1'b0
    9       R/W     PLL1_LDO_ANA_SW_LDO2PWRCUT                                  1'b0
    10      R/W     PLL1_LDO_ANA_POW_LDO                                        1'b0
    11      R/W     PLL1_LDO_ANA_LDO_VPULSE                                     1'b0
    15:12   R/W     PLL1_LDO_ANA_LDO_SW                                         4'b0110
    16      R/W     PLL1_LDO_ANA_DOUBLE_OP_I                                    1'b0
    17      R/W     PLL1_LDO_ANA_IB_EN                                          1'b0
    31:18   R       RSVD                                                        14'b00000000000000
 */
typedef union _AON_REG0X_PLL1_LDO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PLL1_LDO_DIG_SW_LDO2PWRCUT: 1;
        uint32_t PLL1_LDO_DIG_POW_LDO: 1;
        uint32_t PLL1_LDO_DIG_LDO_VPULSE: 1;
        uint32_t PLL1_LDO_DIG_LDO_SW: 4;
        uint32_t PLL1_LDO_DIG_DOUBLE_OP_I: 1;
        uint32_t PLL1_LDO_DIG_IB_EN: 1;
        uint32_t PLL1_LDO_ANA_SW_LDO2PWRCUT: 1;
        uint32_t PLL1_LDO_ANA_POW_LDO: 1;
        uint32_t PLL1_LDO_ANA_LDO_VPULSE: 1;
        uint32_t PLL1_LDO_ANA_LDO_SW: 4;
        uint32_t PLL1_LDO_ANA_DOUBLE_OP_I: 1;
        uint32_t PLL1_LDO_ANA_IB_EN: 1;
        uint32_t RSVD: 14;
    };
} AON_REG0X_PLL1_LDO_TYPE;

/*0x4000_0708 AON_REG0X_PLL1_LDO*/
#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_SW_LDO2PWRCUT_Pos                                                                0U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_SW_LDO2PWRCUT_Msk                                                                (0x1UL << AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_SW_LDO2PWRCUT_Pos)

#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_POW_LDO_Pos                                                                      1U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_POW_LDO_Msk                                                                      (0x1UL << AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_POW_LDO_Pos)

#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_LDO_VPULSE_Pos                                                                   2U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_LDO_VPULSE_Msk                                                                   (0x1UL << AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_LDO_VPULSE_Pos)

#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_LDO_SW_Pos                                                                       3U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_LDO_SW_Msk                                                                       (0xFUL << AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_LDO_SW_Pos)

#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_DOUBLE_OP_I_Pos                                                                  7U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_DOUBLE_OP_I_Msk                                                                  (0x1UL << AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_DOUBLE_OP_I_Pos)

#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_IB_EN_Pos                                                                        8U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_IB_EN_Msk                                                                        (0x1UL << AON_REG0X_PLL1_LDO_PLL1_LDO_DIG_IB_EN_Pos)

#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_SW_LDO2PWRCUT_Pos                                                                9U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_SW_LDO2PWRCUT_Msk                                                                (0x1UL << AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_SW_LDO2PWRCUT_Pos)

#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_POW_LDO_Pos                                                                      10U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_POW_LDO_Msk                                                                      (0x1UL << AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_POW_LDO_Pos)

#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_LDO_VPULSE_Pos                                                                   11U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_LDO_VPULSE_Msk                                                                   (0x1UL << AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_LDO_VPULSE_Pos)

#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_LDO_SW_Pos                                                                       12U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_LDO_SW_Msk                                                                       (0xFUL << AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_LDO_SW_Pos)

#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_DOUBLE_OP_I_Pos                                                                  16U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_DOUBLE_OP_I_Msk                                                                  (0x1UL << AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_DOUBLE_OP_I_Pos)

#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_IB_EN_Pos                                                                        17U
#define AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_IB_EN_Msk                                                                        (0x1UL << AON_REG0X_PLL1_LDO_PLL1_LDO_ANA_IB_EN_Pos)

#define AON_REG0X_PLL1_LDO_RSVD_Pos                                                                                      18U
#define AON_REG0X_PLL1_LDO_RSVD_Msk                                                                                      (0x3FFFUL << AON_REG0X_PLL1_LDO_RSVD_Pos)

