rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x728    0x4000_0728
    9:0     R/W     TMETER_LATCH_0                                              10'h0
    19:10   R/W     TMETER_LATCH_1                                              10'h0
    20      R/W     TMETER_LATCH_VLD                                            1'h0
    21      R       RESERVED                                                    1'h0
    31:22   R/W     TMETER_LATCH                                                10'h200
 */
typedef union _AON_REG_TMETER_DATA_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TMETER_LATCH_0: 10;
        uint32_t TMETER_LATCH_1: 10;
        uint32_t TMETER_LATCH_VLD: 1;
        uint32_t RESERVED: 1;
        uint32_t TMETER_LATCH: 10;
    };
} AON_REG_TMETER_DATA_0_TYPE;

/*0x4000_0728 AON_REG_TMETER_DATA_0*/
#define AON_REG_TMETER_DATA_0_TMETER_LATCH_0_Pos                                                                         0U
#define AON_REG_TMETER_DATA_0_TMETER_LATCH_0_Msk                                                                         (0x3FFUL << AON_REG_TMETER_DATA_0_TMETER_LATCH_0_Pos)

#define AON_REG_TMETER_DATA_0_TMETER_LATCH_1_Pos                                                                         10U
#define AON_REG_TMETER_DATA_0_TMETER_LATCH_1_Msk                                                                         (0x3FFUL << AON_REG_TMETER_DATA_0_TMETER_LATCH_1_Pos)

#define AON_REG_TMETER_DATA_0_TMETER_LATCH_VLD_Pos                                                                       20U
#define AON_REG_TMETER_DATA_0_TMETER_LATCH_VLD_Msk                                                                       (0x1UL << AON_REG_TMETER_DATA_0_TMETER_LATCH_VLD_Pos)

#define AON_REG_TMETER_DATA_0_RESERVED_Pos                                                                               21U
#define AON_REG_TMETER_DATA_0_RESERVED_Msk                                                                               (0x1UL << AON_REG_TMETER_DATA_0_RESERVED_Pos)

#define AON_REG_TMETER_DATA_0_TMETER_LATCH_Pos                                                                           22U
#define AON_REG_TMETER_DATA_0_TMETER_LATCH_Msk                                                                           (0x3FFUL << AON_REG_TMETER_DATA_0_TMETER_LATCH_Pos)

/* 0x72C    0x4000_072c
    9:0     R/W     TMETER_LATCH_RAW                                            10'h0
    19:10   R/W     TMETER_PREV_LATCH_REL0                                      10'h0
    29:20   R/W     TMETER_PREV_LATCH_REL1                                      10'h0
    31:30   R       RESERVED                                                    2'h0
 */
typedef union _AON_REG_TMETER_DATA_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TMETER_LATCH_RAW: 10;
        uint32_t TMETER_PREV_LATCH_REL0: 10;
        uint32_t TMETER_PREV_LATCH_REL1: 10;
        uint32_t RESERVED: 2;
    };
} AON_REG_TMETER_DATA_1_TYPE;

/*0x4000_072c AON_REG_TMETER_DATA_1*/
#define AON_REG_TMETER_DATA_1_TMETER_LATCH_RAW_Pos                                                                       0U
#define AON_REG_TMETER_DATA_1_TMETER_LATCH_RAW_Msk                                                                       (0x3FFUL << AON_REG_TMETER_DATA_1_TMETER_LATCH_RAW_Pos)

#define AON_REG_TMETER_DATA_1_TMETER_PREV_LATCH_REL0_Pos                                                                 10U
#define AON_REG_TMETER_DATA_1_TMETER_PREV_LATCH_REL0_Msk                                                                 (0x3FFUL << AON_REG_TMETER_DATA_1_TMETER_PREV_LATCH_REL0_Pos)

#define AON_REG_TMETER_DATA_1_TMETER_PREV_LATCH_REL1_Pos                                                                 20U
#define AON_REG_TMETER_DATA_1_TMETER_PREV_LATCH_REL1_Msk                                                                 (0x3FFUL << AON_REG_TMETER_DATA_1_TMETER_PREV_LATCH_REL1_Pos)

#define AON_REG_TMETER_DATA_1_RESERVED_Pos                                                                               30U
#define AON_REG_TMETER_DATA_1_RESERVED_Msk                                                                               (0x3UL << AON_REG_TMETER_DATA_1_RESERVED_Pos)

/* 0x730    0x4000_0730
    9:0     R/W     TMETER_PREV_LATCH_REL2                                      10'h0
    19:10   R/W     TMETER_PREV_LATCH_REL3                                      10'h0
    29:20   R/W     TMETER_PREV_LATCH_REL_FW                                    10'h0
    31:30   R       RESERVED                                                    2'h0
 */
typedef union _AON_REG_TMETER_DATA_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TMETER_PREV_LATCH_REL2: 10;
        uint32_t TMETER_PREV_LATCH_REL3: 10;
        uint32_t TMETER_PREV_LATCH_REL_FW: 10;
        uint32_t RESERVED: 2;
    };
} AON_REG_TMETER_DATA_2_TYPE;

/*0x4000_0730 AON_REG_TMETER_DATA_2*/
#define AON_REG_TMETER_DATA_2_TMETER_PREV_LATCH_REL2_Pos                                                                 0U
#define AON_REG_TMETER_DATA_2_TMETER_PREV_LATCH_REL2_Msk                                                                 (0x3FFUL << AON_REG_TMETER_DATA_2_TMETER_PREV_LATCH_REL2_Pos)

#define AON_REG_TMETER_DATA_2_TMETER_PREV_LATCH_REL3_Pos                                                                 10U
#define AON_REG_TMETER_DATA_2_TMETER_PREV_LATCH_REL3_Msk                                                                 (0x3FFUL << AON_REG_TMETER_DATA_2_TMETER_PREV_LATCH_REL3_Pos)

#define AON_REG_TMETER_DATA_2_TMETER_PREV_LATCH_REL_FW_Pos                                                               20U
#define AON_REG_TMETER_DATA_2_TMETER_PREV_LATCH_REL_FW_Msk                                                               (0x3FFUL << AON_REG_TMETER_DATA_2_TMETER_PREV_LATCH_REL_FW_Pos)

#define AON_REG_TMETER_DATA_2_RESERVED_Pos                                                                               30U
#define AON_REG_TMETER_DATA_2_RESERVED_Msk                                                                               (0x3UL << AON_REG_TMETER_DATA_2_RESERVED_Pos)

/* 0x738    0x4000_0738
    0       R/WAC   FW_TASK_START_ONE_SHOT                                      1'h0
    4:1     R/W     TMETER_CTRL1_DUMMY_1                                        4'h0
    9:5     R       TC_STATE                                                    5'h0
    10      R/W     EN_REL_COMP0                                                1'h0
    11      R/W     EN_REL_COMP1                                                1'h0
    12      R/W     EN_REL_COMP2                                                1'h0
    13      R/W     EN_REL_COMP3                                                1'h0
    14      R/W     EN_REL_COMP_FW                                              1'h0
    15      R/W     EN_FW_REL_COMP_INT                                          1'h0
    19:16   R       RESERVED                                                    4'h0
    20      R       VLD_TMETER                                                  1'h0
    21      R       TC_BUSY                                                     1'h0
    22      R/W     CLK_TMETER_QACTIVE_MAN_DATA                                 1'h0
    23      R/W     CLK_TMETER_QACTIVE_MAN_ENABLE                               1'h0
    31:24   R/W     TMETER_CTRL1_DUMMY                                          8'h0
 */
typedef union _AON_REG_TMETER_CTRL1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t FW_TASK_START_ONE_SHOT: 1;
        uint32_t TMETER_CTRL1_DUMMY_1: 4;
        uint32_t TC_STATE: 5;
        uint32_t EN_REL_COMP0: 1;
        uint32_t EN_REL_COMP1: 1;
        uint32_t EN_REL_COMP2: 1;
        uint32_t EN_REL_COMP3: 1;
        uint32_t EN_REL_COMP_FW: 1;
        uint32_t EN_FW_REL_COMP_INT: 1;
        uint32_t RESERVED: 4;
        uint32_t VLD_TMETER: 1;
        uint32_t TC_BUSY: 1;
        uint32_t CLK_TMETER_QACTIVE_MAN_DATA: 1;
        uint32_t CLK_TMETER_QACTIVE_MAN_ENABLE: 1;
        uint32_t TMETER_CTRL1_DUMMY: 8;
    };
} AON_REG_TMETER_CTRL1_TYPE;

/*0x4000_0738 AON_REG_TMETER_CTRL1*/
#define AON_REG_TMETER_CTRL1_FW_TASK_START_ONE_SHOT_Pos                                                                  0U
#define AON_REG_TMETER_CTRL1_FW_TASK_START_ONE_SHOT_Msk                                                                  (0x1UL << AON_REG_TMETER_CTRL1_FW_TASK_START_ONE_SHOT_Pos)

#define AON_REG_TMETER_CTRL1_TMETER_CTRL1_DUMMY_1_Pos                                                                    1U
#define AON_REG_TMETER_CTRL1_TMETER_CTRL1_DUMMY_1_Msk                                                                    (0xFUL << AON_REG_TMETER_CTRL1_TMETER_CTRL1_DUMMY_1_Pos)

#define AON_REG_TMETER_CTRL1_TC_STATE_Pos                                                                                5U
#define AON_REG_TMETER_CTRL1_TC_STATE_Msk                                                                                (0x1FUL << AON_REG_TMETER_CTRL1_TC_STATE_Pos)

