rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_TMETER_CTRL1_EN_REL_COMP0_Pos                                                                            10U
#define AON_REG_TMETER_CTRL1_EN_REL_COMP0_Msk                                                                            (0x1UL << AON_REG_TMETER_CTRL1_EN_REL_COMP0_Pos)

#define AON_REG_TMETER_CTRL1_EN_REL_COMP1_Pos                                                                            11U
#define AON_REG_TMETER_CTRL1_EN_REL_COMP1_Msk                                                                            (0x1UL << AON_REG_TMETER_CTRL1_EN_REL_COMP1_Pos)

#define AON_REG_TMETER_CTRL1_EN_REL_COMP2_Pos                                                                            12U
#define AON_REG_TMETER_CTRL1_EN_REL_COMP2_Msk                                                                            (0x1UL << AON_REG_TMETER_CTRL1_EN_REL_COMP2_Pos)

#define AON_REG_TMETER_CTRL1_EN_REL_COMP3_Pos                                                                            13U
#define AON_REG_TMETER_CTRL1_EN_REL_COMP3_Msk                                                                            (0x1UL << AON_REG_TMETER_CTRL1_EN_REL_COMP3_Pos)

#define AON_REG_TMETER_CTRL1_EN_REL_COMP_FW_Pos                                                                          14U
#define AON_REG_TMETER_CTRL1_EN_REL_COMP_FW_Msk                                                                          (0x1UL << AON_REG_TMETER_CTRL1_EN_REL_COMP_FW_Pos)

#define AON_REG_TMETER_CTRL1_EN_FW_REL_COMP_INT_Pos                                                                      15U
#define AON_REG_TMETER_CTRL1_EN_FW_REL_COMP_INT_Msk                                                                      (0x1UL << AON_REG_TMETER_CTRL1_EN_FW_REL_COMP_INT_Pos)

#define AON_REG_TMETER_CTRL1_RESERVED_Pos                                                                                16U
#define AON_REG_TMETER_CTRL1_RESERVED_Msk                                                                                (0xFUL << AON_REG_TMETER_CTRL1_RESERVED_Pos)

#define AON_REG_TMETER_CTRL1_VLD_TMETER_Pos                                                                              20U
#define AON_REG_TMETER_CTRL1_VLD_TMETER_Msk                                                                              (0x1UL << AON_REG_TMETER_CTRL1_VLD_TMETER_Pos)

#define AON_REG_TMETER_CTRL1_TC_BUSY_Pos                                                                                 21U
#define AON_REG_TMETER_CTRL1_TC_BUSY_Msk                                                                                 (0x1UL << AON_REG_TMETER_CTRL1_TC_BUSY_Pos)

#define AON_REG_TMETER_CTRL1_CLK_TMETER_QACTIVE_MAN_DATA_Pos                                                             22U
#define AON_REG_TMETER_CTRL1_CLK_TMETER_QACTIVE_MAN_DATA_Msk                                                             (0x1UL << AON_REG_TMETER_CTRL1_CLK_TMETER_QACTIVE_MAN_DATA_Pos)

#define AON_REG_TMETER_CTRL1_CLK_TMETER_QACTIVE_MAN_ENABLE_Pos                                                           23U
#define AON_REG_TMETER_CTRL1_CLK_TMETER_QACTIVE_MAN_ENABLE_Msk                                                           (0x1UL << AON_REG_TMETER_CTRL1_CLK_TMETER_QACTIVE_MAN_ENABLE_Pos)

#define AON_REG_TMETER_CTRL1_TMETER_CTRL1_DUMMY_Pos                                                                      24U
#define AON_REG_TMETER_CTRL1_TMETER_CTRL1_DUMMY_Msk                                                                      (0xFFUL << AON_REG_TMETER_CTRL1_TMETER_CTRL1_DUMMY_Pos)

/* 0x73C    0x4000_073c
    0       R/W1C   ST_REL_COMP0                                                1'h0
    1       R/W1C   ST_REL_COMP1                                                1'h0
    2       R/W1C   ST_REL_COMP2                                                1'h0
    3       R/W1C   ST_REL_COMP3                                                1'h0
    4       R       ST_ABS_COMP0                                                1'h0
    5       R       ST_ABS_COMP1                                                1'h0
    6       R       ST_ABS_COMP2                                                1'h0
    7       R       ST_ABS_COMP3                                                1'h0
    8       R/W     TMETER_COMP_CTRL_DUMMY_1                                    1'h0
    9       R/W1C   ST_FW_REL_COMP_INT                                          1'h0
    10      R/W1C   ST_FW_REL_COMP                                              1'h0
    11      R/W     TMETER_PREV_LATCH_REL0_VLD                                  1'h0
    12      R/W     TMETER_PREV_LATCH_REL1_VLD                                  1'h0
    13      R/W     TMETER_PREV_LATCH_REL2_VLD                                  1'h0
    14      R/W     TMETER_PREV_LATCH_REL3_VLD                                  1'h0
    15      R/W     TMETER_PREV_LATCH_FW_VLD                                    1'h0
    31:16   R/W     TMETER_COMP_CTRL_DUMMY                                      16'h0
 */
typedef union _AON_REG_TMETER_COMP_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ST_REL_COMP0: 1;
        uint32_t ST_REL_COMP1: 1;
        uint32_t ST_REL_COMP2: 1;
        uint32_t ST_REL_COMP3: 1;
        uint32_t ST_ABS_COMP0: 1;
        uint32_t ST_ABS_COMP1: 1;
        uint32_t ST_ABS_COMP2: 1;
        uint32_t ST_ABS_COMP3: 1;
        uint32_t TMETER_COMP_CTRL_DUMMY_1: 1;
        uint32_t ST_FW_REL_COMP_INT: 1;
        uint32_t ST_FW_REL_COMP: 1;
        uint32_t TMETER_PREV_LATCH_REL0_VLD: 1;
        uint32_t TMETER_PREV_LATCH_REL1_VLD: 1;
        uint32_t TMETER_PREV_LATCH_REL2_VLD: 1;
        uint32_t TMETER_PREV_LATCH_REL3_VLD: 1;
        uint32_t TMETER_PREV_LATCH_FW_VLD: 1;
        uint32_t TMETER_COMP_CTRL_DUMMY: 16;
    };
} AON_REG_TMETER_COMP_CTRL_TYPE;

/*0x4000_073c AON_REG_TMETER_COMP_CTRL*/
#define AON_REG_TMETER_COMP_CTRL_ST_REL_COMP0_Pos                                                                        0U
#define AON_REG_TMETER_COMP_CTRL_ST_REL_COMP0_Msk                                                                        (0x1UL << AON_REG_TMETER_COMP_CTRL_ST_REL_COMP0_Pos)

#define AON_REG_TMETER_COMP_CTRL_ST_REL_COMP1_Pos                                                                        1U
#define AON_REG_TMETER_COMP_CTRL_ST_REL_COMP1_Msk                                                                        (0x1UL << AON_REG_TMETER_COMP_CTRL_ST_REL_COMP1_Pos)

#define AON_REG_TMETER_COMP_CTRL_ST_REL_COMP2_Pos                                                                        2U
#define AON_REG_TMETER_COMP_CTRL_ST_REL_COMP2_Msk                                                                        (0x1UL << AON_REG_TMETER_COMP_CTRL_ST_REL_COMP2_Pos)

#define AON_REG_TMETER_COMP_CTRL_ST_REL_COMP3_Pos                                                                        3U
#define AON_REG_TMETER_COMP_CTRL_ST_REL_COMP3_Msk                                                                        (0x1UL << AON_REG_TMETER_COMP_CTRL_ST_REL_COMP3_Pos)

#define AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP0_Pos                                                                        4U
#define AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP0_Msk                                                                        (0x1UL << AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP0_Pos)

#define AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP1_Pos                                                                        5U
#define AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP1_Msk                                                                        (0x1UL << AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP1_Pos)

#define AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP2_Pos                                                                        6U
#define AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP2_Msk                                                                        (0x1UL << AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP2_Pos)

#define AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP3_Pos                                                                        7U
#define AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP3_Msk                                                                        (0x1UL << AON_REG_TMETER_COMP_CTRL_ST_ABS_COMP3_Pos)

#define AON_REG_TMETER_COMP_CTRL_TMETER_COMP_CTRL_DUMMY_1_Pos                                                            8U
#define AON_REG_TMETER_COMP_CTRL_TMETER_COMP_CTRL_DUMMY_1_Msk                                                            (0x1UL << AON_REG_TMETER_COMP_CTRL_TMETER_COMP_CTRL_DUMMY_1_Pos)

#define AON_REG_TMETER_COMP_CTRL_ST_FW_REL_COMP_INT_Pos                                                                  9U
#define AON_REG_TMETER_COMP_CTRL_ST_FW_REL_COMP_INT_Msk                                                                  (0x1UL << AON_REG_TMETER_COMP_CTRL_ST_FW_REL_COMP_INT_Pos)

#define AON_REG_TMETER_COMP_CTRL_ST_FW_REL_COMP_Pos                                                                      10U
#define AON_REG_TMETER_COMP_CTRL_ST_FW_REL_COMP_Msk                                                                      (0x1UL << AON_REG_TMETER_COMP_CTRL_ST_FW_REL_COMP_Pos)

#define AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL0_VLD_Pos                                                          11U
#define AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL0_VLD_Msk                                                          (0x1UL << AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL0_VLD_Pos)

#define AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL1_VLD_Pos                                                          12U
#define AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL1_VLD_Msk                                                          (0x1UL << AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL1_VLD_Pos)

#define AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL2_VLD_Pos                                                          13U
#define AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL2_VLD_Msk                                                          (0x1UL << AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL2_VLD_Pos)

#define AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL3_VLD_Pos                                                          14U
#define AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL3_VLD_Msk                                                          (0x1UL << AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_REL3_VLD_Pos)

#define AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_FW_VLD_Pos                                                            15U
#define AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_FW_VLD_Msk                                                            (0x1UL << AON_REG_TMETER_COMP_CTRL_TMETER_PREV_LATCH_FW_VLD_Pos)

