rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_TMETER_COMP_CTRL_TMETER_COMP_CTRL_DUMMY_Pos                                                              16U
#define AON_REG_TMETER_COMP_CTRL_TMETER_COMP_CTRL_DUMMY_Msk                                                              (0xFFFFUL << AON_REG_TMETER_COMP_CTRL_TMETER_COMP_CTRL_DUMMY_Pos)

/* 0x740    0x4000_0740
    9:0     R/W     REL_COMP0_THD                                               10'h0
    19:10   R/W     REL_COMP1_THD                                               10'h0
    31:20   R/W     TMETER_REL_COMP_THD0_DUMMY                                  12'h0
 */
typedef union _AON_REG_TMETER_REL_COMP_THD0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REL_COMP0_THD: 10;
        uint32_t REL_COMP1_THD: 10;
        uint32_t TMETER_REL_COMP_THD0_DUMMY: 12;
    };
} AON_REG_TMETER_REL_COMP_THD0_TYPE;

/*0x4000_0740 AON_REG_TMETER_REL_COMP_THD0*/
#define AON_REG_TMETER_REL_COMP_THD0_REL_COMP0_THD_Pos                                                                   0U
#define AON_REG_TMETER_REL_COMP_THD0_REL_COMP0_THD_Msk                                                                   (0x3FFUL << AON_REG_TMETER_REL_COMP_THD0_REL_COMP0_THD_Pos)

#define AON_REG_TMETER_REL_COMP_THD0_REL_COMP1_THD_Pos                                                                   10U
#define AON_REG_TMETER_REL_COMP_THD0_REL_COMP1_THD_Msk                                                                   (0x3FFUL << AON_REG_TMETER_REL_COMP_THD0_REL_COMP1_THD_Pos)

#define AON_REG_TMETER_REL_COMP_THD0_TMETER_REL_COMP_THD0_DUMMY_Pos                                                      20U
#define AON_REG_TMETER_REL_COMP_THD0_TMETER_REL_COMP_THD0_DUMMY_Msk                                                      (0xFFFUL << AON_REG_TMETER_REL_COMP_THD0_TMETER_REL_COMP_THD0_DUMMY_Pos)

/* 0x744    0x4000_0744
    9:0     R/W     REL_COMP2_THD                                               10'h0
    19:10   R/W     REL_COMP3_THD                                               10'h0
    29:20   R/W     FW_REL_COMP_THD                                             10'h0
    31:30   R/W     TMETER_REL_COMP_THD1_DUMMY                                  2'h0
 */
typedef union _AON_REG_TMETER_REL_COMP_THD1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REL_COMP2_THD: 10;
        uint32_t REL_COMP3_THD: 10;
        uint32_t FW_REL_COMP_THD: 10;
        uint32_t TMETER_REL_COMP_THD1_DUMMY: 2;
    };
} AON_REG_TMETER_REL_COMP_THD1_TYPE;

/*0x4000_0744 AON_REG_TMETER_REL_COMP_THD1*/
#define AON_REG_TMETER_REL_COMP_THD1_REL_COMP2_THD_Pos                                                                   0U
#define AON_REG_TMETER_REL_COMP_THD1_REL_COMP2_THD_Msk                                                                   (0x3FFUL << AON_REG_TMETER_REL_COMP_THD1_REL_COMP2_THD_Pos)

#define AON_REG_TMETER_REL_COMP_THD1_REL_COMP3_THD_Pos                                                                   10U
#define AON_REG_TMETER_REL_COMP_THD1_REL_COMP3_THD_Msk                                                                   (0x3FFUL << AON_REG_TMETER_REL_COMP_THD1_REL_COMP3_THD_Pos)

#define AON_REG_TMETER_REL_COMP_THD1_FW_REL_COMP_THD_Pos                                                                 20U
#define AON_REG_TMETER_REL_COMP_THD1_FW_REL_COMP_THD_Msk                                                                 (0x3FFUL << AON_REG_TMETER_REL_COMP_THD1_FW_REL_COMP_THD_Pos)

#define AON_REG_TMETER_REL_COMP_THD1_TMETER_REL_COMP_THD1_DUMMY_Pos                                                      30U
#define AON_REG_TMETER_REL_COMP_THD1_TMETER_REL_COMP_THD1_DUMMY_Msk                                                      (0x3UL << AON_REG_TMETER_REL_COMP_THD1_TMETER_REL_COMP_THD1_DUMMY_Pos)

/* 0x748    0x4000_0748
    9:0     R/W     ABS_COMP0_VREF_H                                            10'h0
    19:10   R/W     ABS_COMP0_VREF_L                                            10'h0
    31:20   R/W     TMETER_ABS_COMP0_VREF_DUMMY                                 12'h0
 */
typedef union _AON_REG_TMETER_ABS_COMP0_VREF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ABS_COMP0_VREF_H: 10;
        uint32_t ABS_COMP0_VREF_L: 10;
        uint32_t TMETER_ABS_COMP0_VREF_DUMMY: 12;
    };
} AON_REG_TMETER_ABS_COMP0_VREF_TYPE;

/*0x4000_0748 AON_REG_TMETER_ABS_COMP0_VREF*/
#define AON_REG_TMETER_ABS_COMP0_VREF_ABS_COMP0_VREF_H_Pos                                                               0U
#define AON_REG_TMETER_ABS_COMP0_VREF_ABS_COMP0_VREF_H_Msk                                                               (0x3FFUL << AON_REG_TMETER_ABS_COMP0_VREF_ABS_COMP0_VREF_H_Pos)

#define AON_REG_TMETER_ABS_COMP0_VREF_ABS_COMP0_VREF_L_Pos                                                               10U
#define AON_REG_TMETER_ABS_COMP0_VREF_ABS_COMP0_VREF_L_Msk                                                               (0x3FFUL << AON_REG_TMETER_ABS_COMP0_VREF_ABS_COMP0_VREF_L_Pos)

#define AON_REG_TMETER_ABS_COMP0_VREF_TMETER_ABS_COMP0_VREF_DUMMY_Pos                                                    20U
#define AON_REG_TMETER_ABS_COMP0_VREF_TMETER_ABS_COMP0_VREF_DUMMY_Msk                                                    (0xFFFUL << AON_REG_TMETER_ABS_COMP0_VREF_TMETER_ABS_COMP0_VREF_DUMMY_Pos)

/* 0x74C    0x4000_074c
    9:0     R/W     ABS_COMP1_VREF_H                                            10'h0
    19:10   R/W     ABS_COMP1_VREF_L                                            10'h0
    31:20   R/W     TMETER_ABS_COMP1_VREF_DUMMY                                 12'h0
 */
typedef union _AON_REG_TMETER_ABS_COMP1_VREF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ABS_COMP1_VREF_H: 10;
        uint32_t ABS_COMP1_VREF_L: 10;
        uint32_t TMETER_ABS_COMP1_VREF_DUMMY: 12;
    };
} AON_REG_TMETER_ABS_COMP1_VREF_TYPE;

/*0x4000_074c AON_REG_TMETER_ABS_COMP1_VREF*/
#define AON_REG_TMETER_ABS_COMP1_VREF_ABS_COMP1_VREF_H_Pos                                                               0U
#define AON_REG_TMETER_ABS_COMP1_VREF_ABS_COMP1_VREF_H_Msk                                                               (0x3FFUL << AON_REG_TMETER_ABS_COMP1_VREF_ABS_COMP1_VREF_H_Pos)

