rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_TMETER_ABS_COMP1_VREF_ABS_COMP1_VREF_L_Pos                                                               10U
#define AON_REG_TMETER_ABS_COMP1_VREF_ABS_COMP1_VREF_L_Msk                                                               (0x3FFUL << AON_REG_TMETER_ABS_COMP1_VREF_ABS_COMP1_VREF_L_Pos)

#define AON_REG_TMETER_ABS_COMP1_VREF_TMETER_ABS_COMP1_VREF_DUMMY_Pos                                                    20U
#define AON_REG_TMETER_ABS_COMP1_VREF_TMETER_ABS_COMP1_VREF_DUMMY_Msk                                                    (0xFFFUL << AON_REG_TMETER_ABS_COMP1_VREF_TMETER_ABS_COMP1_VREF_DUMMY_Pos)

/* 0x750    0x4000_0750
    9:0     R/W     ABS_COMP2_VREF_H                                            10'h0
    19:10   R/W     ABS_COMP2_VREF_L                                            10'h0
    31:20   R/W     TMETER_ABS_COMP2_VREF_DUMMY                                 12'h0
 */
typedef union _AON_REG_TMETER_ABS_COMP2_VREF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ABS_COMP2_VREF_H: 10;
        uint32_t ABS_COMP2_VREF_L: 10;
        uint32_t TMETER_ABS_COMP2_VREF_DUMMY: 12;
    };
} AON_REG_TMETER_ABS_COMP2_VREF_TYPE;

/*0x4000_0750 AON_REG_TMETER_ABS_COMP2_VREF*/
#define AON_REG_TMETER_ABS_COMP2_VREF_ABS_COMP2_VREF_H_Pos                                                               0U
#define AON_REG_TMETER_ABS_COMP2_VREF_ABS_COMP2_VREF_H_Msk                                                               (0x3FFUL << AON_REG_TMETER_ABS_COMP2_VREF_ABS_COMP2_VREF_H_Pos)

#define AON_REG_TMETER_ABS_COMP2_VREF_ABS_COMP2_VREF_L_Pos                                                               10U
#define AON_REG_TMETER_ABS_COMP2_VREF_ABS_COMP2_VREF_L_Msk                                                               (0x3FFUL << AON_REG_TMETER_ABS_COMP2_VREF_ABS_COMP2_VREF_L_Pos)

#define AON_REG_TMETER_ABS_COMP2_VREF_TMETER_ABS_COMP2_VREF_DUMMY_Pos                                                    20U
#define AON_REG_TMETER_ABS_COMP2_VREF_TMETER_ABS_COMP2_VREF_DUMMY_Msk                                                    (0xFFFUL << AON_REG_TMETER_ABS_COMP2_VREF_TMETER_ABS_COMP2_VREF_DUMMY_Pos)

/* 0x754    0x4000_0754
    9:0     R/W     ABS_COMP3_VREF_H                                            10'h0
    19:10   R/W     ABS_COMP3_VREF_L                                            10'h0
    31:20   R/W     TMETER_ABS_COMP3_VREF_DUMMY                                 12'h0
 */
typedef union _AON_REG_TMETER_ABS_COMP3_VREF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ABS_COMP3_VREF_H: 10;
        uint32_t ABS_COMP3_VREF_L: 10;
        uint32_t TMETER_ABS_COMP3_VREF_DUMMY: 12;
    };
} AON_REG_TMETER_ABS_COMP3_VREF_TYPE;

/*0x4000_0754 AON_REG_TMETER_ABS_COMP3_VREF*/
#define AON_REG_TMETER_ABS_COMP3_VREF_ABS_COMP3_VREF_H_Pos                                                               0U
#define AON_REG_TMETER_ABS_COMP3_VREF_ABS_COMP3_VREF_H_Msk                                                               (0x3FFUL << AON_REG_TMETER_ABS_COMP3_VREF_ABS_COMP3_VREF_H_Pos)

#define AON_REG_TMETER_ABS_COMP3_VREF_ABS_COMP3_VREF_L_Pos                                                               10U
#define AON_REG_TMETER_ABS_COMP3_VREF_ABS_COMP3_VREF_L_Msk                                                               (0x3FFUL << AON_REG_TMETER_ABS_COMP3_VREF_ABS_COMP3_VREF_L_Pos)

#define AON_REG_TMETER_ABS_COMP3_VREF_TMETER_ABS_COMP3_VREF_DUMMY_Pos                                                    20U
#define AON_REG_TMETER_ABS_COMP3_VREF_TMETER_ABS_COMP3_VREF_DUMMY_Msk                                                    (0xFFFUL << AON_REG_TMETER_ABS_COMP3_VREF_TMETER_ABS_COMP3_VREF_DUMMY_Pos)

/* 0x758    0x4000_0758
    0       R       DOUT                                                        1'h0
    1       R/W     EN11_DEBUG_TMETER                                           1'h0
    2       R       BB_TMETER_BBTRIGGER                                         1'h0
    3       R       TMETER_CLK                                                  1'h1
    4       R       TMETER_CH_LV                                                1'h0
    5       R/W     TMETER_CH_EN                                                1'h1
    6       R       POW11_TMETER                                                1'h0
    8:7     R/W     TMETER_CLK_FREQ_CTRL                                        2'h0
    10:9    R/W     TMETER_LDO_STARTUP_TIME                                     2'h0
    11      R/W     TMETER_BUF_CH                                               1'h0
    14:12   R/W     SELECT_TMETER                                               3'h0
    15      R/W     TMETER_ANALOG_CTRL_DUMMY                                    1'h0
    21:16   R/W     BT_TMETER18_LDO                                             6'h0
    31:22   R       TC_TMETER                                                   10'h200
 */
typedef union _AON_REG_TMETER_ANALOG_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DOUT: 1;
        uint32_t EN11_DEBUG_TMETER: 1;
        uint32_t BB_TMETER_BBTRIGGER: 1;
        uint32_t TMETER_CLK: 1;
        uint32_t TMETER_CH_LV: 1;
        uint32_t TMETER_CH_EN: 1;
        uint32_t POW11_TMETER: 1;
        uint32_t TMETER_CLK_FREQ_CTRL: 2;
        uint32_t TMETER_LDO_STARTUP_TIME: 2;
        uint32_t TMETER_BUF_CH: 1;
        uint32_t SELECT_TMETER: 3;
        uint32_t TMETER_ANALOG_CTRL_DUMMY: 1;
        uint32_t BT_TMETER18_LDO: 6;
        uint32_t TC_TMETER: 10;
    };
} AON_REG_TMETER_ANALOG_CTRL_TYPE;

/*0x4000_0758 AON_REG_TMETER_ANALOG_CTRL*/
#define AON_REG_TMETER_ANALOG_CTRL_DOUT_Pos                                                                              0U
#define AON_REG_TMETER_ANALOG_CTRL_DOUT_Msk                                                                              (0x1UL << AON_REG_TMETER_ANALOG_CTRL_DOUT_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_EN11_DEBUG_TMETER_Pos                                                                 1U
#define AON_REG_TMETER_ANALOG_CTRL_EN11_DEBUG_TMETER_Msk                                                                 (0x1UL << AON_REG_TMETER_ANALOG_CTRL_EN11_DEBUG_TMETER_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_BB_TMETER_BBTRIGGER_Pos                                                               2U
#define AON_REG_TMETER_ANALOG_CTRL_BB_TMETER_BBTRIGGER_Msk                                                               (0x1UL << AON_REG_TMETER_ANALOG_CTRL_BB_TMETER_BBTRIGGER_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_TMETER_CLK_Pos                                                                        3U
#define AON_REG_TMETER_ANALOG_CTRL_TMETER_CLK_Msk                                                                        (0x1UL << AON_REG_TMETER_ANALOG_CTRL_TMETER_CLK_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_TMETER_CH_LV_Pos                                                                      4U
#define AON_REG_TMETER_ANALOG_CTRL_TMETER_CH_LV_Msk                                                                      (0x1UL << AON_REG_TMETER_ANALOG_CTRL_TMETER_CH_LV_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_TMETER_CH_EN_Pos                                                                      5U
#define AON_REG_TMETER_ANALOG_CTRL_TMETER_CH_EN_Msk                                                                      (0x1UL << AON_REG_TMETER_ANALOG_CTRL_TMETER_CH_EN_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_POW11_TMETER_Pos                                                                      6U
#define AON_REG_TMETER_ANALOG_CTRL_POW11_TMETER_Msk                                                                      (0x1UL << AON_REG_TMETER_ANALOG_CTRL_POW11_TMETER_Pos)

