rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_TMETER_ANALOG_CTRL_TMETER_CLK_FREQ_CTRL_Pos                                                              7U
#define AON_REG_TMETER_ANALOG_CTRL_TMETER_CLK_FREQ_CTRL_Msk                                                              (0x3UL << AON_REG_TMETER_ANALOG_CTRL_TMETER_CLK_FREQ_CTRL_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_TMETER_LDO_STARTUP_TIME_Pos                                                           9U
#define AON_REG_TMETER_ANALOG_CTRL_TMETER_LDO_STARTUP_TIME_Msk                                                           (0x3UL << AON_REG_TMETER_ANALOG_CTRL_TMETER_LDO_STARTUP_TIME_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_TMETER_BUF_CH_Pos                                                                     11U
#define AON_REG_TMETER_ANALOG_CTRL_TMETER_BUF_CH_Msk                                                                     (0x1UL << AON_REG_TMETER_ANALOG_CTRL_TMETER_BUF_CH_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_SELECT_TMETER_Pos                                                                     12U
#define AON_REG_TMETER_ANALOG_CTRL_SELECT_TMETER_Msk                                                                     (0x7UL << AON_REG_TMETER_ANALOG_CTRL_SELECT_TMETER_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_TMETER_ANALOG_CTRL_DUMMY_Pos                                                          15U
#define AON_REG_TMETER_ANALOG_CTRL_TMETER_ANALOG_CTRL_DUMMY_Msk                                                          (0x1UL << AON_REG_TMETER_ANALOG_CTRL_TMETER_ANALOG_CTRL_DUMMY_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_BT_TMETER18_LDO_Pos                                                                   16U
#define AON_REG_TMETER_ANALOG_CTRL_BT_TMETER18_LDO_Msk                                                                   (0x3FUL << AON_REG_TMETER_ANALOG_CTRL_BT_TMETER18_LDO_Pos)

#define AON_REG_TMETER_ANALOG_CTRL_TC_TMETER_Pos                                                                         22U
#define AON_REG_TMETER_ANALOG_CTRL_TC_TMETER_Msk                                                                         (0x3FFUL << AON_REG_TMETER_ANALOG_CTRL_TC_TMETER_Pos)

/* 0x75C    0x4000_075c
    10:0    R/W     TMETER_MAPPING_B                                            11'h0
    29:11   R/W     TMETER_MAPPING_A                                            19'h0
    31:30   R       RESERVED                                                    2'h0
 */
typedef union _AON_REG_TMETER_MAPPING_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TMETER_MAPPING_B: 11;
        uint32_t TMETER_MAPPING_A: 19;
        uint32_t RESERVED: 2;
    };
} AON_REG_TMETER_MAPPING_TYPE;

/*0x4000_075c AON_REG_TMETER_MAPPING*/
#define AON_REG_TMETER_MAPPING_TMETER_MAPPING_B_Pos                                                                      0U
#define AON_REG_TMETER_MAPPING_TMETER_MAPPING_B_Msk                                                                      (0x7FFUL << AON_REG_TMETER_MAPPING_TMETER_MAPPING_B_Pos)

#define AON_REG_TMETER_MAPPING_TMETER_MAPPING_A_Pos                                                                      11U
#define AON_REG_TMETER_MAPPING_TMETER_MAPPING_A_Msk                                                                      (0x7FFFFUL << AON_REG_TMETER_MAPPING_TMETER_MAPPING_A_Pos)

#define AON_REG_TMETER_MAPPING_RESERVED_Pos                                                                              30U
#define AON_REG_TMETER_MAPPING_RESERVED_Msk                                                                              (0x3UL << AON_REG_TMETER_MAPPING_RESERVED_Pos)

/* 0x768    0x4000_0768
    0       R/W     RTC_CNT_START                                               1'b0
    1       R/W     RTC_CNT_RST                                                 1'b0
    2       R/W     RTC_PRE_CNT_RST                                             1'b0
    7:3     R       RTC_CR0_RESERVED7_3                                         5'b0
    8       R/W     RTC_TICK_IE                                                 1'b0
    9       R/W     RTC_CNT_OV_IE                                               1'b0
    10      R/W     RTC_PRECMP_IE                                               1'b0
    11      R/W     RTC_PRECMP_CMP3_IE                                          1'b0
    15:12   R       RTC_CR0_RESERVED15_12                                       4'h0
    16      R/W     RTC_CMP0_NV_IE                                              1'b0
    17      R/W     RTC_CMP1_NV_IE                                              1'b0
    18      R/W     RTC_CMP2_NV_IE                                              1'b0
    19      R/W     RTC_CMP3_NV_IE                                              1'b0
    20      R/W     RTC_CMP0_WK_IE                                              1'b0
    21      R/W     RTC_CMP1_WK_IE                                              1'b0
    22      R/W     RTC_CMP2_WK_IE                                              1'b0
    23      R/W     RTC_CMP3_WK_IE                                              1'b0
    28:24   R       RTC_CR0_RESERVED28_24                                       5'b0
    29      R/W     RTC_WK_IE                                                   1'b0
    30      R/W     RTC_NV_IE                                                   1'b0
    31      R/W     RTC_RST                                                     1'b0
 */
typedef union _AON_REG_RTC_CR0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CNT_START: 1;
        uint32_t RTC_CNT_RST: 1;
        uint32_t RTC_PRE_CNT_RST: 1;
        uint32_t RTC_CR0_RESERVED7_3: 5;
        uint32_t RTC_TICK_IE: 1;
        uint32_t RTC_CNT_OV_IE: 1;
        uint32_t RTC_PRECMP_IE: 1;
        uint32_t RTC_PRECMP_CMP3_IE: 1;
        uint32_t RTC_CR0_RESERVED15_12: 4;
        uint32_t RTC_CMP0_NV_IE: 1;
        uint32_t RTC_CMP1_NV_IE: 1;
        uint32_t RTC_CMP2_NV_IE: 1;
        uint32_t RTC_CMP3_NV_IE: 1;
        uint32_t RTC_CMP0_WK_IE: 1;
        uint32_t RTC_CMP1_WK_IE: 1;
        uint32_t RTC_CMP2_WK_IE: 1;
        uint32_t RTC_CMP3_WK_IE: 1;
        uint32_t RTC_CR0_RESERVED28_24: 5;
        uint32_t RTC_WK_IE: 1;
        uint32_t RTC_NV_IE: 1;
        uint32_t RTC_RST: 1;
    };
} AON_REG_RTC_CR0_TYPE;

/*0x4000_0768 AON_REG_RTC_CR0*/
#define AON_REG_RTC_CR0_RTC_CNT_START_Pos                                                                                0U
#define AON_REG_RTC_CR0_RTC_CNT_START_Msk                                                                                (0x1UL << AON_REG_RTC_CR0_RTC_CNT_START_Pos)

