rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_RTC_CR0_RTC_CNT_RST_Pos                                                                                  1U
#define AON_REG_RTC_CR0_RTC_CNT_RST_Msk                                                                                  (0x1UL << AON_REG_RTC_CR0_RTC_CNT_RST_Pos)

#define AON_REG_RTC_CR0_RTC_PRE_CNT_RST_Pos                                                                              2U
#define AON_REG_RTC_CR0_RTC_PRE_CNT_RST_Msk                                                                              (0x1UL << AON_REG_RTC_CR0_RTC_PRE_CNT_RST_Pos)

#define AON_REG_RTC_CR0_RTC_CR0_RESERVED7_3_Pos                                                                          3U
#define AON_REG_RTC_CR0_RTC_CR0_RESERVED7_3_Msk                                                                          (0x1FUL << AON_REG_RTC_CR0_RTC_CR0_RESERVED7_3_Pos)

#define AON_REG_RTC_CR0_RTC_TICK_IE_Pos                                                                                  8U
#define AON_REG_RTC_CR0_RTC_TICK_IE_Msk                                                                                  (0x1UL << AON_REG_RTC_CR0_RTC_TICK_IE_Pos)

#define AON_REG_RTC_CR0_RTC_CNT_OV_IE_Pos                                                                                9U
#define AON_REG_RTC_CR0_RTC_CNT_OV_IE_Msk                                                                                (0x1UL << AON_REG_RTC_CR0_RTC_CNT_OV_IE_Pos)

#define AON_REG_RTC_CR0_RTC_PRECMP_IE_Pos                                                                                10U
#define AON_REG_RTC_CR0_RTC_PRECMP_IE_Msk                                                                                (0x1UL << AON_REG_RTC_CR0_RTC_PRECMP_IE_Pos)

#define AON_REG_RTC_CR0_RTC_PRECMP_CMP3_IE_Pos                                                                           11U
#define AON_REG_RTC_CR0_RTC_PRECMP_CMP3_IE_Msk                                                                           (0x1UL << AON_REG_RTC_CR0_RTC_PRECMP_CMP3_IE_Pos)

#define AON_REG_RTC_CR0_RTC_CR0_RESERVED15_12_Pos                                                                        12U
#define AON_REG_RTC_CR0_RTC_CR0_RESERVED15_12_Msk                                                                        (0xFUL << AON_REG_RTC_CR0_RTC_CR0_RESERVED15_12_Pos)

#define AON_REG_RTC_CR0_RTC_CMP0_NV_IE_Pos                                                                               16U
#define AON_REG_RTC_CR0_RTC_CMP0_NV_IE_Msk                                                                               (0x1UL << AON_REG_RTC_CR0_RTC_CMP0_NV_IE_Pos)

#define AON_REG_RTC_CR0_RTC_CMP1_NV_IE_Pos                                                                               17U
#define AON_REG_RTC_CR0_RTC_CMP1_NV_IE_Msk                                                                               (0x1UL << AON_REG_RTC_CR0_RTC_CMP1_NV_IE_Pos)

#define AON_REG_RTC_CR0_RTC_CMP2_NV_IE_Pos                                                                               18U
#define AON_REG_RTC_CR0_RTC_CMP2_NV_IE_Msk                                                                               (0x1UL << AON_REG_RTC_CR0_RTC_CMP2_NV_IE_Pos)

#define AON_REG_RTC_CR0_RTC_CMP3_NV_IE_Pos                                                                               19U
#define AON_REG_RTC_CR0_RTC_CMP3_NV_IE_Msk                                                                               (0x1UL << AON_REG_RTC_CR0_RTC_CMP3_NV_IE_Pos)

#define AON_REG_RTC_CR0_RTC_CMP0_WK_IE_Pos                                                                               20U
#define AON_REG_RTC_CR0_RTC_CMP0_WK_IE_Msk                                                                               (0x1UL << AON_REG_RTC_CR0_RTC_CMP0_WK_IE_Pos)

#define AON_REG_RTC_CR0_RTC_CMP1_WK_IE_Pos                                                                               21U
#define AON_REG_RTC_CR0_RTC_CMP1_WK_IE_Msk                                                                               (0x1UL << AON_REG_RTC_CR0_RTC_CMP1_WK_IE_Pos)

#define AON_REG_RTC_CR0_RTC_CMP2_WK_IE_Pos                                                                               22U
#define AON_REG_RTC_CR0_RTC_CMP2_WK_IE_Msk                                                                               (0x1UL << AON_REG_RTC_CR0_RTC_CMP2_WK_IE_Pos)

#define AON_REG_RTC_CR0_RTC_CMP3_WK_IE_Pos                                                                               23U
#define AON_REG_RTC_CR0_RTC_CMP3_WK_IE_Msk                                                                               (0x1UL << AON_REG_RTC_CR0_RTC_CMP3_WK_IE_Pos)

#define AON_REG_RTC_CR0_RTC_CR0_RESERVED28_24_Pos                                                                        24U
#define AON_REG_RTC_CR0_RTC_CR0_RESERVED28_24_Msk                                                                        (0x1FUL << AON_REG_RTC_CR0_RTC_CR0_RESERVED28_24_Pos)

#define AON_REG_RTC_CR0_RTC_WK_IE_Pos                                                                                    29U
#define AON_REG_RTC_CR0_RTC_WK_IE_Msk                                                                                    (0x1UL << AON_REG_RTC_CR0_RTC_WK_IE_Pos)

#define AON_REG_RTC_CR0_RTC_NV_IE_Pos                                                                                    30U
#define AON_REG_RTC_CR0_RTC_NV_IE_Msk                                                                                    (0x1UL << AON_REG_RTC_CR0_RTC_NV_IE_Pos)

#define AON_REG_RTC_CR0_RTC_RST_Pos                                                                                      31U
#define AON_REG_RTC_CR0_RTC_RST_Msk                                                                                      (0x1UL << AON_REG_RTC_CR0_RTC_RST_Pos)

/* 0x76C    0x4000_076c
    0       R/WAC   RTC_TICK_CLR                                                1'b0
    1       R/WAC   RTC_CNT_OV_CLR                                              1'b0
    2       R/WAC   RTC_PRECMP_CLR                                              1'b0
    3       R/WAC   RTC_PRECMP_CMP3_CLR                                         1'b0
    7:4     R       RTC_INT_CLEAR_RESERVED7_4                                   4'h0
    8       R/WAC   RTC_CMP0_NV_CLR                                             1'b0
    9       R/WAC   RTC_CMP1_NV_CLR                                             1'b0
    10      R/WAC   RTC_CMP2_NV_CLR                                             1'b0
    11      R/WAC   RTC_CMP3_NV_CLR                                             1'b0
    12      R/WAC   RTC_CMP0_WK_CLR                                             1'b0
    13      R/WAC   RTC_CMP1_WK_CLR                                             1'b0
    14      R/WAC   RTC_CMP2_WK_CLR                                             1'b0
    15      R/WAC   RTC_CMP3_WK_CLR                                             1'b0
    31:16   R       RTC_INT_CLEAR_RESERVED31_16                                 16'b0
 */
typedef union _AON_REG_RTC_INT_clear_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_TICK_CLR: 1;
        uint32_t RTC_CNT_OV_CLR: 1;
        uint32_t RTC_PRECMP_CLR: 1;
        uint32_t RTC_PRECMP_CMP3_CLR: 1;
        uint32_t RTC_INT_CLEAR_RESERVED7_4: 4;
        uint32_t RTC_CMP0_NV_CLR: 1;
        uint32_t RTC_CMP1_NV_CLR: 1;
        uint32_t RTC_CMP2_NV_CLR: 1;
        uint32_t RTC_CMP3_NV_CLR: 1;
        uint32_t RTC_CMP0_WK_CLR: 1;
        uint32_t RTC_CMP1_WK_CLR: 1;
        uint32_t RTC_CMP2_WK_CLR: 1;
        uint32_t RTC_CMP3_WK_CLR: 1;
        uint32_t RTC_INT_CLEAR_RESERVED31_16: 16;
    };
} AON_REG_RTC_INT_clear_TYPE;

/*0x4000_076c AON_REG_RTC_INT_clear*/
#define AON_REG_RTC_INT_clear_RTC_TICK_CLR_Pos                                                                           0U
#define AON_REG_RTC_INT_clear_RTC_TICK_CLR_Msk                                                                           (0x1UL << AON_REG_RTC_INT_clear_RTC_TICK_CLR_Pos)

