rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_RTC_INT_clear_RTC_CNT_OV_CLR_Pos                                                                         1U
#define AON_REG_RTC_INT_clear_RTC_CNT_OV_CLR_Msk                                                                         (0x1UL << AON_REG_RTC_INT_clear_RTC_CNT_OV_CLR_Pos)

#define AON_REG_RTC_INT_clear_RTC_PRECMP_CLR_Pos                                                                         2U
#define AON_REG_RTC_INT_clear_RTC_PRECMP_CLR_Msk                                                                         (0x1UL << AON_REG_RTC_INT_clear_RTC_PRECMP_CLR_Pos)

#define AON_REG_RTC_INT_clear_RTC_PRECMP_CMP3_CLR_Pos                                                                    3U
#define AON_REG_RTC_INT_clear_RTC_PRECMP_CMP3_CLR_Msk                                                                    (0x1UL << AON_REG_RTC_INT_clear_RTC_PRECMP_CMP3_CLR_Pos)

#define AON_REG_RTC_INT_clear_RTC_INT_CLEAR_RESERVED7_4_Pos                                                              4U
#define AON_REG_RTC_INT_clear_RTC_INT_CLEAR_RESERVED7_4_Msk                                                              (0xFUL << AON_REG_RTC_INT_clear_RTC_INT_CLEAR_RESERVED7_4_Pos)

#define AON_REG_RTC_INT_clear_RTC_CMP0_NV_CLR_Pos                                                                        8U
#define AON_REG_RTC_INT_clear_RTC_CMP0_NV_CLR_Msk                                                                        (0x1UL << AON_REG_RTC_INT_clear_RTC_CMP0_NV_CLR_Pos)

#define AON_REG_RTC_INT_clear_RTC_CMP1_NV_CLR_Pos                                                                        9U
#define AON_REG_RTC_INT_clear_RTC_CMP1_NV_CLR_Msk                                                                        (0x1UL << AON_REG_RTC_INT_clear_RTC_CMP1_NV_CLR_Pos)

#define AON_REG_RTC_INT_clear_RTC_CMP2_NV_CLR_Pos                                                                        10U
#define AON_REG_RTC_INT_clear_RTC_CMP2_NV_CLR_Msk                                                                        (0x1UL << AON_REG_RTC_INT_clear_RTC_CMP2_NV_CLR_Pos)

#define AON_REG_RTC_INT_clear_RTC_CMP3_NV_CLR_Pos                                                                        11U
#define AON_REG_RTC_INT_clear_RTC_CMP3_NV_CLR_Msk                                                                        (0x1UL << AON_REG_RTC_INT_clear_RTC_CMP3_NV_CLR_Pos)

#define AON_REG_RTC_INT_clear_RTC_CMP0_WK_CLR_Pos                                                                        12U
#define AON_REG_RTC_INT_clear_RTC_CMP0_WK_CLR_Msk                                                                        (0x1UL << AON_REG_RTC_INT_clear_RTC_CMP0_WK_CLR_Pos)

#define AON_REG_RTC_INT_clear_RTC_CMP1_WK_CLR_Pos                                                                        13U
#define AON_REG_RTC_INT_clear_RTC_CMP1_WK_CLR_Msk                                                                        (0x1UL << AON_REG_RTC_INT_clear_RTC_CMP1_WK_CLR_Pos)

#define AON_REG_RTC_INT_clear_RTC_CMP2_WK_CLR_Pos                                                                        14U
#define AON_REG_RTC_INT_clear_RTC_CMP2_WK_CLR_Msk                                                                        (0x1UL << AON_REG_RTC_INT_clear_RTC_CMP2_WK_CLR_Pos)

#define AON_REG_RTC_INT_clear_RTC_CMP3_WK_CLR_Pos                                                                        15U
#define AON_REG_RTC_INT_clear_RTC_CMP3_WK_CLR_Msk                                                                        (0x1UL << AON_REG_RTC_INT_clear_RTC_CMP3_WK_CLR_Pos)

#define AON_REG_RTC_INT_clear_RTC_INT_CLEAR_RESERVED31_16_Pos                                                            16U
#define AON_REG_RTC_INT_clear_RTC_INT_CLEAR_RESERVED31_16_Msk                                                            (0xFFFFUL << AON_REG_RTC_INT_clear_RTC_INT_CLEAR_RESERVED31_16_Pos)

/* 0x770    0x4000_0770
    0       R       RTC_TICK_SR                                                 1'b0
    1       R       RTC_CNT_OV_SR                                               1'b0
    2       R       RTC_PRECMP_SR                                               1'b0
    3       R       RTC_PRECMP_CMP3_SR                                          1'b0
    7:4     R       RTC_INT_SR_RESERVED7_4                                      4'h0
    8       R       RTC_CMP0_NV_SR                                              1'b0
    9       R       RTC_CMP1_NV_SR                                              1'b0
    10      R       RTC_CMP2_NV_SR                                              1'b0
    11      R       RTC_CMP3_NV_SR                                              1'b0
    12      R       RTC_CMP0_WK_SR                                              1'b0
    13      R       RTC_CMP1_WK_SR                                              1'b0
    14      R       RTC_CMP2_WK_SR                                              1'b0
    15      R       RTC_CMP3_WK_SR                                              1'b0
    31:16   R       RTC_INT_SR_RESERVED31_16                                    16'b0
 */
typedef union _AON_REG_RTC_INT_SR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_TICK_SR: 1;
        uint32_t RTC_CNT_OV_SR: 1;
        uint32_t RTC_PRECMP_SR: 1;
        uint32_t RTC_PRECMP_CMP3_SR: 1;
        uint32_t RTC_INT_SR_RESERVED7_4: 4;
        uint32_t RTC_CMP0_NV_SR: 1;
        uint32_t RTC_CMP1_NV_SR: 1;
        uint32_t RTC_CMP2_NV_SR: 1;
        uint32_t RTC_CMP3_NV_SR: 1;
        uint32_t RTC_CMP0_WK_SR: 1;
        uint32_t RTC_CMP1_WK_SR: 1;
        uint32_t RTC_CMP2_WK_SR: 1;
        uint32_t RTC_CMP3_WK_SR: 1;
        uint32_t RTC_INT_SR_RESERVED31_16: 16;
    };
} AON_REG_RTC_INT_SR_TYPE;

/*0x4000_0770 AON_REG_RTC_INT_SR*/
#define AON_REG_RTC_INT_SR_RTC_TICK_SR_Pos                                                                               0U
#define AON_REG_RTC_INT_SR_RTC_TICK_SR_Msk                                                                               (0x1UL << AON_REG_RTC_INT_SR_RTC_TICK_SR_Pos)

#define AON_REG_RTC_INT_SR_RTC_CNT_OV_SR_Pos                                                                             1U
#define AON_REG_RTC_INT_SR_RTC_CNT_OV_SR_Msk                                                                             (0x1UL << AON_REG_RTC_INT_SR_RTC_CNT_OV_SR_Pos)

#define AON_REG_RTC_INT_SR_RTC_PRECMP_SR_Pos                                                                             2U
#define AON_REG_RTC_INT_SR_RTC_PRECMP_SR_Msk                                                                             (0x1UL << AON_REG_RTC_INT_SR_RTC_PRECMP_SR_Pos)

#define AON_REG_RTC_INT_SR_RTC_PRECMP_CMP3_SR_Pos                                                                        3U
#define AON_REG_RTC_INT_SR_RTC_PRECMP_CMP3_SR_Msk                                                                        (0x1UL << AON_REG_RTC_INT_SR_RTC_PRECMP_CMP3_SR_Pos)

