rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_RTC_INT_SR_RTC_INT_SR_RESERVED7_4_Pos                                                                    4U
#define AON_REG_RTC_INT_SR_RTC_INT_SR_RESERVED7_4_Msk                                                                    (0xFUL << AON_REG_RTC_INT_SR_RTC_INT_SR_RESERVED7_4_Pos)

#define AON_REG_RTC_INT_SR_RTC_CMP0_NV_SR_Pos                                                                            8U
#define AON_REG_RTC_INT_SR_RTC_CMP0_NV_SR_Msk                                                                            (0x1UL << AON_REG_RTC_INT_SR_RTC_CMP0_NV_SR_Pos)

#define AON_REG_RTC_INT_SR_RTC_CMP1_NV_SR_Pos                                                                            9U
#define AON_REG_RTC_INT_SR_RTC_CMP1_NV_SR_Msk                                                                            (0x1UL << AON_REG_RTC_INT_SR_RTC_CMP1_NV_SR_Pos)

#define AON_REG_RTC_INT_SR_RTC_CMP2_NV_SR_Pos                                                                            10U
#define AON_REG_RTC_INT_SR_RTC_CMP2_NV_SR_Msk                                                                            (0x1UL << AON_REG_RTC_INT_SR_RTC_CMP2_NV_SR_Pos)

#define AON_REG_RTC_INT_SR_RTC_CMP3_NV_SR_Pos                                                                            11U
#define AON_REG_RTC_INT_SR_RTC_CMP3_NV_SR_Msk                                                                            (0x1UL << AON_REG_RTC_INT_SR_RTC_CMP3_NV_SR_Pos)

#define AON_REG_RTC_INT_SR_RTC_CMP0_WK_SR_Pos                                                                            12U
#define AON_REG_RTC_INT_SR_RTC_CMP0_WK_SR_Msk                                                                            (0x1UL << AON_REG_RTC_INT_SR_RTC_CMP0_WK_SR_Pos)

#define AON_REG_RTC_INT_SR_RTC_CMP1_WK_SR_Pos                                                                            13U
#define AON_REG_RTC_INT_SR_RTC_CMP1_WK_SR_Msk                                                                            (0x1UL << AON_REG_RTC_INT_SR_RTC_CMP1_WK_SR_Pos)

#define AON_REG_RTC_INT_SR_RTC_CMP2_WK_SR_Pos                                                                            14U
#define AON_REG_RTC_INT_SR_RTC_CMP2_WK_SR_Msk                                                                            (0x1UL << AON_REG_RTC_INT_SR_RTC_CMP2_WK_SR_Pos)

#define AON_REG_RTC_INT_SR_RTC_CMP3_WK_SR_Pos                                                                            15U
#define AON_REG_RTC_INT_SR_RTC_CMP3_WK_SR_Msk                                                                            (0x1UL << AON_REG_RTC_INT_SR_RTC_CMP3_WK_SR_Pos)

#define AON_REG_RTC_INT_SR_RTC_INT_SR_RESERVED31_16_Pos                                                                  16U
#define AON_REG_RTC_INT_SR_RTC_INT_SR_RESERVED31_16_Msk                                                                  (0xFFFFUL << AON_REG_RTC_INT_SR_RTC_INT_SR_RESERVED31_16_Pos)

/* 0x774    0x4000_0774
    11:0    R/W     RTC_PRESCALER                                               12'b0
    31:12   R       RTC_PRESCALER_RESERVED31_12                                 20'b0
 */
typedef union _AON_REG_RTC_PRESCALER_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PRESCALER: 12;
        uint32_t RTC_PRESCALER_RESERVED31_12: 20;
    };
} AON_REG_RTC_PRESCALER_TYPE;

/*0x4000_0774 AON_REG_RTC_PRESCALER*/
#define AON_REG_RTC_PRESCALER_RTC_PRESCALER_Pos                                                                          0U
#define AON_REG_RTC_PRESCALER_RTC_PRESCALER_Msk                                                                          (0xFFFUL << AON_REG_RTC_PRESCALER_RTC_PRESCALER_Pos)

#define AON_REG_RTC_PRESCALER_RTC_PRESCALER_RESERVED31_12_Pos                                                            12U
#define AON_REG_RTC_PRESCALER_RTC_PRESCALER_RESERVED31_12_Msk                                                            (0xFFFFFUL << AON_REG_RTC_PRESCALER_RTC_PRESCALER_RESERVED31_12_Pos)

/* 0x778    0x4000_0778
    31:0    R/W     RTC_CMP0                                                    32'b0
 */
typedef union _AON_REG_RTC_COMP_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP0;
    };
} AON_REG_RTC_COMP_0_TYPE;

/*0x4000_0778 AON_REG_RTC_COMP_0*/
#define AON_REG_RTC_COMP_0_RTC_CMP0_Pos                                                                                  0U
#define AON_REG_RTC_COMP_0_RTC_CMP0_Msk                                                                                  (0xFFFFFFFFUL << AON_REG_RTC_COMP_0_RTC_CMP0_Pos)

/* 0x77C    0x4000_077c
    31:0    R/W     RTC_CMP1                                                    32'b0
 */
typedef union _AON_REG_RTC_COMP_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP1;
    };
} AON_REG_RTC_COMP_1_TYPE;

/*0x4000_077c AON_REG_RTC_COMP_1*/
#define AON_REG_RTC_COMP_1_RTC_CMP1_Pos                                                                                  0U
#define AON_REG_RTC_COMP_1_RTC_CMP1_Msk                                                                                  (0xFFFFFFFFUL << AON_REG_RTC_COMP_1_RTC_CMP1_Pos)

/* 0x780    0x4000_0780
    31:0    R/W     RTC_CMP2                                                    32'b0
 */
typedef union _AON_REG_RTC_COMP_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP2;
    };
} AON_REG_RTC_COMP_2_TYPE;

/*0x4000_0780 AON_REG_RTC_COMP_2*/
#define AON_REG_RTC_COMP_2_RTC_CMP2_Pos                                                                                  0U
#define AON_REG_RTC_COMP_2_RTC_CMP2_Msk                                                                                  (0xFFFFFFFFUL << AON_REG_RTC_COMP_2_RTC_CMP2_Pos)

/* 0x784    0x4000_0784
    31:0    R/W     RTC_CMP3                                                    32'b0
 */
typedef union _AON_REG_RTC_COMP_3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP3;
    };
} AON_REG_RTC_COMP_3_TYPE;

