rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0784 AON_REG_RTC_COMP_3*/
#define AON_REG_RTC_COMP_3_RTC_CMP3_Pos                                                                                  0U
#define AON_REG_RTC_COMP_3_RTC_CMP3_Msk                                                                                  (0xFFFFFFFFUL << AON_REG_RTC_COMP_3_RTC_CMP3_Pos)

/* 0x788    0x4000_0788
    31:0    R       RTC_CNT                                                     32'b0
 */
typedef union _AON_REG_RTC_CNT0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CNT;
    };
} AON_REG_RTC_CNT0_TYPE;

/*0x4000_0788 AON_REG_RTC_CNT0*/
#define AON_REG_RTC_CNT0_RTC_CNT_Pos                                                                                     0U
#define AON_REG_RTC_CNT0_RTC_CNT_Msk                                                                                     (0xFFFFFFFFUL << AON_REG_RTC_CNT0_RTC_CNT_Pos)

/* 0x78C    0x4000_078c
    11:0    R       RTC_PRESCALE_CNT                                            12'b0
    31:12   R       RTC_PRESCALER_CNT0_RESERVED31_12                            20'b0
 */
typedef union _AON_REG_RTC_PRESCALE_CNT0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PRESCALE_CNT: 12;
        uint32_t RTC_PRESCALER_CNT0_RESERVED31_12: 20;
    };
} AON_REG_RTC_PRESCALE_CNT0_TYPE;

/*0x4000_078c AON_REG_RTC_PRESCALE_CNT0*/
#define AON_REG_RTC_PRESCALE_CNT0_RTC_PRESCALE_CNT_Pos                                                                   0U
#define AON_REG_RTC_PRESCALE_CNT0_RTC_PRESCALE_CNT_Msk                                                                   (0xFFFUL << AON_REG_RTC_PRESCALE_CNT0_RTC_PRESCALE_CNT_Pos)

#define AON_REG_RTC_PRESCALE_CNT0_RTC_PRESCALER_CNT0_RESERVED31_12_Pos                                                   12U
#define AON_REG_RTC_PRESCALE_CNT0_RTC_PRESCALER_CNT0_RESERVED31_12_Msk                                                   (0xFFFFFUL << AON_REG_RTC_PRESCALE_CNT0_RTC_PRESCALER_CNT0_RESERVED31_12_Pos)

/* 0x790    0x4000_0790
    11:0    R/W     RTC_PRESCALE_CMP                                            12'b0
    31:12   R       RTC_PRESCALER_CMP0_RESERVED31_12                            20'b0
 */
typedef union _AON_REG_RTC_PRESCALE_CMP0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_PRESCALE_CMP: 12;
        uint32_t RTC_PRESCALER_CMP0_RESERVED31_12: 20;
    };
} AON_REG_RTC_PRESCALE_CMP0_TYPE;

/*0x4000_0790 AON_REG_RTC_PRESCALE_CMP0*/
#define AON_REG_RTC_PRESCALE_CMP0_RTC_PRESCALE_CMP_Pos                                                                   0U
#define AON_REG_RTC_PRESCALE_CMP0_RTC_PRESCALE_CMP_Msk                                                                   (0xFFFUL << AON_REG_RTC_PRESCALE_CMP0_RTC_PRESCALE_CMP_Pos)

#define AON_REG_RTC_PRESCALE_CMP0_RTC_PRESCALER_CMP0_RESERVED31_12_Pos                                                   12U
#define AON_REG_RTC_PRESCALE_CMP0_RTC_PRESCALER_CMP0_RESERVED31_12_Msk                                                   (0xFFFFFUL << AON_REG_RTC_PRESCALE_CMP0_RTC_PRESCALER_CMP0_RESERVED31_12_Pos)

/* 0x794    0x4000_0794
    31:0    R/W     RTC_BACKUP                                                  32'b0
 */
typedef union _AON_REG_RTC_BACKUP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_BACKUP;
    };
} AON_REG_RTC_BACKUP_TYPE;

/*0x4000_0794 AON_REG_RTC_BACKUP*/
#define AON_REG_RTC_BACKUP_RTC_BACKUP_Pos                                                                                0U
#define AON_REG_RTC_BACKUP_RTC_BACKUP_Msk                                                                                (0xFFFFFFFFUL << AON_REG_RTC_BACKUP_RTC_BACKUP_Pos)

/* 0x798    0x4000_0798
    31:0    R       RTC_RTL_VERSION                                             32'h20240402
 */
typedef union _AON_REG_RTC_RTL_VERSION0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_RTL_VERSION;
    };
} AON_REG_RTC_RTL_VERSION0_TYPE;

/*0x4000_0798 AON_REG_RTC_RTL_VERSION0*/
#define AON_REG_RTC_RTL_VERSION0_RTC_RTL_VERSION_Pos                                                                     0U
#define AON_REG_RTC_RTL_VERSION0_RTC_RTL_VERSION_Msk                                                                     (0xFFFFFFFFUL << AON_REG_RTC_RTL_VERSION0_RTC_RTL_VERSION_Pos)

/* 0x79C    0x4000_079c
    0       R/W     RTC_CMP0_RELOAD_EN                                          1'h0
    1       R/W     RTC_CMP1_RELOAD_EN                                          1'h0
    2       R/W     RTC_CMP2_RELOAD_EN                                          1'h0
    3       R/W     RTC_CMP3_RELOAD_EN                                          1'h0
    31:4    R       RTC_QACTIVE_CTRL_RESERVED31_4                               28'h0
 */
typedef union _AON_REG_RTC_RELOAD_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP0_RELOAD_EN: 1;
        uint32_t RTC_CMP1_RELOAD_EN: 1;
        uint32_t RTC_CMP2_RELOAD_EN: 1;
        uint32_t RTC_CMP3_RELOAD_EN: 1;
        uint32_t RTC_QACTIVE_CTRL_RESERVED31_4: 28;
    };
} AON_REG_RTC_RELOAD_CTRL_TYPE;

/*0x4000_079c AON_REG_RTC_RELOAD_CTRL*/
#define AON_REG_RTC_RELOAD_CTRL_RTC_CMP0_RELOAD_EN_Pos                                                                   0U
#define AON_REG_RTC_RELOAD_CTRL_RTC_CMP0_RELOAD_EN_Msk                                                                   (0x1UL << AON_REG_RTC_RELOAD_CTRL_RTC_CMP0_RELOAD_EN_Pos)

#define AON_REG_RTC_RELOAD_CTRL_RTC_CMP1_RELOAD_EN_Pos                                                                   1U
#define AON_REG_RTC_RELOAD_CTRL_RTC_CMP1_RELOAD_EN_Msk                                                                   (0x1UL << AON_REG_RTC_RELOAD_CTRL_RTC_CMP1_RELOAD_EN_Pos)

#define AON_REG_RTC_RELOAD_CTRL_RTC_CMP2_RELOAD_EN_Pos                                                                   2U
#define AON_REG_RTC_RELOAD_CTRL_RTC_CMP2_RELOAD_EN_Msk                                                                   (0x1UL << AON_REG_RTC_RELOAD_CTRL_RTC_CMP2_RELOAD_EN_Pos)

#define AON_REG_RTC_RELOAD_CTRL_RTC_CMP3_RELOAD_EN_Pos                                                                   3U
#define AON_REG_RTC_RELOAD_CTRL_RTC_CMP3_RELOAD_EN_Msk                                                                   (0x1UL << AON_REG_RTC_RELOAD_CTRL_RTC_CMP3_RELOAD_EN_Pos)

