rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_RTC_RELOAD_CTRL_RTC_QACTIVE_CTRL_RESERVED31_4_Pos                                                        4U
#define AON_REG_RTC_RELOAD_CTRL_RTC_QACTIVE_CTRL_RESERVED31_4_Msk                                                        (0xFFFFFFFUL << AON_REG_RTC_RELOAD_CTRL_RTC_QACTIVE_CTRL_RESERVED31_4_Pos)

/* 0x7A0    0x4000_07a0
    31:0    R/W     RTC_CMP0_RELOAD                                             32'b0
 */
typedef union _AON_REG_RTC_COMP_0_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP0_RELOAD;
    };
} AON_REG_RTC_COMP_0_RELOAD_TYPE;

/*0x4000_07a0 AON_REG_RTC_COMP_0_RELOAD*/
#define AON_REG_RTC_COMP_0_RELOAD_RTC_CMP0_RELOAD_Pos                                                                    0U
#define AON_REG_RTC_COMP_0_RELOAD_RTC_CMP0_RELOAD_Msk                                                                    (0xFFFFFFFFUL << AON_REG_RTC_COMP_0_RELOAD_RTC_CMP0_RELOAD_Pos)

/* 0x7A4    0x4000_07a4
    31:0    R/W     RTC_CMP1_RELOAD                                             32'b0
 */
typedef union _AON_REG_RTC_COMP_1_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP1_RELOAD;
    };
} AON_REG_RTC_COMP_1_RELOAD_TYPE;

/*0x4000_07a4 AON_REG_RTC_COMP_1_RELOAD*/
#define AON_REG_RTC_COMP_1_RELOAD_RTC_CMP1_RELOAD_Pos                                                                    0U
#define AON_REG_RTC_COMP_1_RELOAD_RTC_CMP1_RELOAD_Msk                                                                    (0xFFFFFFFFUL << AON_REG_RTC_COMP_1_RELOAD_RTC_CMP1_RELOAD_Pos)

/* 0x7A8    0x4000_07a8
    31:0    R/W     RTC_CMP2_RELOAD                                             32'b0
 */
typedef union _AON_REG_RTC_COMP_2_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP2_RELOAD;
    };
} AON_REG_RTC_COMP_2_RELOAD_TYPE;

/*0x4000_07a8 AON_REG_RTC_COMP_2_RELOAD*/
#define AON_REG_RTC_COMP_2_RELOAD_RTC_CMP2_RELOAD_Pos                                                                    0U
#define AON_REG_RTC_COMP_2_RELOAD_RTC_CMP2_RELOAD_Msk                                                                    (0xFFFFFFFFUL << AON_REG_RTC_COMP_2_RELOAD_RTC_CMP2_RELOAD_Pos)

/* 0x7AC    0x4000_07ac
    31:0    R/W     RTC_CMP3_RELOAD                                             32'b0
 */
typedef union _AON_REG_RTC_COMP_3_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_CMP3_RELOAD;
    };
} AON_REG_RTC_COMP_3_RELOAD_TYPE;

/*0x4000_07ac AON_REG_RTC_COMP_3_RELOAD*/
#define AON_REG_RTC_COMP_3_RELOAD_RTC_CMP3_RELOAD_Pos                                                                    0U
#define AON_REG_RTC_COMP_3_RELOAD_RTC_CMP3_RELOAD_Msk                                                                    (0xFFFFFFFFUL << AON_REG_RTC_COMP_3_RELOAD_RTC_CMP3_RELOAD_Pos)

/* 0x7B0    0x4000_07b0
    0       R/W     RTC_RAP_MODE                                                1'h0
    1       R/WAC   RTC_FW_TASK_START                                           1'h0
    2       R/WAC   RTC_FW_TASK_STOP                                            1'h0
    3       R/WAC   RTC_FW_TASK_CLEAR                                           1'h0
    4       R/WAC   RTC_FW_TASK_RELOAD_CMP0                                     1'h0
    5       R/WAC   RTC_FW_TASK_RELOAD_CMP1                                     1'h0
    6       R/WAC   RTC_FW_TASK_RELOAD_CMP2                                     1'h0
    7       R/WAC   RTC_FW_TASK_RELOAD_CMP3                                     1'h0
    31:8    R       RTC_TASK_CTRL_RESERVED31_8                                  24'h0
 */
typedef union _AON_REG_RTC_TASK_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_RAP_MODE: 1;
        uint32_t RTC_FW_TASK_START: 1;
        uint32_t RTC_FW_TASK_STOP: 1;
        uint32_t RTC_FW_TASK_CLEAR: 1;
        uint32_t RTC_FW_TASK_RELOAD_CMP0: 1;
        uint32_t RTC_FW_TASK_RELOAD_CMP1: 1;
        uint32_t RTC_FW_TASK_RELOAD_CMP2: 1;
        uint32_t RTC_FW_TASK_RELOAD_CMP3: 1;
        uint32_t RTC_TASK_CTRL_RESERVED31_8: 24;
    };
} AON_REG_RTC_TASK_CTRL_TYPE;

/*0x4000_07b0 AON_REG_RTC_TASK_CTRL*/
#define AON_REG_RTC_TASK_CTRL_RTC_RAP_MODE_Pos                                                                           0U
#define AON_REG_RTC_TASK_CTRL_RTC_RAP_MODE_Msk                                                                           (0x1UL << AON_REG_RTC_TASK_CTRL_RTC_RAP_MODE_Pos)

#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_START_Pos                                                                      1U
#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_START_Msk                                                                      (0x1UL << AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_START_Pos)

#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_STOP_Pos                                                                       2U
#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_STOP_Msk                                                                       (0x1UL << AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_STOP_Pos)

#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_CLEAR_Pos                                                                      3U
#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_CLEAR_Msk                                                                      (0x1UL << AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_CLEAR_Pos)

#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP0_Pos                                                                4U
#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP0_Msk                                                                (0x1UL << AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP0_Pos)

#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP1_Pos                                                                5U
#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP1_Msk                                                                (0x1UL << AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP1_Pos)

#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP2_Pos                                                                6U
#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP2_Msk                                                                (0x1UL << AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP2_Pos)

#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP3_Pos                                                                7U
#define AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP3_Msk                                                                (0x1UL << AON_REG_RTC_TASK_CTRL_RTC_FW_TASK_RELOAD_CMP3_Pos)

#define AON_REG_RTC_TASK_CTRL_RTC_TASK_CTRL_RESERVED31_8_Pos                                                             8U
#define AON_REG_RTC_TASK_CTRL_RTC_TASK_CTRL_RESERVED31_8_Msk                                                             (0xFFFFFFUL << AON_REG_RTC_TASK_CTRL_RTC_TASK_CTRL_RESERVED31_8_Pos)

