rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x7B4    0x4000_07b4
    0       R/W     RTC_TASK_STOP_SUB_EN                                        1'h0
    1       R/W     RTC_TASK_CLEAR_SUB_EN                                       1'h0
    2       R/W     RTC_TASK_RELOAD_CMP0_SUB_EN                                 1'h0
    3       R/W     RTC_TASK_RELOAD_CMP1_SUB_EN                                 1'h0
    4       R/W     RTC_TASK_RELOAD_CMP2_SUB_EN                                 1'h0
    5       R/W     RTC_TASK_RELOAD_CMP3_SUB_EN                                 1'h0
    15:6    R       RTC_SHOT_CTRL_RESERVED15_6                                  10'h0
    16      R/W     RTC_EVENT_CMP0_PUB_EN                                       1'h0
    17      R/W     RTC_EVENT_CMP1_PUB_EN                                       1'h0
    18      R/W     RTC_EVENT_CMP2_PUB_EN                                       1'h0
    19      R/W     RTC_EVENT_CMP3_PUB_EN                                       1'h0
    31:20   R       RTC_SHOT_CTRL_RESERVED31_20                                 12'h0
 */
typedef union _AON_REG_RTC_SHOT_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_TASK_STOP_SUB_EN: 1;
        uint32_t RTC_TASK_CLEAR_SUB_EN: 1;
        uint32_t RTC_TASK_RELOAD_CMP0_SUB_EN: 1;
        uint32_t RTC_TASK_RELOAD_CMP1_SUB_EN: 1;
        uint32_t RTC_TASK_RELOAD_CMP2_SUB_EN: 1;
        uint32_t RTC_TASK_RELOAD_CMP3_SUB_EN: 1;
        uint32_t RTC_SHOT_CTRL_RESERVED15_6: 10;
        uint32_t RTC_EVENT_CMP0_PUB_EN: 1;
        uint32_t RTC_EVENT_CMP1_PUB_EN: 1;
        uint32_t RTC_EVENT_CMP2_PUB_EN: 1;
        uint32_t RTC_EVENT_CMP3_PUB_EN: 1;
        uint32_t RTC_SHOT_CTRL_RESERVED31_20: 12;
    };
} AON_REG_RTC_SHOT_CTRL_TYPE;

/*0x4000_07b4 AON_REG_RTC_SHOT_CTRL*/
#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_STOP_SUB_EN_Pos                                                                   0U
#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_STOP_SUB_EN_Msk                                                                   (0x1UL << AON_REG_RTC_SHOT_CTRL_RTC_TASK_STOP_SUB_EN_Pos)

#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_CLEAR_SUB_EN_Pos                                                                  1U
#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_CLEAR_SUB_EN_Msk                                                                  (0x1UL << AON_REG_RTC_SHOT_CTRL_RTC_TASK_CLEAR_SUB_EN_Pos)

#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP0_SUB_EN_Pos                                                            2U
#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP0_SUB_EN_Msk                                                            (0x1UL << AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP0_SUB_EN_Pos)

#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP1_SUB_EN_Pos                                                            3U
#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP1_SUB_EN_Msk                                                            (0x1UL << AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP1_SUB_EN_Pos)

#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP2_SUB_EN_Pos                                                            4U
#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP2_SUB_EN_Msk                                                            (0x1UL << AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP2_SUB_EN_Pos)

#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP3_SUB_EN_Pos                                                            5U
#define AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP3_SUB_EN_Msk                                                            (0x1UL << AON_REG_RTC_SHOT_CTRL_RTC_TASK_RELOAD_CMP3_SUB_EN_Pos)

#define AON_REG_RTC_SHOT_CTRL_RTC_SHOT_CTRL_RESERVED15_6_Pos                                                             6U
#define AON_REG_RTC_SHOT_CTRL_RTC_SHOT_CTRL_RESERVED15_6_Msk                                                             (0x3FFUL << AON_REG_RTC_SHOT_CTRL_RTC_SHOT_CTRL_RESERVED15_6_Pos)

#define AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP0_PUB_EN_Pos                                                                  16U
#define AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP0_PUB_EN_Msk                                                                  (0x1UL << AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP0_PUB_EN_Pos)

#define AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP1_PUB_EN_Pos                                                                  17U
#define AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP1_PUB_EN_Msk                                                                  (0x1UL << AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP1_PUB_EN_Pos)

#define AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP2_PUB_EN_Pos                                                                  18U
#define AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP2_PUB_EN_Msk                                                                  (0x1UL << AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP2_PUB_EN_Pos)

#define AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP3_PUB_EN_Pos                                                                  19U
#define AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP3_PUB_EN_Msk                                                                  (0x1UL << AON_REG_RTC_SHOT_CTRL_RTC_EVENT_CMP3_PUB_EN_Pos)

#define AON_REG_RTC_SHOT_CTRL_RTC_SHOT_CTRL_RESERVED31_20_Pos                                                            20U
#define AON_REG_RTC_SHOT_CTRL_RTC_SHOT_CTRL_RESERVED31_20_Msk                                                            (0xFFFUL << AON_REG_RTC_SHOT_CTRL_RTC_SHOT_CTRL_RESERVED31_20_Pos)

/* 0x7B8    0x4000_07b8
    0       R/W     RTC_QACT_SCLK_MAN_DATA                                      1'h0
    1       R/W     RTC_QACT_SCLK_MAN_EN                                        1'h0
    2       R/W     RTC_QACT_PCLK_MAN_DATA                                      1'h0
    3       R/W     RTC_QACT_PCLK_MAN_EN                                        1'h0
    31:4    R       RTC_QACTIVE_CTRL_RESERVED31_4                               28'h0
 */
typedef union _AON_REG_RTC_QACTIVE_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RTC_QACT_SCLK_MAN_DATA: 1;
        uint32_t RTC_QACT_SCLK_MAN_EN: 1;
        uint32_t RTC_QACT_PCLK_MAN_DATA: 1;
        uint32_t RTC_QACT_PCLK_MAN_EN: 1;
        uint32_t RTC_QACTIVE_CTRL_RESERVED31_4: 28;
    };
} AON_REG_RTC_QACTIVE_CTRL_TYPE;

