rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_07b8 AON_REG_RTC_QACTIVE_CTRL*/
#define AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_SCLK_MAN_DATA_Pos                                                              0U
#define AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_SCLK_MAN_DATA_Msk                                                              (0x1UL << AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_SCLK_MAN_DATA_Pos)

#define AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_SCLK_MAN_EN_Pos                                                                1U
#define AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_SCLK_MAN_EN_Msk                                                                (0x1UL << AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_SCLK_MAN_EN_Pos)

#define AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_PCLK_MAN_DATA_Pos                                                              2U
#define AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_PCLK_MAN_DATA_Msk                                                              (0x1UL << AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_PCLK_MAN_DATA_Pos)

#define AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_PCLK_MAN_EN_Pos                                                                3U
#define AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_PCLK_MAN_EN_Msk                                                                (0x1UL << AON_REG_RTC_QACTIVE_CTRL_RTC_QACT_PCLK_MAN_EN_Pos)

#define AON_REG_RTC_QACTIVE_CTRL_RTC_QACTIVE_CTRL_RESERVED31_4_Pos                                                       4U
#define AON_REG_RTC_QACTIVE_CTRL_RTC_QACTIVE_CTRL_RESERVED31_4_Msk                                                       (0xFFFFFFFUL << AON_REG_RTC_QACTIVE_CTRL_RTC_QACTIVE_CTRL_RESERVED31_4_Pos)

/* 0x7C0    0x4000_07c0
    31:0    R       LPCOMP_VERSION                                              32'h20240329
 */
typedef union _AON_REG_LPC_VERSION_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPCOMP_VERSION;
    };
} AON_REG_LPC_VERSION_TYPE;

/*0x4000_07c0 AON_REG_LPC_VERSION*/
#define AON_REG_LPC_VERSION_LPCOMP_VERSION_Pos                                                                           0U
#define AON_REG_LPC_VERSION_LPCOMP_VERSION_Msk                                                                           (0xFFFFFFFFUL << AON_REG_LPC_VERSION_LPCOMP_VERSION_Pos)

/* 0x7C4    0x4000_07c4
    0       R/W     REG_LPCOMP_COUNTER_RST                                      1'h0
    1       R/W     REG_LPCOMP_COUNTER_START                                    1'h0
    2       R/WAC   REG_LPCOMP_FLAG_CLR                                         1'h0
    7:3     R       RESERVER080_7_3                                             5'h0
    8       R/W     REG_LPCOMP_IE                                               1'h0
    9       R/W     REG_LPCOMP_SRC_INT_EN                                       1'h0
    18:10   R/W     RESERVER080_18_10                                           9'h0
    19      R/W     REG_LPCOMP_SRC_AON_INT_EN                                   1'h0
    20      R/W     REG_LPCOMP_OUTPUT_EN                                        1'h0
    30:21   R       RESERVER080_30_21                                           10'h0
    31      R/W     LPC_RST                                                     1'h0
 */
typedef union _AON_REG_LPC_CR0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG_LPCOMP_COUNTER_RST: 1;
        uint32_t REG_LPCOMP_COUNTER_START: 1;
        uint32_t REG_LPCOMP_FLAG_CLR: 1;
        uint32_t RESERVER080_7_3: 5;
        uint32_t REG_LPCOMP_IE: 1;
        uint32_t REG_LPCOMP_SRC_INT_EN: 1;
        uint32_t RESERVER080_18_10: 9;
        uint32_t REG_LPCOMP_SRC_AON_INT_EN: 1;
        uint32_t REG_LPCOMP_OUTPUT_EN: 1;
        uint32_t RESERVER080_30_21: 10;
        uint32_t LPC_RST: 1;
    };
} AON_REG_LPC_CR0_TYPE;

/*0x4000_07c4 AON_REG_LPC_CR0*/
#define AON_REG_LPC_CR0_REG_LPCOMP_COUNTER_RST_Pos                                                                       0U
#define AON_REG_LPC_CR0_REG_LPCOMP_COUNTER_RST_Msk                                                                       (0x1UL << AON_REG_LPC_CR0_REG_LPCOMP_COUNTER_RST_Pos)

#define AON_REG_LPC_CR0_REG_LPCOMP_COUNTER_START_Pos                                                                     1U
#define AON_REG_LPC_CR0_REG_LPCOMP_COUNTER_START_Msk                                                                     (0x1UL << AON_REG_LPC_CR0_REG_LPCOMP_COUNTER_START_Pos)

#define AON_REG_LPC_CR0_REG_LPCOMP_FLAG_CLR_Pos                                                                          2U
#define AON_REG_LPC_CR0_REG_LPCOMP_FLAG_CLR_Msk                                                                          (0x1UL << AON_REG_LPC_CR0_REG_LPCOMP_FLAG_CLR_Pos)

#define AON_REG_LPC_CR0_RESERVER080_7_3_Pos                                                                              3U
#define AON_REG_LPC_CR0_RESERVER080_7_3_Msk                                                                              (0x1FUL << AON_REG_LPC_CR0_RESERVER080_7_3_Pos)

#define AON_REG_LPC_CR0_REG_LPCOMP_IE_Pos                                                                                8U
#define AON_REG_LPC_CR0_REG_LPCOMP_IE_Msk                                                                                (0x1UL << AON_REG_LPC_CR0_REG_LPCOMP_IE_Pos)

#define AON_REG_LPC_CR0_REG_LPCOMP_SRC_INT_EN_Pos                                                                        9U
#define AON_REG_LPC_CR0_REG_LPCOMP_SRC_INT_EN_Msk                                                                        (0x1UL << AON_REG_LPC_CR0_REG_LPCOMP_SRC_INT_EN_Pos)

#define AON_REG_LPC_CR0_RESERVER080_18_10_Pos                                                                            10U
#define AON_REG_LPC_CR0_RESERVER080_18_10_Msk                                                                            (0x1FFUL << AON_REG_LPC_CR0_RESERVER080_18_10_Pos)

#define AON_REG_LPC_CR0_REG_LPCOMP_SRC_AON_INT_EN_Pos                                                                    19U
#define AON_REG_LPC_CR0_REG_LPCOMP_SRC_AON_INT_EN_Msk                                                                    (0x1UL << AON_REG_LPC_CR0_REG_LPCOMP_SRC_AON_INT_EN_Pos)

#define AON_REG_LPC_CR0_REG_LPCOMP_OUTPUT_EN_Pos                                                                         20U
#define AON_REG_LPC_CR0_REG_LPCOMP_OUTPUT_EN_Msk                                                                         (0x1UL << AON_REG_LPC_CR0_REG_LPCOMP_OUTPUT_EN_Pos)

