rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_LPC_CR0_RESERVER080_30_21_Pos                                                                            21U
#define AON_REG_LPC_CR0_RESERVER080_30_21_Msk                                                                            (0x3FFUL << AON_REG_LPC_CR0_RESERVER080_30_21_Pos)

#define AON_REG_LPC_CR0_LPC_RST_Pos                                                                                      31U
#define AON_REG_LPC_CR0_LPC_RST_Msk                                                                                      (0x1UL << AON_REG_LPC_CR0_LPC_RST_Pos)

/* 0x7C8    0x4000_07c8
    0       R       REG_LPCOMP_FLAG                                             1'h0
    1       R       REG_LPCOMP_OUT_AON                                          1'h0
    31:2    R       RESERVER084_31_22                                           30'h0
 */
typedef union _AON_REG_LPC_SR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG_LPCOMP_FLAG: 1;
        uint32_t REG_LPCOMP_OUT_AON: 1;
        uint32_t RESERVER084_31_22: 30;
    };
} AON_REG_LPC_SR_TYPE;

/*0x4000_07c8 AON_REG_LPC_SR*/
#define AON_REG_LPC_SR_REG_LPCOMP_FLAG_Pos                                                                               0U
#define AON_REG_LPC_SR_REG_LPCOMP_FLAG_Msk                                                                               (0x1UL << AON_REG_LPC_SR_REG_LPCOMP_FLAG_Pos)

#define AON_REG_LPC_SR_REG_LPCOMP_OUT_AON_Pos                                                                            1U
#define AON_REG_LPC_SR_REG_LPCOMP_OUT_AON_Msk                                                                            (0x1UL << AON_REG_LPC_SR_REG_LPCOMP_OUT_AON_Pos)

#define AON_REG_LPC_SR_RESERVER084_31_22_Pos                                                                             2U
#define AON_REG_LPC_SR_RESERVER084_31_22_Msk                                                                             (0x3FFFFFFFUL << AON_REG_LPC_SR_RESERVER084_31_22_Pos)

/* 0x7CC    0x4000_07cc
    11:0    R/W     REG_LPCOMP_COMP                                             0x0
    31:12   R       RESERVER088_31_12                                           20'h0
 */
typedef union _AON_REG_LPC_CMP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG_LPCOMP_COMP: 12;
        uint32_t RESERVER088_31_12: 20;
    };
} AON_REG_LPC_CMP_TYPE;

/*0x4000_07cc AON_REG_LPC_CMP*/
#define AON_REG_LPC_CMP_REG_LPCOMP_COMP_Pos                                                                              0U
#define AON_REG_LPC_CMP_REG_LPCOMP_COMP_Msk                                                                              (0xFFFUL << AON_REG_LPC_CMP_REG_LPCOMP_COMP_Pos)

#define AON_REG_LPC_CMP_RESERVER088_31_12_Pos                                                                            12U
#define AON_REG_LPC_CMP_RESERVER088_31_12_Msk                                                                            (0xFFFFFUL << AON_REG_LPC_CMP_RESERVER088_31_12_Pos)

/* 0x7D0    0x4000_07d0
    11:0    R       REG_LPCOMP_COUNTER                                          12'h0
    31:12   R       RESERVER08C_31_12                                           20'h0
 */
typedef union _AON_REG_LPC_CNT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG_LPCOMP_COUNTER: 12;
        uint32_t RESERVER08C_31_12: 20;
    };
} AON_REG_LPC_CNT_TYPE;

/*0x4000_07d0 AON_REG_LPC_CNT*/
#define AON_REG_LPC_CNT_REG_LPCOMP_COUNTER_Pos                                                                           0U
#define AON_REG_LPC_CNT_REG_LPCOMP_COUNTER_Msk                                                                           (0xFFFUL << AON_REG_LPC_CNT_REG_LPCOMP_COUNTER_Pos)

#define AON_REG_LPC_CNT_RESERVER08C_31_12_Pos                                                                            12U
#define AON_REG_LPC_CNT_RESERVER08C_31_12_Msk                                                                            (0xFFFFFUL << AON_REG_LPC_CNT_RESERVER08C_31_12_Pos)

/* 0x7D4    0x4000_07d4
    0       R/W     LPC_RAP_MODE                                                1'h0
    1       R/WAC   LPC_FW_TASK_START                                           1'h0
    2       R/WAC   LPC_FW_TASK_STOP                                            1'h0
    31:3    R       RESERVER090_31_3                                            29'h0
 */
typedef union _AON_REG_LPC_TASK_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPC_RAP_MODE: 1;
        uint32_t LPC_FW_TASK_START: 1;
        uint32_t LPC_FW_TASK_STOP: 1;
        uint32_t RESERVER090_31_3: 29;
    };
} AON_REG_LPC_TASK_CTRL_TYPE;

/*0x4000_07d4 AON_REG_LPC_TASK_CTRL*/
#define AON_REG_LPC_TASK_CTRL_LPC_RAP_MODE_Pos                                                                           0U
#define AON_REG_LPC_TASK_CTRL_LPC_RAP_MODE_Msk                                                                           (0x1UL << AON_REG_LPC_TASK_CTRL_LPC_RAP_MODE_Pos)

#define AON_REG_LPC_TASK_CTRL_LPC_FW_TASK_START_Pos                                                                      1U
#define AON_REG_LPC_TASK_CTRL_LPC_FW_TASK_START_Msk                                                                      (0x1UL << AON_REG_LPC_TASK_CTRL_LPC_FW_TASK_START_Pos)

#define AON_REG_LPC_TASK_CTRL_LPC_FW_TASK_STOP_Pos                                                                       2U
#define AON_REG_LPC_TASK_CTRL_LPC_FW_TASK_STOP_Msk                                                                       (0x1UL << AON_REG_LPC_TASK_CTRL_LPC_FW_TASK_STOP_Pos)

#define AON_REG_LPC_TASK_CTRL_RESERVER090_31_3_Pos                                                                       3U
#define AON_REG_LPC_TASK_CTRL_RESERVER090_31_3_Msk                                                                       (0x1FFFFFFFUL << AON_REG_LPC_TASK_CTRL_RESERVER090_31_3_Pos)

/* 0x7D8    0x4000_07d8
    0       R/W     LPC_TASK_STOP_SUB_EN                                        1'h0
    15:1    R       RESERVER094_15_1                                            15'h0
    16      R/W     LPC_EVENT_STATUS_PUB_EN                                     1'h0
    31:17   R       RESERVER094_31_17                                           15'h0
 */
typedef union _AON_REG_LPC_SHOT_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPC_TASK_STOP_SUB_EN: 1;
        uint32_t RESERVER094_15_1: 15;
        uint32_t LPC_EVENT_STATUS_PUB_EN: 1;
        uint32_t RESERVER094_31_17: 15;
    };
} AON_REG_LPC_SHOT_CTRL_TYPE;

/*0x4000_07d8 AON_REG_LPC_SHOT_CTRL*/
#define AON_REG_LPC_SHOT_CTRL_LPC_TASK_STOP_SUB_EN_Pos                                                                   0U
#define AON_REG_LPC_SHOT_CTRL_LPC_TASK_STOP_SUB_EN_Msk                                                                   (0x1UL << AON_REG_LPC_SHOT_CTRL_LPC_TASK_STOP_SUB_EN_Pos)

#define AON_REG_LPC_SHOT_CTRL_RESERVER094_15_1_Pos                                                                       1U
#define AON_REG_LPC_SHOT_CTRL_RESERVER094_15_1_Msk                                                                       (0x7FFFUL << AON_REG_LPC_SHOT_CTRL_RESERVER094_15_1_Pos)

#define AON_REG_LPC_SHOT_CTRL_LPC_EVENT_STATUS_PUB_EN_Pos                                                                16U
#define AON_REG_LPC_SHOT_CTRL_LPC_EVENT_STATUS_PUB_EN_Msk                                                                (0x1UL << AON_REG_LPC_SHOT_CTRL_LPC_EVENT_STATUS_PUB_EN_Pos)

#define AON_REG_LPC_SHOT_CTRL_RESERVER094_31_17_Pos                                                                      17U
#define AON_REG_LPC_SHOT_CTRL_RESERVER094_31_17_Msk                                                                      (0x7FFFUL << AON_REG_LPC_SHOT_CTRL_RESERVER094_31_17_Pos)

/* 0x7DC    0x4000_07dc
    0       R/W     LPC_QACT_SCLK_MAN_DATA                                      1'h0
    1       R/W     LPC_QACT_SCLK_MAN_EN                                        1'h0
    2       R/W     LPC_QACT_PCLK_MAN_DATA                                      1'h0
    3       R/W     LPC_QACT_PCLK_MAN_EN                                        1'h0
    31:4    R       RESERVER098_31_4                                            28'h0
 */
typedef union _AON_REG_LPC_QACTIVE_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPC_QACT_SCLK_MAN_DATA: 1;
        uint32_t LPC_QACT_SCLK_MAN_EN: 1;
        uint32_t LPC_QACT_PCLK_MAN_DATA: 1;
        uint32_t LPC_QACT_PCLK_MAN_EN: 1;
        uint32_t RESERVER098_31_4: 28;
    };
} AON_REG_LPC_QACTIVE_CTRL_TYPE;

