rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_07dc AON_REG_LPC_QACTIVE_CTRL*/
#define AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_SCLK_MAN_DATA_Pos                                                              0U
#define AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_SCLK_MAN_DATA_Msk                                                              (0x1UL << AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_SCLK_MAN_DATA_Pos)

#define AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_SCLK_MAN_EN_Pos                                                                1U
#define AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_SCLK_MAN_EN_Msk                                                                (0x1UL << AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_SCLK_MAN_EN_Pos)

#define AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_PCLK_MAN_DATA_Pos                                                              2U
#define AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_PCLK_MAN_DATA_Msk                                                              (0x1UL << AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_PCLK_MAN_DATA_Pos)

#define AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_PCLK_MAN_EN_Pos                                                                3U
#define AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_PCLK_MAN_EN_Msk                                                                (0x1UL << AON_REG_LPC_QACTIVE_CTRL_LPC_QACT_PCLK_MAN_EN_Pos)

#define AON_REG_LPC_QACTIVE_CTRL_RESERVER098_31_4_Pos                                                                    4U
#define AON_REG_LPC_QACTIVE_CTRL_RESERVER098_31_4_Msk                                                                    (0xFFFFFFFUL << AON_REG_LPC_QACTIVE_CTRL_RESERVER098_31_4_Pos)

/* 0x7E0    0x4000_07e0
    0       R/W     POW_SD_H                                                    1'h0
    4:1     R/W     CH_NUM_H                                                    4'h0
    5       R/W     SD_POSEDGE_H                                                1'h1
    6       R/W     EN_HYS                                                      1'h0
    7       R/W     EN_BYP                                                      1'h0
    8       R       EN_AD_LPC_COMP_OUT_DBG                                      1'b0
    31:9    R       RESERVER094_31_9                                            23'h0
 */
typedef union _AON_REG0X_SD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t POW_SD_H: 1;
        uint32_t CH_NUM_H: 4;
        uint32_t SD_POSEDGE_H: 1;
        uint32_t EN_HYS: 1;
        uint32_t EN_BYP: 1;
        uint32_t EN_AD_LPC_COMP_OUT_DBG: 1;
        uint32_t RESERVER094_31_9: 23;
    };
} AON_REG0X_SD_TYPE;

/*0x4000_07e0 AON_REG0X_SD*/
#define AON_REG0X_SD_POW_SD_H_Pos                                                                                        0U
#define AON_REG0X_SD_POW_SD_H_Msk                                                                                        (0x1UL << AON_REG0X_SD_POW_SD_H_Pos)

#define AON_REG0X_SD_CH_NUM_H_Pos                                                                                        1U
#define AON_REG0X_SD_CH_NUM_H_Msk                                                                                        (0xFUL << AON_REG0X_SD_CH_NUM_H_Pos)

#define AON_REG0X_SD_SD_POSEDGE_H_Pos                                                                                    5U
#define AON_REG0X_SD_SD_POSEDGE_H_Msk                                                                                    (0x1UL << AON_REG0X_SD_SD_POSEDGE_H_Pos)

#define AON_REG0X_SD_EN_HYS_Pos                                                                                          6U
#define AON_REG0X_SD_EN_HYS_Msk                                                                                          (0x1UL << AON_REG0X_SD_EN_HYS_Pos)

#define AON_REG0X_SD_EN_BYP_Pos                                                                                          7U
#define AON_REG0X_SD_EN_BYP_Msk                                                                                          (0x1UL << AON_REG0X_SD_EN_BYP_Pos)

#define AON_REG0X_SD_EN_AD_LPC_COMP_OUT_DBG_Pos                                                                          8U
#define AON_REG0X_SD_EN_AD_LPC_COMP_OUT_DBG_Msk                                                                          (0x1UL << AON_REG0X_SD_EN_AD_LPC_COMP_OUT_DBG_Pos)

#define AON_REG0X_SD_RESERVER094_31_9_Pos                                                                                9U
#define AON_REG0X_SD_RESERVER094_31_9_Msk                                                                                (0x7FFFFFUL << AON_REG0X_SD_RESERVER094_31_9_Pos)

/* 0x7E4    0x4000_07e4
    3:0     R/W     X_SCAN_DIV                                                  4'h0
    31:4    R       REG_LPQDEC_X_DIV_RESERVED31_4                               28'h0
 */
typedef union _AON_REG_LPQDEC_X_DIV_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t X_SCAN_DIV: 4;
        uint32_t REG_LPQDEC_X_DIV_RESERVED31_4: 28;
    };
} AON_REG_LPQDEC_X_DIV_TYPE;

/*0x4000_07e4 AON_REG_LPQDEC_X_DIV*/
#define AON_REG_LPQDEC_X_DIV_X_SCAN_DIV_Pos                                                                              0U
#define AON_REG_LPQDEC_X_DIV_X_SCAN_DIV_Msk                                                                              (0xFUL << AON_REG_LPQDEC_X_DIV_X_SCAN_DIV_Pos)

#define AON_REG_LPQDEC_X_DIV_REG_LPQDEC_X_DIV_RESERVED31_4_Pos                                                           4U
#define AON_REG_LPQDEC_X_DIV_REG_LPQDEC_X_DIV_RESERVED31_4_Msk                                                           (0xFFFFFFFUL << AON_REG_LPQDEC_X_DIV_REG_LPQDEC_X_DIV_RESERVED31_4_Pos)

/* 0x7E8    0x4000_07e8
    1:0     R/W     X_INITIAL_PHASE                                             2'h0
    2       R/W     X_SET_INITAL_PHASE                                          1'h0
    3       R/W     X_CNT_PAUSE                                                 1'h0
    4       R/W     X_CNT_SCALE                                                 1'h0
    5       R/W     X_ILLEGAL_INT_EN                                            1'h0
    6       R/W     X_CNT_INT_EN                                                1'h0
    7       R/W     X_ILLEGAL_INT_MASK                                          1'h1
    8       R/W     X_CNT_INT_MASK                                              1'h1
    21:9    R/W     X_DEBOUNCE_CNT                                              13'h0
    22      R/W     X_DEBOUNCE_EN                                               1'h0
    23      R/W     X_WAKE_AON_MASK                                             1'b1
    24      R/W     X_INT_MASK                                                  1'b1
    28:25   R       REG_LPQDEC_X_CONFIG_RESERVED28_25                           4'b0
    29      R/W     X_RST                                                       1'b0
    30      R/WAC   X_FSM_EN                                                    1'h0
    31      R/W     X_AXIS_EN                                                   1'h0
 */
typedef union _AON_REG_LPQDEC_X_CONFIG_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t X_INITIAL_PHASE: 2;
        uint32_t X_SET_INITAL_PHASE: 1;
        uint32_t X_CNT_PAUSE: 1;
        uint32_t X_CNT_SCALE: 1;
        uint32_t X_ILLEGAL_INT_EN: 1;
        uint32_t X_CNT_INT_EN: 1;
        uint32_t X_ILLEGAL_INT_MASK: 1;
        uint32_t X_CNT_INT_MASK: 1;
        uint32_t X_DEBOUNCE_CNT: 13;
        uint32_t X_DEBOUNCE_EN: 1;
        uint32_t X_WAKE_AON_MASK: 1;
        uint32_t X_INT_MASK: 1;
        uint32_t REG_LPQDEC_X_CONFIG_RESERVED28_25: 4;
        uint32_t X_RST: 1;
        uint32_t X_FSM_EN: 1;
        uint32_t X_AXIS_EN: 1;
    };
} AON_REG_LPQDEC_X_CONFIG_TYPE;

/*0x4000_07e8 AON_REG_LPQDEC_X_CONFIG*/
#define AON_REG_LPQDEC_X_CONFIG_X_INITIAL_PHASE_Pos                                                                      0U
#define AON_REG_LPQDEC_X_CONFIG_X_INITIAL_PHASE_Msk                                                                      (0x3UL << AON_REG_LPQDEC_X_CONFIG_X_INITIAL_PHASE_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_SET_INITAL_PHASE_Pos                                                                   2U
#define AON_REG_LPQDEC_X_CONFIG_X_SET_INITAL_PHASE_Msk                                                                   (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_SET_INITAL_PHASE_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_CNT_PAUSE_Pos                                                                          3U
#define AON_REG_LPQDEC_X_CONFIG_X_CNT_PAUSE_Msk                                                                          (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_CNT_PAUSE_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_CNT_SCALE_Pos                                                                          4U
#define AON_REG_LPQDEC_X_CONFIG_X_CNT_SCALE_Msk                                                                          (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_CNT_SCALE_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_ILLEGAL_INT_EN_Pos                                                                     5U
#define AON_REG_LPQDEC_X_CONFIG_X_ILLEGAL_INT_EN_Msk                                                                     (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_ILLEGAL_INT_EN_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_CNT_INT_EN_Pos                                                                         6U
#define AON_REG_LPQDEC_X_CONFIG_X_CNT_INT_EN_Msk                                                                         (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_CNT_INT_EN_Pos)

