rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_LPQDEC_X_CONFIG_X_ILLEGAL_INT_MASK_Pos                                                                   7U
#define AON_REG_LPQDEC_X_CONFIG_X_ILLEGAL_INT_MASK_Msk                                                                   (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_ILLEGAL_INT_MASK_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_CNT_INT_MASK_Pos                                                                       8U
#define AON_REG_LPQDEC_X_CONFIG_X_CNT_INT_MASK_Msk                                                                       (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_CNT_INT_MASK_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_DEBOUNCE_CNT_Pos                                                                       9U
#define AON_REG_LPQDEC_X_CONFIG_X_DEBOUNCE_CNT_Msk                                                                       (0x1FFFUL << AON_REG_LPQDEC_X_CONFIG_X_DEBOUNCE_CNT_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_DEBOUNCE_EN_Pos                                                                        22U
#define AON_REG_LPQDEC_X_CONFIG_X_DEBOUNCE_EN_Msk                                                                        (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_DEBOUNCE_EN_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_WAKE_AON_MASK_Pos                                                                      23U
#define AON_REG_LPQDEC_X_CONFIG_X_WAKE_AON_MASK_Msk                                                                      (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_WAKE_AON_MASK_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_INT_MASK_Pos                                                                           24U
#define AON_REG_LPQDEC_X_CONFIG_X_INT_MASK_Msk                                                                           (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_INT_MASK_Pos)

#define AON_REG_LPQDEC_X_CONFIG_REG_LPQDEC_X_CONFIG_RESERVED28_25_Pos                                                    25U
#define AON_REG_LPQDEC_X_CONFIG_REG_LPQDEC_X_CONFIG_RESERVED28_25_Msk                                                    (0xFUL << AON_REG_LPQDEC_X_CONFIG_REG_LPQDEC_X_CONFIG_RESERVED28_25_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_RST_Pos                                                                                29U
#define AON_REG_LPQDEC_X_CONFIG_X_RST_Msk                                                                                (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_RST_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_FSM_EN_Pos                                                                             30U
#define AON_REG_LPQDEC_X_CONFIG_X_FSM_EN_Msk                                                                             (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_FSM_EN_Pos)

#define AON_REG_LPQDEC_X_CONFIG_X_AXIS_EN_Pos                                                                            31U
#define AON_REG_LPQDEC_X_CONFIG_X_AXIS_EN_Msk                                                                            (0x1UL << AON_REG_LPQDEC_X_CONFIG_X_AXIS_EN_Pos)

/* 0x7EC    0x4000_07ec
    15:0    R       REG_LPQDEC_X_SR_1_RESERVED15_0                              16'h0
    16      R       X_CNT_OF_FLG                                                1'h0
    17      R       X_CNT_UF_FLG                                                1'h0
    18      R       X_CNT_INT_STA                                               1'h0
    19      R       X_ILLEGAL_INT_STA                                           1'h0
    20      R       X_CNT_DIR                                                   1'h0
    21      R       X_PHA_STA                                                   1'h0
    22      R       X_PHB_STA                                                   1'h0
    31:23   R       REG_LPQDEC_X_SR_1_RESERVED31_23                             9'h0
 */
typedef union _AON_REG_LPQDEC_X_SR_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t REG_LPQDEC_X_SR_1_RESERVED15_0: 16;
        uint32_t X_CNT_OF_FLG: 1;
        uint32_t X_CNT_UF_FLG: 1;
        uint32_t X_CNT_INT_STA: 1;
        uint32_t X_ILLEGAL_INT_STA: 1;
        uint32_t X_CNT_DIR: 1;
        uint32_t X_PHA_STA: 1;
        uint32_t X_PHB_STA: 1;
        uint32_t REG_LPQDEC_X_SR_1_RESERVED31_23: 9;
    };
} AON_REG_LPQDEC_X_SR_1_TYPE;

/*0x4000_07ec AON_REG_LPQDEC_X_SR_1*/
#define AON_REG_LPQDEC_X_SR_1_REG_LPQDEC_X_SR_1_RESERVED15_0_Pos                                                         0U
#define AON_REG_LPQDEC_X_SR_1_REG_LPQDEC_X_SR_1_RESERVED15_0_Msk                                                         (0xFFFFUL << AON_REG_LPQDEC_X_SR_1_REG_LPQDEC_X_SR_1_RESERVED15_0_Pos)

#define AON_REG_LPQDEC_X_SR_1_X_CNT_OF_FLG_Pos                                                                           16U
#define AON_REG_LPQDEC_X_SR_1_X_CNT_OF_FLG_Msk                                                                           (0x1UL << AON_REG_LPQDEC_X_SR_1_X_CNT_OF_FLG_Pos)

#define AON_REG_LPQDEC_X_SR_1_X_CNT_UF_FLG_Pos                                                                           17U
#define AON_REG_LPQDEC_X_SR_1_X_CNT_UF_FLG_Msk                                                                           (0x1UL << AON_REG_LPQDEC_X_SR_1_X_CNT_UF_FLG_Pos)

#define AON_REG_LPQDEC_X_SR_1_X_CNT_INT_STA_Pos                                                                          18U
#define AON_REG_LPQDEC_X_SR_1_X_CNT_INT_STA_Msk                                                                          (0x1UL << AON_REG_LPQDEC_X_SR_1_X_CNT_INT_STA_Pos)

#define AON_REG_LPQDEC_X_SR_1_X_ILLEGAL_INT_STA_Pos                                                                      19U
#define AON_REG_LPQDEC_X_SR_1_X_ILLEGAL_INT_STA_Msk                                                                      (0x1UL << AON_REG_LPQDEC_X_SR_1_X_ILLEGAL_INT_STA_Pos)

#define AON_REG_LPQDEC_X_SR_1_X_CNT_DIR_Pos                                                                              20U
#define AON_REG_LPQDEC_X_SR_1_X_CNT_DIR_Msk                                                                              (0x1UL << AON_REG_LPQDEC_X_SR_1_X_CNT_DIR_Pos)

