rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_LPQDEC_X_SR_1_X_PHA_STA_Pos                                                                              21U
#define AON_REG_LPQDEC_X_SR_1_X_PHA_STA_Msk                                                                              (0x1UL << AON_REG_LPQDEC_X_SR_1_X_PHA_STA_Pos)

#define AON_REG_LPQDEC_X_SR_1_X_PHB_STA_Pos                                                                              22U
#define AON_REG_LPQDEC_X_SR_1_X_PHB_STA_Msk                                                                              (0x1UL << AON_REG_LPQDEC_X_SR_1_X_PHB_STA_Pos)

#define AON_REG_LPQDEC_X_SR_1_REG_LPQDEC_X_SR_1_RESERVED31_23_Pos                                                        23U
#define AON_REG_LPQDEC_X_SR_1_REG_LPQDEC_X_SR_1_RESERVED31_23_Msk                                                        (0x1FFUL << AON_REG_LPQDEC_X_SR_1_REG_LPQDEC_X_SR_1_RESERVED31_23_Pos)

/* 0x7F0    0x4000_07f0
    15:0    R       X_ACC_CNT                                                   16'h0
    21:16   R       REG_LPQDEC_X_SR_2_RESERVED21                                6'h0
    23:22   R       X_DEBUG_STATE_X                                             2'h0
    31:24   R       X_DEBUG_ILLEGAL_COUNTER_X                                   8'h0
 */
typedef union _AON_REG_LPQDEC_X_SR_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t X_ACC_CNT: 16;
        uint32_t REG_LPQDEC_X_SR_2_RESERVED21: 6;
        uint32_t X_DEBUG_STATE_X: 2;
        uint32_t X_DEBUG_ILLEGAL_COUNTER_X: 8;
    };
} AON_REG_LPQDEC_X_SR_2_TYPE;

/*0x4000_07f0 AON_REG_LPQDEC_X_SR_2*/
#define AON_REG_LPQDEC_X_SR_2_X_ACC_CNT_Pos                                                                              0U
#define AON_REG_LPQDEC_X_SR_2_X_ACC_CNT_Msk                                                                              (0xFFFFUL << AON_REG_LPQDEC_X_SR_2_X_ACC_CNT_Pos)

#define AON_REG_LPQDEC_X_SR_2_REG_LPQDEC_X_SR_2_RESERVED21_Pos                                                           16U
#define AON_REG_LPQDEC_X_SR_2_REG_LPQDEC_X_SR_2_RESERVED21_Msk                                                           (0x3FUL << AON_REG_LPQDEC_X_SR_2_REG_LPQDEC_X_SR_2_RESERVED21_Pos)

#define AON_REG_LPQDEC_X_SR_2_X_DEBUG_STATE_X_Pos                                                                        22U
#define AON_REG_LPQDEC_X_SR_2_X_DEBUG_STATE_X_Msk                                                                        (0x3UL << AON_REG_LPQDEC_X_SR_2_X_DEBUG_STATE_X_Pos)

#define AON_REG_LPQDEC_X_SR_2_X_DEBUG_ILLEGAL_COUNTER_X_Pos                                                              24U
#define AON_REG_LPQDEC_X_SR_2_X_DEBUG_ILLEGAL_COUNTER_X_Msk                                                              (0xFFUL << AON_REG_LPQDEC_X_SR_2_X_DEBUG_ILLEGAL_COUNTER_X_Pos)

/* 0x7F4    0x4000_07f4
    0       R/WAC   X_ACC_CNT_CLR                                               1'h0
    1       R/WAC   X_CNT_INT_CLR                                               1'h0
    2       R/WAC   X_OF_FLG_CLR                                                1'h0
    3       R/WAC   X_UF_FLG_CLR                                                1'h0
    4       R/WAC   X_ILLEGAL_INT_CLR                                           1'h0
    5       R/WAC   X_ILLEGAL_CNT_CLR                                           1'h0
    31:6    R       REG_INT_CLR_RESERVED31_6                                    26'h0
 */
typedef union _AON_REG_LPQDEC_X_INT_CLR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t X_ACC_CNT_CLR: 1;
        uint32_t X_CNT_INT_CLR: 1;
        uint32_t X_OF_FLG_CLR: 1;
        uint32_t X_UF_FLG_CLR: 1;
        uint32_t X_ILLEGAL_INT_CLR: 1;
        uint32_t X_ILLEGAL_CNT_CLR: 1;
        uint32_t REG_INT_CLR_RESERVED31_6: 26;
    };
} AON_REG_LPQDEC_X_INT_CLR_TYPE;

/*0x4000_07f4 AON_REG_LPQDEC_X_INT_CLR*/
#define AON_REG_LPQDEC_X_INT_CLR_X_ACC_CNT_CLR_Pos                                                                       0U
#define AON_REG_LPQDEC_X_INT_CLR_X_ACC_CNT_CLR_Msk                                                                       (0x1UL << AON_REG_LPQDEC_X_INT_CLR_X_ACC_CNT_CLR_Pos)

#define AON_REG_LPQDEC_X_INT_CLR_X_CNT_INT_CLR_Pos                                                                       1U
#define AON_REG_LPQDEC_X_INT_CLR_X_CNT_INT_CLR_Msk                                                                       (0x1UL << AON_REG_LPQDEC_X_INT_CLR_X_CNT_INT_CLR_Pos)

#define AON_REG_LPQDEC_X_INT_CLR_X_OF_FLG_CLR_Pos                                                                        2U
#define AON_REG_LPQDEC_X_INT_CLR_X_OF_FLG_CLR_Msk                                                                        (0x1UL << AON_REG_LPQDEC_X_INT_CLR_X_OF_FLG_CLR_Pos)

#define AON_REG_LPQDEC_X_INT_CLR_X_UF_FLG_CLR_Pos                                                                        3U
#define AON_REG_LPQDEC_X_INT_CLR_X_UF_FLG_CLR_Msk                                                                        (0x1UL << AON_REG_LPQDEC_X_INT_CLR_X_UF_FLG_CLR_Pos)

#define AON_REG_LPQDEC_X_INT_CLR_X_ILLEGAL_INT_CLR_Pos                                                                   4U
#define AON_REG_LPQDEC_X_INT_CLR_X_ILLEGAL_INT_CLR_Msk                                                                   (0x1UL << AON_REG_LPQDEC_X_INT_CLR_X_ILLEGAL_INT_CLR_Pos)

#define AON_REG_LPQDEC_X_INT_CLR_X_ILLEGAL_CNT_CLR_Pos                                                                   5U
#define AON_REG_LPQDEC_X_INT_CLR_X_ILLEGAL_CNT_CLR_Msk                                                                   (0x1UL << AON_REG_LPQDEC_X_INT_CLR_X_ILLEGAL_CNT_CLR_Pos)

#define AON_REG_LPQDEC_X_INT_CLR_REG_INT_CLR_RESERVED31_6_Pos                                                            6U
#define AON_REG_LPQDEC_X_INT_CLR_REG_INT_CLR_RESERVED31_6_Msk                                                            (0x3FFFFFFUL << AON_REG_LPQDEC_X_INT_CLR_REG_INT_CLR_RESERVED31_6_Pos)

/* 0x7F8    0x4000_07f8
    31:0    R       LPQDEC_X_VERSION                                            32'h20240329
 */
typedef union _AON_REG_LPQDEC_X_VERSION_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPQDEC_X_VERSION;
    };
} AON_REG_LPQDEC_X_VERSION_TYPE;

/*0x4000_07f8 AON_REG_LPQDEC_X_VERSION*/
#define AON_REG_LPQDEC_X_VERSION_LPQDEC_X_VERSION_Pos                                                                    0U
#define AON_REG_LPQDEC_X_VERSION_LPQDEC_X_VERSION_Msk                                                                    (0xFFFFFFFFUL << AON_REG_LPQDEC_X_VERSION_LPQDEC_X_VERSION_Pos)

