rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x7FC    0x4000_07fc
    0       R/W     X_LED_EN                                                    1'h0
    1       R/W     X_LEDPOL                                                    1'h0
    4:2     R/W     X_LEDPRE                                                    3'h0
    31:5    R       REG_LPQDEC_X_LED_CTRL_RESERVED31_5                          27'h0
 */
typedef union _AON_REG_LPQDEC_X_LED_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t X_LED_EN: 1;
        uint32_t X_LEDPOL: 1;
        uint32_t X_LEDPRE: 3;
        uint32_t REG_LPQDEC_X_LED_CTRL_RESERVED31_5: 27;
    };
} AON_REG_LPQDEC_X_LED_CTRL_TYPE;

/*0x4000_07fc AON_REG_LPQDEC_X_LED_CTRL*/
#define AON_REG_LPQDEC_X_LED_CTRL_X_LED_EN_Pos                                                                           0U
#define AON_REG_LPQDEC_X_LED_CTRL_X_LED_EN_Msk                                                                           (0x1UL << AON_REG_LPQDEC_X_LED_CTRL_X_LED_EN_Pos)

#define AON_REG_LPQDEC_X_LED_CTRL_X_LEDPOL_Pos                                                                           1U
#define AON_REG_LPQDEC_X_LED_CTRL_X_LEDPOL_Msk                                                                           (0x1UL << AON_REG_LPQDEC_X_LED_CTRL_X_LEDPOL_Pos)

#define AON_REG_LPQDEC_X_LED_CTRL_X_LEDPRE_Pos                                                                           2U
#define AON_REG_LPQDEC_X_LED_CTRL_X_LEDPRE_Msk                                                                           (0x7UL << AON_REG_LPQDEC_X_LED_CTRL_X_LEDPRE_Pos)

#define AON_REG_LPQDEC_X_LED_CTRL_REG_LPQDEC_X_LED_CTRL_RESERVED31_5_Pos                                                 5U
#define AON_REG_LPQDEC_X_LED_CTRL_REG_LPQDEC_X_LED_CTRL_RESERVED31_5_Msk                                                 (0x7FFFFFFUL << AON_REG_LPQDEC_X_LED_CTRL_REG_LPQDEC_X_LED_CTRL_RESERVED31_5_Pos)

/* 0x800    0x4000_0800
    0       R/W     LPQDEC_X_QACT_SCLK_MAN_DATA                                 1'h0
    1       R/W     LPQDEC_X_QACT_SCLK_MAN_EN                                   1'h0
    2       R/W     LPQDEC_X_QACT_PCLK_MAN_DATA                                 1'h0
    3       R/W     LPQDEC_X_QACT_PCLK_MAN_EN                                   1'h0
    31:4    R       REG_QACTIVE_CTRL_RESERVED31_4                               28'h0
 */
typedef union _AON_REG_LPQDEC_X_QACTIVE_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPQDEC_X_QACT_SCLK_MAN_DATA: 1;
        uint32_t LPQDEC_X_QACT_SCLK_MAN_EN: 1;
        uint32_t LPQDEC_X_QACT_PCLK_MAN_DATA: 1;
        uint32_t LPQDEC_X_QACT_PCLK_MAN_EN: 1;
        uint32_t REG_QACTIVE_CTRL_RESERVED31_4: 28;
    };
} AON_REG_LPQDEC_X_QACTIVE_CTRL_TYPE;

/*0x4000_0800 AON_REG_LPQDEC_X_QACTIVE_CTRL*/
#define AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_SCLK_MAN_DATA_Pos                                                    0U
#define AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_SCLK_MAN_DATA_Msk                                                    (0x1UL << AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_SCLK_MAN_DATA_Pos)

#define AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_SCLK_MAN_EN_Pos                                                      1U
#define AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_SCLK_MAN_EN_Msk                                                      (0x1UL << AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_SCLK_MAN_EN_Pos)

#define AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_PCLK_MAN_DATA_Pos                                                    2U
#define AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_PCLK_MAN_DATA_Msk                                                    (0x1UL << AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_PCLK_MAN_DATA_Pos)

#define AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_PCLK_MAN_EN_Pos                                                      3U
#define AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_PCLK_MAN_EN_Msk                                                      (0x1UL << AON_REG_LPQDEC_X_QACTIVE_CTRL_LPQDEC_X_QACT_PCLK_MAN_EN_Pos)

#define AON_REG_LPQDEC_X_QACTIVE_CTRL_REG_QACTIVE_CTRL_RESERVED31_4_Pos                                                  4U
#define AON_REG_LPQDEC_X_QACTIVE_CTRL_REG_QACTIVE_CTRL_RESERVED31_4_Msk                                                  (0xFFFFFFFUL << AON_REG_LPQDEC_X_QACTIVE_CTRL_REG_QACTIVE_CTRL_RESERVED31_4_Pos)

/* 0x80C    0x4000_080c
    0       R/W     LPPWM_CH0_REG_RST_N                                         1'h0
    1       R/W     LPPWM_CH0_EN                                                1'h0
    2       R/W     LPPWM_CH0_POLARITY                                          1'h0
    31:3    R       RSVD                                                        29'h0
 */
typedef union _AON_REG_LPPWM_CH0_CTL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPPWM_CH0_REG_RST_N: 1;
        uint32_t LPPWM_CH0_EN: 1;
        uint32_t LPPWM_CH0_POLARITY: 1;
        uint32_t RSVD: 29;
    };
} AON_REG_LPPWM_CH0_CTL_TYPE;

/*0x4000_080c AON_REG_LPPWM_CH0_CTL*/
#define AON_REG_LPPWM_CH0_CTL_LPPWM_CH0_REG_RST_N_Pos                                                                    0U
#define AON_REG_LPPWM_CH0_CTL_LPPWM_CH0_REG_RST_N_Msk                                                                    (0x1UL << AON_REG_LPPWM_CH0_CTL_LPPWM_CH0_REG_RST_N_Pos)

#define AON_REG_LPPWM_CH0_CTL_LPPWM_CH0_EN_Pos                                                                           1U
#define AON_REG_LPPWM_CH0_CTL_LPPWM_CH0_EN_Msk                                                                           (0x1UL << AON_REG_LPPWM_CH0_CTL_LPPWM_CH0_EN_Pos)

#define AON_REG_LPPWM_CH0_CTL_LPPWM_CH0_POLARITY_Pos                                                                     2U
#define AON_REG_LPPWM_CH0_CTL_LPPWM_CH0_POLARITY_Msk                                                                     (0x1UL << AON_REG_LPPWM_CH0_CTL_LPPWM_CH0_POLARITY_Pos)

#define AON_REG_LPPWM_CH0_CTL_RSVD_Pos                                                                                   3U
#define AON_REG_LPPWM_CH0_CTL_RSVD_Msk                                                                                   (0x1FFFFFFFUL << AON_REG_LPPWM_CH0_CTL_RSVD_Pos)

/* 0x810    0x4000_0810
    15:0    R/W     LPPWM_CH0_P0_H                                              16'h0
    31:16   R       RSVD                                                        16'h0
 */
typedef union _AON_REG_LPPWM_CH0_P0_H_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPPWM_CH0_P0_H: 16;
        uint32_t RSVD: 16;
    };
} AON_REG_LPPWM_CH0_P0_H_TYPE;

/*0x4000_0810 AON_REG_LPPWM_CH0_P0_H*/
#define AON_REG_LPPWM_CH0_P0_H_LPPWM_CH0_P0_H_Pos                                                                        0U
#define AON_REG_LPPWM_CH0_P0_H_LPPWM_CH0_P0_H_Msk                                                                        (0xFFFFUL << AON_REG_LPPWM_CH0_P0_H_LPPWM_CH0_P0_H_Pos)

#define AON_REG_LPPWM_CH0_P0_H_RSVD_Pos                                                                                  16U
#define AON_REG_LPPWM_CH0_P0_H_RSVD_Msk                                                                                  (0xFFFFUL << AON_REG_LPPWM_CH0_P0_H_RSVD_Pos)

/* 0x814    0x4000_0814
    15:0    R/W     LPPWM_CH0_P0_L                                              16'h0
    31:16   R       RSVD                                                        16'h0
 */
typedef union _AON_REG_LPPWM_CH0_P0_L_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPPWM_CH0_P0_L: 16;
        uint32_t RSVD: 16;
    };
} AON_REG_LPPWM_CH0_P0_L_TYPE;

