rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0814 AON_REG_LPPWM_CH0_P0_L*/
#define AON_REG_LPPWM_CH0_P0_L_LPPWM_CH0_P0_L_Pos                                                                        0U
#define AON_REG_LPPWM_CH0_P0_L_LPPWM_CH0_P0_L_Msk                                                                        (0xFFFFUL << AON_REG_LPPWM_CH0_P0_L_LPPWM_CH0_P0_L_Pos)

#define AON_REG_LPPWM_CH0_P0_L_RSVD_Pos                                                                                  16U
#define AON_REG_LPPWM_CH0_P0_L_RSVD_Msk                                                                                  (0xFFFFUL << AON_REG_LPPWM_CH0_P0_L_RSVD_Pos)

/* 0x818    0x4000_0818
    15:0    R       LPPWM_CH0_CURRENT                                           16'h0
    31:16   R       RSVD                                                        16'h0
 */
typedef union _AON_REG_LPPWM_CH0_CURRENT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPPWM_CH0_CURRENT: 16;
        uint32_t RSVD: 16;
    };
} AON_REG_LPPWM_CH0_CURRENT_TYPE;

/*0x4000_0818 AON_REG_LPPWM_CH0_CURRENT*/
#define AON_REG_LPPWM_CH0_CURRENT_LPPWM_CH0_CURRENT_Pos                                                                  0U
#define AON_REG_LPPWM_CH0_CURRENT_LPPWM_CH0_CURRENT_Msk                                                                  (0xFFFFUL << AON_REG_LPPWM_CH0_CURRENT_LPPWM_CH0_CURRENT_Pos)

#define AON_REG_LPPWM_CH0_CURRENT_RSVD_Pos                                                                               16U
#define AON_REG_LPPWM_CH0_CURRENT_RSVD_Msk                                                                               (0xFFFFUL << AON_REG_LPPWM_CH0_CURRENT_RSVD_Pos)

/* 0x81C    0x4000_081c
    31:0    R       LPPWM_VERSION                                               32'h2305230A
 */
typedef union _AON_REG_LPPWM_VERSION_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPPWM_VERSION;
    };
} AON_REG_LPPWM_VERSION_TYPE;

/*0x4000_081c AON_REG_LPPWM_VERSION*/
#define AON_REG_LPPWM_VERSION_LPPWM_VERSION_Pos                                                                          0U
#define AON_REG_LPPWM_VERSION_LPPWM_VERSION_Msk                                                                          (0xFFFFFFFFUL << AON_REG_LPPWM_VERSION_LPPWM_VERSION_Pos)

/* 0x820    0x4000_0820
    0       R/W     LPPWM_CLK_QACTIVE_MAN_DATA                                  1'h0
    1       R/W     LPPWM_CLK_QACTIVE_MAN_ENABLE                                1'h0
    31:2    R       RSVD                                                        30'h0
 */
typedef union _AON_REG_LPPWM_QACTIVE_MANUAL_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LPPWM_CLK_QACTIVE_MAN_DATA: 1;
        uint32_t LPPWM_CLK_QACTIVE_MAN_ENABLE: 1;
        uint32_t RSVD: 30;
    };
} AON_REG_LPPWM_QACTIVE_MANUAL_CTRL_TYPE;

/*0x4000_0820 AON_REG_LPPWM_QACTIVE_MANUAL_CTRL*/
#define AON_REG_LPPWM_QACTIVE_MANUAL_CTRL_LPPWM_CLK_QACTIVE_MAN_DATA_Pos                                                 0U
#define AON_REG_LPPWM_QACTIVE_MANUAL_CTRL_LPPWM_CLK_QACTIVE_MAN_DATA_Msk                                                 (0x1UL << AON_REG_LPPWM_QACTIVE_MANUAL_CTRL_LPPWM_CLK_QACTIVE_MAN_DATA_Pos)

#define AON_REG_LPPWM_QACTIVE_MANUAL_CTRL_LPPWM_CLK_QACTIVE_MAN_ENABLE_Pos                                               1U
#define AON_REG_LPPWM_QACTIVE_MANUAL_CTRL_LPPWM_CLK_QACTIVE_MAN_ENABLE_Msk                                               (0x1UL << AON_REG_LPPWM_QACTIVE_MANUAL_CTRL_LPPWM_CLK_QACTIVE_MAN_ENABLE_Pos)

#define AON_REG_LPPWM_QACTIVE_MANUAL_CTRL_RSVD_Pos                                                                       2U
#define AON_REG_LPPWM_QACTIVE_MANUAL_CTRL_RSVD_Msk                                                                       (0x3FFFFFFFUL << AON_REG_LPPWM_QACTIVE_MANUAL_CTRL_RSVD_Pos)

/* 0x828    0x4000_0828
    0       R/W     TEST1_lemst                                                 1'b0
    1       R/W     DS_low_pwr_lemst                                            1'b0
    2       R/W     SD_low_pwr_lemst                                            1'b0
    3       R/W     LS_low_pwr_lemst                                            1'b0
    4       R/W     DS_UNK_low_pwr_lemst                                        1'b0
    6:5     R/W     DS_K_low_pwr_lemst                                          2'b01
    7       R/W     DS_norm_pwr_lemst                                           1'b0
    8       R/W     SD_norm_pwr_lemst                                           1'b0
    9       R/W     LS_norm_pwr_lemst                                           1'b0
    10      R/W     DS_UNK_norm_pwr_lemst                                       1'b0
    12:11   R/W     DS_K_norm_pwr_lemst                                         2'b01
    31:13   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TEST1_lemst: 1;
        uint32_t DS_low_pwr_lemst: 1;
        uint32_t SD_low_pwr_lemst: 1;
        uint32_t LS_low_pwr_lemst: 1;
        uint32_t DS_UNK_low_pwr_lemst: 1;
        uint32_t DS_K_low_pwr_lemst: 2;
        uint32_t DS_norm_pwr_lemst: 1;
        uint32_t SD_norm_pwr_lemst: 1;
        uint32_t LS_norm_pwr_lemst: 1;
        uint32_t DS_UNK_norm_pwr_lemst: 1;
        uint32_t DS_K_norm_pwr_lemst: 2;
        uint32_t RSVD: 19;
    };
} AON_REG_SRAM_CTRL0_TYPE;

/*0x4000_0828 AON_REG_SRAM_CTRL0*/
#define AON_REG_SRAM_CTRL0_TEST1_lemst_Pos                                                                               0U
#define AON_REG_SRAM_CTRL0_TEST1_lemst_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL0_TEST1_lemst_Pos)

#define AON_REG_SRAM_CTRL0_DS_low_pwr_lemst_Pos                                                                          1U
#define AON_REG_SRAM_CTRL0_DS_low_pwr_lemst_Msk                                                                          (0x1UL << AON_REG_SRAM_CTRL0_DS_low_pwr_lemst_Pos)

#define AON_REG_SRAM_CTRL0_SD_low_pwr_lemst_Pos                                                                          2U
#define AON_REG_SRAM_CTRL0_SD_low_pwr_lemst_Msk                                                                          (0x1UL << AON_REG_SRAM_CTRL0_SD_low_pwr_lemst_Pos)

#define AON_REG_SRAM_CTRL0_LS_low_pwr_lemst_Pos                                                                          3U
#define AON_REG_SRAM_CTRL0_LS_low_pwr_lemst_Msk                                                                          (0x1UL << AON_REG_SRAM_CTRL0_LS_low_pwr_lemst_Pos)

#define AON_REG_SRAM_CTRL0_DS_UNK_low_pwr_lemst_Pos                                                                      4U
#define AON_REG_SRAM_CTRL0_DS_UNK_low_pwr_lemst_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL0_DS_UNK_low_pwr_lemst_Pos)

#define AON_REG_SRAM_CTRL0_DS_K_low_pwr_lemst_Pos                                                                        5U
#define AON_REG_SRAM_CTRL0_DS_K_low_pwr_lemst_Msk                                                                        (0x3UL << AON_REG_SRAM_CTRL0_DS_K_low_pwr_lemst_Pos)

