rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL0_DS_norm_pwr_lemst_Pos                                                                         7U
#define AON_REG_SRAM_CTRL0_DS_norm_pwr_lemst_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL0_DS_norm_pwr_lemst_Pos)

#define AON_REG_SRAM_CTRL0_SD_norm_pwr_lemst_Pos                                                                         8U
#define AON_REG_SRAM_CTRL0_SD_norm_pwr_lemst_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL0_SD_norm_pwr_lemst_Pos)

#define AON_REG_SRAM_CTRL0_LS_norm_pwr_lemst_Pos                                                                         9U
#define AON_REG_SRAM_CTRL0_LS_norm_pwr_lemst_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL0_LS_norm_pwr_lemst_Pos)

#define AON_REG_SRAM_CTRL0_DS_UNK_norm_pwr_lemst_Pos                                                                     10U
#define AON_REG_SRAM_CTRL0_DS_UNK_norm_pwr_lemst_Msk                                                                     (0x1UL << AON_REG_SRAM_CTRL0_DS_UNK_norm_pwr_lemst_Pos)

#define AON_REG_SRAM_CTRL0_DS_K_norm_pwr_lemst_Pos                                                                       11U
#define AON_REG_SRAM_CTRL0_DS_K_norm_pwr_lemst_Msk                                                                       (0x3UL << AON_REG_SRAM_CTRL0_DS_K_norm_pwr_lemst_Pos)

#define AON_REG_SRAM_CTRL0_RSVD_Pos                                                                                      13U
#define AON_REG_SRAM_CTRL0_RSVD_Msk                                                                                      (0x7FFFFUL << AON_REG_SRAM_CTRL0_RSVD_Pos)

/* 0x82C    0x4000_082c
    2:0     R/W     WPULSE_lemst_lv                                             3'b000
    5:3     R/W     WA_lemst_lv                                                 3'b110
    9:6     R/W     RM_lemst_lv                                                 4'b0000
    10      R/W     RME_lemst_lv                                                1'b1
    12:11   R/W     RA_lemst_lv                                                 2'b01
    15:13   R       RSVD_1                                                      0
    18:16   R/W     WPULSE_lemst_hv                                             3'b000
    21:19   R/W     WA_lemst_hv                                                 3'b100
    25:22   R/W     RM_lemst_hv                                                 4'b0011
    26      R/W     RME_lemst_hv                                                1'b1
    28:27   R/W     RA_lemst_hv                                                 2'b00
    31:29   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WPULSE_lemst_lv: 3;
        uint32_t WA_lemst_lv: 3;
        uint32_t RM_lemst_lv: 4;
        uint32_t RME_lemst_lv: 1;
        uint32_t RA_lemst_lv: 2;
        uint32_t RSVD_1: 3;
        uint32_t WPULSE_lemst_hv: 3;
        uint32_t WA_lemst_hv: 3;
        uint32_t RM_lemst_hv: 4;
        uint32_t RME_lemst_hv: 1;
        uint32_t RA_lemst_hv: 2;
        uint32_t RSVD: 3;
    };
} AON_REG_SRAM_CTRL1_TYPE;

/*0x4000_082c AON_REG_SRAM_CTRL1*/
#define AON_REG_SRAM_CTRL1_WPULSE_lemst_lv_Pos                                                                           0U
#define AON_REG_SRAM_CTRL1_WPULSE_lemst_lv_Msk                                                                           (0x7UL << AON_REG_SRAM_CTRL1_WPULSE_lemst_lv_Pos)

#define AON_REG_SRAM_CTRL1_WA_lemst_lv_Pos                                                                               3U
#define AON_REG_SRAM_CTRL1_WA_lemst_lv_Msk                                                                               (0x7UL << AON_REG_SRAM_CTRL1_WA_lemst_lv_Pos)

#define AON_REG_SRAM_CTRL1_RM_lemst_lv_Pos                                                                               6U
#define AON_REG_SRAM_CTRL1_RM_lemst_lv_Msk                                                                               (0xFUL << AON_REG_SRAM_CTRL1_RM_lemst_lv_Pos)

#define AON_REG_SRAM_CTRL1_RME_lemst_lv_Pos                                                                              10U
#define AON_REG_SRAM_CTRL1_RME_lemst_lv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL1_RME_lemst_lv_Pos)

#define AON_REG_SRAM_CTRL1_RA_lemst_lv_Pos                                                                               11U
#define AON_REG_SRAM_CTRL1_RA_lemst_lv_Msk                                                                               (0x3UL << AON_REG_SRAM_CTRL1_RA_lemst_lv_Pos)

#define AON_REG_SRAM_CTRL1_RSVD_1_Pos                                                                                    13U
#define AON_REG_SRAM_CTRL1_RSVD_1_Msk                                                                                    (0x7UL << AON_REG_SRAM_CTRL1_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL1_WPULSE_lemst_hv_Pos                                                                           16U
#define AON_REG_SRAM_CTRL1_WPULSE_lemst_hv_Msk                                                                           (0x7UL << AON_REG_SRAM_CTRL1_WPULSE_lemst_hv_Pos)

#define AON_REG_SRAM_CTRL1_WA_lemst_hv_Pos                                                                               19U
#define AON_REG_SRAM_CTRL1_WA_lemst_hv_Msk                                                                               (0x7UL << AON_REG_SRAM_CTRL1_WA_lemst_hv_Pos)

#define AON_REG_SRAM_CTRL1_RM_lemst_hv_Pos                                                                               22U
#define AON_REG_SRAM_CTRL1_RM_lemst_hv_Msk                                                                               (0xFUL << AON_REG_SRAM_CTRL1_RM_lemst_hv_Pos)

