rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL1_RME_lemst_hv_Pos                                                                              26U
#define AON_REG_SRAM_CTRL1_RME_lemst_hv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL1_RME_lemst_hv_Pos)

#define AON_REG_SRAM_CTRL1_RA_lemst_hv_Pos                                                                               27U
#define AON_REG_SRAM_CTRL1_RA_lemst_hv_Msk                                                                               (0x3UL << AON_REG_SRAM_CTRL1_RA_lemst_hv_Pos)

#define AON_REG_SRAM_CTRL1_RSVD_Pos                                                                                      29U
#define AON_REG_SRAM_CTRL1_RSVD_Msk                                                                                      (0x7UL << AON_REG_SRAM_CTRL1_RSVD_Pos)

/* 0x830    0x4000_0830
    0       R/W     TEST1_lepa                                                  1'b0
    1       R/W     DS_low_pwr_lepa                                             1'b0
    2       R/W     SD_low_pwr_lepa                                             1'b0
    3       R/W     LS_low_pwr_lepa                                             1'b0
    4       R/W     DS_UNK_low_pwr_lepa                                         1'b0
    6:5     R/W     DS_K_low_pwr_lepa                                           2'b01
    7       R/W     DS_norm_pwr_lepa                                            1'b0
    8       R/W     SD_norm_pwr_lepa                                            1'b0
    9       R/W     LS_norm_pwr_lepa                                            1'b0
    10      R/W     DS_UNK_norm_pwr_lepa                                        1'b0
    12:11   R/W     DS_K_norm_pwr_lepa                                          2'b01
    31:13   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TEST1_lepa: 1;
        uint32_t DS_low_pwr_lepa: 1;
        uint32_t SD_low_pwr_lepa: 1;
        uint32_t LS_low_pwr_lepa: 1;
        uint32_t DS_UNK_low_pwr_lepa: 1;
        uint32_t DS_K_low_pwr_lepa: 2;
        uint32_t DS_norm_pwr_lepa: 1;
        uint32_t SD_norm_pwr_lepa: 1;
        uint32_t LS_norm_pwr_lepa: 1;
        uint32_t DS_UNK_norm_pwr_lepa: 1;
        uint32_t DS_K_norm_pwr_lepa: 2;
        uint32_t RSVD: 19;
    };
} AON_REG_SRAM_CTRL2_TYPE;

/*0x4000_0830 AON_REG_SRAM_CTRL2*/
#define AON_REG_SRAM_CTRL2_TEST1_lepa_Pos                                                                                0U
#define AON_REG_SRAM_CTRL2_TEST1_lepa_Msk                                                                                (0x1UL << AON_REG_SRAM_CTRL2_TEST1_lepa_Pos)

#define AON_REG_SRAM_CTRL2_DS_low_pwr_lepa_Pos                                                                           1U
#define AON_REG_SRAM_CTRL2_DS_low_pwr_lepa_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL2_DS_low_pwr_lepa_Pos)

#define AON_REG_SRAM_CTRL2_SD_low_pwr_lepa_Pos                                                                           2U
#define AON_REG_SRAM_CTRL2_SD_low_pwr_lepa_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL2_SD_low_pwr_lepa_Pos)

#define AON_REG_SRAM_CTRL2_LS_low_pwr_lepa_Pos                                                                           3U
#define AON_REG_SRAM_CTRL2_LS_low_pwr_lepa_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL2_LS_low_pwr_lepa_Pos)

#define AON_REG_SRAM_CTRL2_DS_UNK_low_pwr_lepa_Pos                                                                       4U
#define AON_REG_SRAM_CTRL2_DS_UNK_low_pwr_lepa_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL2_DS_UNK_low_pwr_lepa_Pos)

#define AON_REG_SRAM_CTRL2_DS_K_low_pwr_lepa_Pos                                                                         5U
#define AON_REG_SRAM_CTRL2_DS_K_low_pwr_lepa_Msk                                                                         (0x3UL << AON_REG_SRAM_CTRL2_DS_K_low_pwr_lepa_Pos)

#define AON_REG_SRAM_CTRL2_DS_norm_pwr_lepa_Pos                                                                          7U
#define AON_REG_SRAM_CTRL2_DS_norm_pwr_lepa_Msk                                                                          (0x1UL << AON_REG_SRAM_CTRL2_DS_norm_pwr_lepa_Pos)

#define AON_REG_SRAM_CTRL2_SD_norm_pwr_lepa_Pos                                                                          8U
#define AON_REG_SRAM_CTRL2_SD_norm_pwr_lepa_Msk                                                                          (0x1UL << AON_REG_SRAM_CTRL2_SD_norm_pwr_lepa_Pos)

#define AON_REG_SRAM_CTRL2_LS_norm_pwr_lepa_Pos                                                                          9U
#define AON_REG_SRAM_CTRL2_LS_norm_pwr_lepa_Msk                                                                          (0x1UL << AON_REG_SRAM_CTRL2_LS_norm_pwr_lepa_Pos)

#define AON_REG_SRAM_CTRL2_DS_UNK_norm_pwr_lepa_Pos                                                                      10U
#define AON_REG_SRAM_CTRL2_DS_UNK_norm_pwr_lepa_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL2_DS_UNK_norm_pwr_lepa_Pos)

#define AON_REG_SRAM_CTRL2_DS_K_norm_pwr_lepa_Pos                                                                        11U
#define AON_REG_SRAM_CTRL2_DS_K_norm_pwr_lepa_Msk                                                                        (0x3UL << AON_REG_SRAM_CTRL2_DS_K_norm_pwr_lepa_Pos)

#define AON_REG_SRAM_CTRL2_RSVD_Pos                                                                                      13U
#define AON_REG_SRAM_CTRL2_RSVD_Msk                                                                                      (0x7FFFFUL << AON_REG_SRAM_CTRL2_RSVD_Pos)

