rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x834    0x4000_0834
    2:0     R/W     WPULSE_lepa_lv                                              3'b000
    5:3     R/W     WA_lepa_lv                                                  3'b101
    9:6     R/W     RM_lepa_lv                                                  4'b0010
    10      R/W     RME_lepa_lv                                                 1'b1
    12:11   R/W     RA_lepa_lv                                                  2'b00
    15:13   R       RSVD_1                                                      0
    18:16   R/W     WPULSE_lepa_hv                                              3'b000
    21:19   R/W     WA_lepa_hv                                                  3'b100
    25:22   R/W     RM_lepa_hv                                                  4'b0011
    26      R/W     RME_lepa_hv                                                 1'b1
    28:27   R/W     RA_lepa_hv                                                  2'b00
    31:29   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WPULSE_lepa_lv: 3;
        uint32_t WA_lepa_lv: 3;
        uint32_t RM_lepa_lv: 4;
        uint32_t RME_lepa_lv: 1;
        uint32_t RA_lepa_lv: 2;
        uint32_t RSVD_1: 3;
        uint32_t WPULSE_lepa_hv: 3;
        uint32_t WA_lepa_hv: 3;
        uint32_t RM_lepa_hv: 4;
        uint32_t RME_lepa_hv: 1;
        uint32_t RA_lepa_hv: 2;
        uint32_t RSVD: 3;
    };
} AON_REG_SRAM_CTRL3_TYPE;

/*0x4000_0834 AON_REG_SRAM_CTRL3*/
#define AON_REG_SRAM_CTRL3_WPULSE_lepa_lv_Pos                                                                            0U
#define AON_REG_SRAM_CTRL3_WPULSE_lepa_lv_Msk                                                                            (0x7UL << AON_REG_SRAM_CTRL3_WPULSE_lepa_lv_Pos)

#define AON_REG_SRAM_CTRL3_WA_lepa_lv_Pos                                                                                3U
#define AON_REG_SRAM_CTRL3_WA_lepa_lv_Msk                                                                                (0x7UL << AON_REG_SRAM_CTRL3_WA_lepa_lv_Pos)

#define AON_REG_SRAM_CTRL3_RM_lepa_lv_Pos                                                                                6U
#define AON_REG_SRAM_CTRL3_RM_lepa_lv_Msk                                                                                (0xFUL << AON_REG_SRAM_CTRL3_RM_lepa_lv_Pos)

#define AON_REG_SRAM_CTRL3_RME_lepa_lv_Pos                                                                               10U
#define AON_REG_SRAM_CTRL3_RME_lepa_lv_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL3_RME_lepa_lv_Pos)

#define AON_REG_SRAM_CTRL3_RA_lepa_lv_Pos                                                                                11U
#define AON_REG_SRAM_CTRL3_RA_lepa_lv_Msk                                                                                (0x3UL << AON_REG_SRAM_CTRL3_RA_lepa_lv_Pos)

#define AON_REG_SRAM_CTRL3_RSVD_1_Pos                                                                                    13U
#define AON_REG_SRAM_CTRL3_RSVD_1_Msk                                                                                    (0x7UL << AON_REG_SRAM_CTRL3_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL3_WPULSE_lepa_hv_Pos                                                                            16U
#define AON_REG_SRAM_CTRL3_WPULSE_lepa_hv_Msk                                                                            (0x7UL << AON_REG_SRAM_CTRL3_WPULSE_lepa_hv_Pos)

#define AON_REG_SRAM_CTRL3_WA_lepa_hv_Pos                                                                                19U
#define AON_REG_SRAM_CTRL3_WA_lepa_hv_Msk                                                                                (0x7UL << AON_REG_SRAM_CTRL3_WA_lepa_hv_Pos)

#define AON_REG_SRAM_CTRL3_RM_lepa_hv_Pos                                                                                22U
#define AON_REG_SRAM_CTRL3_RM_lepa_hv_Msk                                                                                (0xFUL << AON_REG_SRAM_CTRL3_RM_lepa_hv_Pos)

#define AON_REG_SRAM_CTRL3_RME_lepa_hv_Pos                                                                               26U
#define AON_REG_SRAM_CTRL3_RME_lepa_hv_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL3_RME_lepa_hv_Pos)

#define AON_REG_SRAM_CTRL3_RA_lepa_hv_Pos                                                                                27U
#define AON_REG_SRAM_CTRL3_RA_lepa_hv_Msk                                                                                (0x3UL << AON_REG_SRAM_CTRL3_RA_lepa_hv_Pos)

#define AON_REG_SRAM_CTRL3_RSVD_Pos                                                                                      29U
#define AON_REG_SRAM_CTRL3_RSVD_Msk                                                                                      (0x7UL << AON_REG_SRAM_CTRL3_RSVD_Pos)

/* 0x838    0x4000_0838
    0       R/W     TEST1_leslv                                                 1'b0
    1       R/W     DS_low_pwr_leslv                                            1'b0
    2       R/W     SD_low_pwr_leslv                                            1'b0
    3       R/W     LS_low_pwr_leslv                                            1'b0
    4       R/W     DS_UNK_low_pwr_leslv                                        1'b0
    6:5     R/W     DS_K_low_pwr_leslv                                          2'b01
    7       R/W     DS_norm_pwr_leslv                                           1'b0
    8       R/W     SD_norm_pwr_leslv                                           1'b0
    9       R/W     LS_norm_pwr_leslv                                           1'b0
    10      R/W     DS_UNK_norm_pwr_leslv                                       1'b0
    12:11   R/W     DS_K_norm_pwr_leslv                                         2'b01
    31:13   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TEST1_leslv: 1;
        uint32_t DS_low_pwr_leslv: 1;
        uint32_t SD_low_pwr_leslv: 1;
        uint32_t LS_low_pwr_leslv: 1;
        uint32_t DS_UNK_low_pwr_leslv: 1;
        uint32_t DS_K_low_pwr_leslv: 2;
        uint32_t DS_norm_pwr_leslv: 1;
        uint32_t SD_norm_pwr_leslv: 1;
        uint32_t LS_norm_pwr_leslv: 1;
        uint32_t DS_UNK_norm_pwr_leslv: 1;
        uint32_t DS_K_norm_pwr_leslv: 2;
        uint32_t RSVD: 19;
    };
} AON_REG_SRAM_CTRL4_TYPE;

/*0x4000_0838 AON_REG_SRAM_CTRL4*/
#define AON_REG_SRAM_CTRL4_TEST1_leslv_Pos                                                                               0U
#define AON_REG_SRAM_CTRL4_TEST1_leslv_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL4_TEST1_leslv_Pos)

#define AON_REG_SRAM_CTRL4_DS_low_pwr_leslv_Pos                                                                          1U
#define AON_REG_SRAM_CTRL4_DS_low_pwr_leslv_Msk                                                                          (0x1UL << AON_REG_SRAM_CTRL4_DS_low_pwr_leslv_Pos)

#define AON_REG_SRAM_CTRL4_SD_low_pwr_leslv_Pos                                                                          2U
#define AON_REG_SRAM_CTRL4_SD_low_pwr_leslv_Msk                                                                          (0x1UL << AON_REG_SRAM_CTRL4_SD_low_pwr_leslv_Pos)

