rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL4_LS_low_pwr_leslv_Pos                                                                          3U
#define AON_REG_SRAM_CTRL4_LS_low_pwr_leslv_Msk                                                                          (0x1UL << AON_REG_SRAM_CTRL4_LS_low_pwr_leslv_Pos)

#define AON_REG_SRAM_CTRL4_DS_UNK_low_pwr_leslv_Pos                                                                      4U
#define AON_REG_SRAM_CTRL4_DS_UNK_low_pwr_leslv_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL4_DS_UNK_low_pwr_leslv_Pos)

#define AON_REG_SRAM_CTRL4_DS_K_low_pwr_leslv_Pos                                                                        5U
#define AON_REG_SRAM_CTRL4_DS_K_low_pwr_leslv_Msk                                                                        (0x3UL << AON_REG_SRAM_CTRL4_DS_K_low_pwr_leslv_Pos)

#define AON_REG_SRAM_CTRL4_DS_norm_pwr_leslv_Pos                                                                         7U
#define AON_REG_SRAM_CTRL4_DS_norm_pwr_leslv_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL4_DS_norm_pwr_leslv_Pos)

#define AON_REG_SRAM_CTRL4_SD_norm_pwr_leslv_Pos                                                                         8U
#define AON_REG_SRAM_CTRL4_SD_norm_pwr_leslv_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL4_SD_norm_pwr_leslv_Pos)

#define AON_REG_SRAM_CTRL4_LS_norm_pwr_leslv_Pos                                                                         9U
#define AON_REG_SRAM_CTRL4_LS_norm_pwr_leslv_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL4_LS_norm_pwr_leslv_Pos)

#define AON_REG_SRAM_CTRL4_DS_UNK_norm_pwr_leslv_Pos                                                                     10U
#define AON_REG_SRAM_CTRL4_DS_UNK_norm_pwr_leslv_Msk                                                                     (0x1UL << AON_REG_SRAM_CTRL4_DS_UNK_norm_pwr_leslv_Pos)

#define AON_REG_SRAM_CTRL4_DS_K_norm_pwr_leslv_Pos                                                                       11U
#define AON_REG_SRAM_CTRL4_DS_K_norm_pwr_leslv_Msk                                                                       (0x3UL << AON_REG_SRAM_CTRL4_DS_K_norm_pwr_leslv_Pos)

#define AON_REG_SRAM_CTRL4_RSVD_Pos                                                                                      13U
#define AON_REG_SRAM_CTRL4_RSVD_Msk                                                                                      (0x7FFFFUL << AON_REG_SRAM_CTRL4_RSVD_Pos)

/* 0x83C    0x4000_083c
    2:0     R/W     WPULSE_leslv_lv                                             3'b000
    5:3     R/W     WA_leslv_lv                                                 3'b101
    9:6     R/W     RM_leslv_lv                                                 4'b0010
    10      R/W     RME_leslv_lv                                                1'b1
    12:11   R/W     RA_leslv_lv                                                 2'b00
    15:13   R       RSVD_1                                                      0
    18:16   R/W     WPULSE_leslv_hv                                             3'b000
    21:19   R/W     WA_leslv_hv                                                 3'b100
    25:22   R/W     RM_leslv_hv                                                 4'b0011
    26      R/W     RME_leslv_hv                                                1'b1
    28:27   R/W     RA_leslv_hv                                                 2'b00
    31:29   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL5_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WPULSE_leslv_lv: 3;
        uint32_t WA_leslv_lv: 3;
        uint32_t RM_leslv_lv: 4;
        uint32_t RME_leslv_lv: 1;
        uint32_t RA_leslv_lv: 2;
        uint32_t RSVD_1: 3;
        uint32_t WPULSE_leslv_hv: 3;
        uint32_t WA_leslv_hv: 3;
        uint32_t RM_leslv_hv: 4;
        uint32_t RME_leslv_hv: 1;
        uint32_t RA_leslv_hv: 2;
        uint32_t RSVD: 3;
    };
} AON_REG_SRAM_CTRL5_TYPE;

/*0x4000_083c AON_REG_SRAM_CTRL5*/
#define AON_REG_SRAM_CTRL5_WPULSE_leslv_lv_Pos                                                                           0U
#define AON_REG_SRAM_CTRL5_WPULSE_leslv_lv_Msk                                                                           (0x7UL << AON_REG_SRAM_CTRL5_WPULSE_leslv_lv_Pos)

#define AON_REG_SRAM_CTRL5_WA_leslv_lv_Pos                                                                               3U
#define AON_REG_SRAM_CTRL5_WA_leslv_lv_Msk                                                                               (0x7UL << AON_REG_SRAM_CTRL5_WA_leslv_lv_Pos)

#define AON_REG_SRAM_CTRL5_RM_leslv_lv_Pos                                                                               6U
#define AON_REG_SRAM_CTRL5_RM_leslv_lv_Msk                                                                               (0xFUL << AON_REG_SRAM_CTRL5_RM_leslv_lv_Pos)

#define AON_REG_SRAM_CTRL5_RME_leslv_lv_Pos                                                                              10U
#define AON_REG_SRAM_CTRL5_RME_leslv_lv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL5_RME_leslv_lv_Pos)

#define AON_REG_SRAM_CTRL5_RA_leslv_lv_Pos                                                                               11U
#define AON_REG_SRAM_CTRL5_RA_leslv_lv_Msk                                                                               (0x3UL << AON_REG_SRAM_CTRL5_RA_leslv_lv_Pos)

#define AON_REG_SRAM_CTRL5_RSVD_1_Pos                                                                                    13U
#define AON_REG_SRAM_CTRL5_RSVD_1_Msk                                                                                    (0x7UL << AON_REG_SRAM_CTRL5_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL5_WPULSE_leslv_hv_Pos                                                                           16U
#define AON_REG_SRAM_CTRL5_WPULSE_leslv_hv_Msk                                                                           (0x7UL << AON_REG_SRAM_CTRL5_WPULSE_leslv_hv_Pos)

#define AON_REG_SRAM_CTRL5_WA_leslv_hv_Pos                                                                               19U
#define AON_REG_SRAM_CTRL5_WA_leslv_hv_Msk                                                                               (0x7UL << AON_REG_SRAM_CTRL5_WA_leslv_hv_Pos)

#define AON_REG_SRAM_CTRL5_RM_leslv_hv_Pos                                                                               22U
#define AON_REG_SRAM_CTRL5_RM_leslv_hv_Msk                                                                               (0xFUL << AON_REG_SRAM_CTRL5_RM_leslv_hv_Pos)

#define AON_REG_SRAM_CTRL5_RME_leslv_hv_Pos                                                                              26U
#define AON_REG_SRAM_CTRL5_RME_leslv_hv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL5_RME_leslv_hv_Pos)

#define AON_REG_SRAM_CTRL5_RA_leslv_hv_Pos                                                                               27U
#define AON_REG_SRAM_CTRL5_RA_leslv_hv_Msk                                                                               (0x3UL << AON_REG_SRAM_CTRL5_RA_leslv_hv_Pos)

#define AON_REG_SRAM_CTRL5_RSVD_Pos                                                                                      29U
#define AON_REG_SRAM_CTRL5_RSVD_Msk                                                                                      (0x7UL << AON_REG_SRAM_CTRL5_RSVD_Pos)

/* 0x840    0x4000_0840
    0       R/W     DS_low_pwr_buffer                                           1'b0
    1       R/W     SD_low_pwr_buffer                                           1'b0
    2       R/W     LS_low_pwr_buffer                                           1'b0
    3       R/W     DS_UNK_low_pwr_buffer                                       1'b0
    5:4     R/W     DS_K_low_pwr_buffer                                         2'b01
    6       R/W     DS_norm_pwr_buffer                                          1'b0
    7       R/W     SD_norm_pwr_buffer                                          1'b0
    8       R/W     LS_norm_pwr_buffer                                          1'b0
    9       R/W     DS_UNK_norm_pwr_buffer                                      1'b0
    11:10   R/W     DS_K_norm_pwr_buffer                                        2'b01
    12      R/W     TEST1_buffer                                                1'b0
    13      R/W     DS_BKEN_buffer                                              1'b0
    15:14   R/W     DS_BK_buffer                                                2'b11
    16      R/W     DS_low_pwr_buffer_8k                                        1'b0
    17      R/W     SD_low_pwr_buffer_8k                                        1'b0
    18      R/W     LS_low_pwr_buffer_8k                                        1'b0
    19      R/W     DS_UNK_low_pwr_buffer_8k                                    1'b0
    21:20   R/W     DS_K_low_pwr_buffer_8k                                      2'b01
    22      R/W     DS_norm_pwr_buffer_8k                                       1'b0
    23      R/W     SD_norm_pwr_buffer_8k                                       1'b0
    24      R/W     LS_norm_pwr_buffer_8k                                       1'b0
    25      R/W     DS_UNK_norm_pwr_buffer_8k                                   1'b0
    27:26   R/W     DS_K_norm_pwr_buffer_8k                                     2'b01
    28      R/W     TEST1_buffer_8k                                             1'b0
    29      R       RSVD_1                                                      0
    31:30   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL6_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DS_low_pwr_buffer: 1;
        uint32_t SD_low_pwr_buffer: 1;
        uint32_t LS_low_pwr_buffer: 1;
        uint32_t DS_UNK_low_pwr_buffer: 1;
        uint32_t DS_K_low_pwr_buffer: 2;
        uint32_t DS_norm_pwr_buffer: 1;
        uint32_t SD_norm_pwr_buffer: 1;
        uint32_t LS_norm_pwr_buffer: 1;
        uint32_t DS_UNK_norm_pwr_buffer: 1;
        uint32_t DS_K_norm_pwr_buffer: 2;
        uint32_t TEST1_buffer: 1;
        uint32_t DS_BKEN_buffer: 1;
        uint32_t DS_BK_buffer: 2;
        uint32_t DS_low_pwr_buffer_8k: 1;
        uint32_t SD_low_pwr_buffer_8k: 1;
        uint32_t LS_low_pwr_buffer_8k: 1;
        uint32_t DS_UNK_low_pwr_buffer_8k: 1;
        uint32_t DS_K_low_pwr_buffer_8k: 2;
        uint32_t DS_norm_pwr_buffer_8k: 1;
        uint32_t SD_norm_pwr_buffer_8k: 1;
        uint32_t LS_norm_pwr_buffer_8k: 1;
        uint32_t DS_UNK_norm_pwr_buffer_8k: 1;
        uint32_t DS_K_norm_pwr_buffer_8k: 2;
        uint32_t TEST1_buffer_8k: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 2;
    };
} AON_REG_SRAM_CTRL6_TYPE;

/*0x4000_0840 AON_REG_SRAM_CTRL6*/
#define AON_REG_SRAM_CTRL6_DS_low_pwr_buffer_Pos                                                                         0U
#define AON_REG_SRAM_CTRL6_DS_low_pwr_buffer_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL6_DS_low_pwr_buffer_Pos)

#define AON_REG_SRAM_CTRL6_SD_low_pwr_buffer_Pos                                                                         1U
#define AON_REG_SRAM_CTRL6_SD_low_pwr_buffer_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL6_SD_low_pwr_buffer_Pos)

#define AON_REG_SRAM_CTRL6_LS_low_pwr_buffer_Pos                                                                         2U
#define AON_REG_SRAM_CTRL6_LS_low_pwr_buffer_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL6_LS_low_pwr_buffer_Pos)

