rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL6_DS_UNK_low_pwr_buffer_Pos                                                                     3U
#define AON_REG_SRAM_CTRL6_DS_UNK_low_pwr_buffer_Msk                                                                     (0x1UL << AON_REG_SRAM_CTRL6_DS_UNK_low_pwr_buffer_Pos)

#define AON_REG_SRAM_CTRL6_DS_K_low_pwr_buffer_Pos                                                                       4U
#define AON_REG_SRAM_CTRL6_DS_K_low_pwr_buffer_Msk                                                                       (0x3UL << AON_REG_SRAM_CTRL6_DS_K_low_pwr_buffer_Pos)

#define AON_REG_SRAM_CTRL6_DS_norm_pwr_buffer_Pos                                                                        6U
#define AON_REG_SRAM_CTRL6_DS_norm_pwr_buffer_Msk                                                                        (0x1UL << AON_REG_SRAM_CTRL6_DS_norm_pwr_buffer_Pos)

#define AON_REG_SRAM_CTRL6_SD_norm_pwr_buffer_Pos                                                                        7U
#define AON_REG_SRAM_CTRL6_SD_norm_pwr_buffer_Msk                                                                        (0x1UL << AON_REG_SRAM_CTRL6_SD_norm_pwr_buffer_Pos)

#define AON_REG_SRAM_CTRL6_LS_norm_pwr_buffer_Pos                                                                        8U
#define AON_REG_SRAM_CTRL6_LS_norm_pwr_buffer_Msk                                                                        (0x1UL << AON_REG_SRAM_CTRL6_LS_norm_pwr_buffer_Pos)

#define AON_REG_SRAM_CTRL6_DS_UNK_norm_pwr_buffer_Pos                                                                    9U
#define AON_REG_SRAM_CTRL6_DS_UNK_norm_pwr_buffer_Msk                                                                    (0x1UL << AON_REG_SRAM_CTRL6_DS_UNK_norm_pwr_buffer_Pos)

#define AON_REG_SRAM_CTRL6_DS_K_norm_pwr_buffer_Pos                                                                      10U
#define AON_REG_SRAM_CTRL6_DS_K_norm_pwr_buffer_Msk                                                                      (0x3UL << AON_REG_SRAM_CTRL6_DS_K_norm_pwr_buffer_Pos)

#define AON_REG_SRAM_CTRL6_TEST1_buffer_Pos                                                                              12U
#define AON_REG_SRAM_CTRL6_TEST1_buffer_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL6_TEST1_buffer_Pos)

#define AON_REG_SRAM_CTRL6_DS_BKEN_buffer_Pos                                                                            13U
#define AON_REG_SRAM_CTRL6_DS_BKEN_buffer_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL6_DS_BKEN_buffer_Pos)

#define AON_REG_SRAM_CTRL6_DS_BK_buffer_Pos                                                                              14U
#define AON_REG_SRAM_CTRL6_DS_BK_buffer_Msk                                                                              (0x3UL << AON_REG_SRAM_CTRL6_DS_BK_buffer_Pos)

#define AON_REG_SRAM_CTRL6_DS_low_pwr_buffer_8k_Pos                                                                      16U
#define AON_REG_SRAM_CTRL6_DS_low_pwr_buffer_8k_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL6_DS_low_pwr_buffer_8k_Pos)

#define AON_REG_SRAM_CTRL6_SD_low_pwr_buffer_8k_Pos                                                                      17U
#define AON_REG_SRAM_CTRL6_SD_low_pwr_buffer_8k_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL6_SD_low_pwr_buffer_8k_Pos)

#define AON_REG_SRAM_CTRL6_LS_low_pwr_buffer_8k_Pos                                                                      18U
#define AON_REG_SRAM_CTRL6_LS_low_pwr_buffer_8k_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL6_LS_low_pwr_buffer_8k_Pos)

#define AON_REG_SRAM_CTRL6_DS_UNK_low_pwr_buffer_8k_Pos                                                                  19U
#define AON_REG_SRAM_CTRL6_DS_UNK_low_pwr_buffer_8k_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL6_DS_UNK_low_pwr_buffer_8k_Pos)

#define AON_REG_SRAM_CTRL6_DS_K_low_pwr_buffer_8k_Pos                                                                    20U
#define AON_REG_SRAM_CTRL6_DS_K_low_pwr_buffer_8k_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL6_DS_K_low_pwr_buffer_8k_Pos)

#define AON_REG_SRAM_CTRL6_DS_norm_pwr_buffer_8k_Pos                                                                     22U
#define AON_REG_SRAM_CTRL6_DS_norm_pwr_buffer_8k_Msk                                                                     (0x1UL << AON_REG_SRAM_CTRL6_DS_norm_pwr_buffer_8k_Pos)

#define AON_REG_SRAM_CTRL6_SD_norm_pwr_buffer_8k_Pos                                                                     23U
#define AON_REG_SRAM_CTRL6_SD_norm_pwr_buffer_8k_Msk                                                                     (0x1UL << AON_REG_SRAM_CTRL6_SD_norm_pwr_buffer_8k_Pos)

#define AON_REG_SRAM_CTRL6_LS_norm_pwr_buffer_8k_Pos                                                                     24U
#define AON_REG_SRAM_CTRL6_LS_norm_pwr_buffer_8k_Msk                                                                     (0x1UL << AON_REG_SRAM_CTRL6_LS_norm_pwr_buffer_8k_Pos)

#define AON_REG_SRAM_CTRL6_DS_UNK_norm_pwr_buffer_8k_Pos                                                                 25U
#define AON_REG_SRAM_CTRL6_DS_UNK_norm_pwr_buffer_8k_Msk                                                                 (0x1UL << AON_REG_SRAM_CTRL6_DS_UNK_norm_pwr_buffer_8k_Pos)

#define AON_REG_SRAM_CTRL6_DS_K_norm_pwr_buffer_8k_Pos                                                                   26U
#define AON_REG_SRAM_CTRL6_DS_K_norm_pwr_buffer_8k_Msk                                                                   (0x3UL << AON_REG_SRAM_CTRL6_DS_K_norm_pwr_buffer_8k_Pos)

#define AON_REG_SRAM_CTRL6_TEST1_buffer_8k_Pos                                                                           28U
#define AON_REG_SRAM_CTRL6_TEST1_buffer_8k_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL6_TEST1_buffer_8k_Pos)

#define AON_REG_SRAM_CTRL6_RSVD_1_Pos                                                                                    29U
#define AON_REG_SRAM_CTRL6_RSVD_1_Msk                                                                                    (0x1UL << AON_REG_SRAM_CTRL6_RSVD_1_Pos)

