rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL6_RSVD_Pos                                                                                      30U
#define AON_REG_SRAM_CTRL6_RSVD_Msk                                                                                      (0x3UL << AON_REG_SRAM_CTRL6_RSVD_Pos)

/* 0x844    0x4000_0844
    2:0     R/W     WPULSE_buffer_lv                                            3'b000
    5:3     R/W     WA_buffer_lv                                                3'b101
    9:6     R/W     RM_buffer_lv                                                4'b0010
    10      R/W     RME_buffer_lv                                               1'b1
    12:11   R/W     RA_buffer_lv                                                2'b00
    15:13   R       RSVD_1                                                      0
    18:16   R/W     WPULSE_buffer_hv                                            3'b000
    21:19   R/W     WA_buffer_hv                                                3'b100
    25:22   R/W     RM_buffer_hv                                                4'b0011
    26      R/W     RME_buffer_hv                                               1'b1
    28:27   R/W     RA_buffer_hv                                                2'b00
    31:29   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL7_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WPULSE_buffer_lv: 3;
        uint32_t WA_buffer_lv: 3;
        uint32_t RM_buffer_lv: 4;
        uint32_t RME_buffer_lv: 1;
        uint32_t RA_buffer_lv: 2;
        uint32_t RSVD_1: 3;
        uint32_t WPULSE_buffer_hv: 3;
        uint32_t WA_buffer_hv: 3;
        uint32_t RM_buffer_hv: 4;
        uint32_t RME_buffer_hv: 1;
        uint32_t RA_buffer_hv: 2;
        uint32_t RSVD: 3;
    };
} AON_REG_SRAM_CTRL7_TYPE;

/*0x4000_0844 AON_REG_SRAM_CTRL7*/
#define AON_REG_SRAM_CTRL7_WPULSE_buffer_lv_Pos                                                                          0U
#define AON_REG_SRAM_CTRL7_WPULSE_buffer_lv_Msk                                                                          (0x7UL << AON_REG_SRAM_CTRL7_WPULSE_buffer_lv_Pos)

#define AON_REG_SRAM_CTRL7_WA_buffer_lv_Pos                                                                              3U
#define AON_REG_SRAM_CTRL7_WA_buffer_lv_Msk                                                                              (0x7UL << AON_REG_SRAM_CTRL7_WA_buffer_lv_Pos)

#define AON_REG_SRAM_CTRL7_RM_buffer_lv_Pos                                                                              6U
#define AON_REG_SRAM_CTRL7_RM_buffer_lv_Msk                                                                              (0xFUL << AON_REG_SRAM_CTRL7_RM_buffer_lv_Pos)

#define AON_REG_SRAM_CTRL7_RME_buffer_lv_Pos                                                                             10U
#define AON_REG_SRAM_CTRL7_RME_buffer_lv_Msk                                                                             (0x1UL << AON_REG_SRAM_CTRL7_RME_buffer_lv_Pos)

#define AON_REG_SRAM_CTRL7_RA_buffer_lv_Pos                                                                              11U
#define AON_REG_SRAM_CTRL7_RA_buffer_lv_Msk                                                                              (0x3UL << AON_REG_SRAM_CTRL7_RA_buffer_lv_Pos)

#define AON_REG_SRAM_CTRL7_RSVD_1_Pos                                                                                    13U
#define AON_REG_SRAM_CTRL7_RSVD_1_Msk                                                                                    (0x7UL << AON_REG_SRAM_CTRL7_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL7_WPULSE_buffer_hv_Pos                                                                          16U
#define AON_REG_SRAM_CTRL7_WPULSE_buffer_hv_Msk                                                                          (0x7UL << AON_REG_SRAM_CTRL7_WPULSE_buffer_hv_Pos)

#define AON_REG_SRAM_CTRL7_WA_buffer_hv_Pos                                                                              19U
#define AON_REG_SRAM_CTRL7_WA_buffer_hv_Msk                                                                              (0x7UL << AON_REG_SRAM_CTRL7_WA_buffer_hv_Pos)

#define AON_REG_SRAM_CTRL7_RM_buffer_hv_Pos                                                                              22U
#define AON_REG_SRAM_CTRL7_RM_buffer_hv_Msk                                                                              (0xFUL << AON_REG_SRAM_CTRL7_RM_buffer_hv_Pos)

#define AON_REG_SRAM_CTRL7_RME_buffer_hv_Pos                                                                             26U
#define AON_REG_SRAM_CTRL7_RME_buffer_hv_Msk                                                                             (0x1UL << AON_REG_SRAM_CTRL7_RME_buffer_hv_Pos)

#define AON_REG_SRAM_CTRL7_RA_buffer_hv_Pos                                                                              27U
#define AON_REG_SRAM_CTRL7_RA_buffer_hv_Msk                                                                              (0x3UL << AON_REG_SRAM_CTRL7_RA_buffer_hv_Pos)

#define AON_REG_SRAM_CTRL7_RSVD_Pos                                                                                      29U
#define AON_REG_SRAM_CTRL7_RSVD_Msk                                                                                      (0x7UL << AON_REG_SRAM_CTRL7_RSVD_Pos)

/* 0x848    0x4000_0848
    4:0     R/W     DS_low_pwr_retsram                                          5'b0
    9:5     R/W     SD_low_pwr_retsram                                          5'b0
    14:10   R/W     LS_low_pwr_retsram                                          5'b0
    19:15   R/W     DS_norm_pwr_retsram                                         5'b0
    24:20   R/W     SD_norm_pwr_retsram                                         5'b0
    29:25   R/W     LS_norm_pwr_retsram                                         5'b0
    30      R/W     TEST1_retsram_0                                             1'b0
    31      R/W     TEST1_retsram_1                                             1'b0
 */
typedef union _AON_REG_SRAM_CTRL8_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DS_low_pwr_retsram: 5;
        uint32_t SD_low_pwr_retsram: 5;
        uint32_t LS_low_pwr_retsram: 5;
        uint32_t DS_norm_pwr_retsram: 5;
        uint32_t SD_norm_pwr_retsram: 5;
        uint32_t LS_norm_pwr_retsram: 5;
        uint32_t TEST1_retsram_0: 1;
        uint32_t TEST1_retsram_1: 1;
    };
} AON_REG_SRAM_CTRL8_TYPE;

/*0x4000_0848 AON_REG_SRAM_CTRL8*/
#define AON_REG_SRAM_CTRL8_DS_low_pwr_retsram_Pos                                                                        0U
#define AON_REG_SRAM_CTRL8_DS_low_pwr_retsram_Msk                                                                        (0x1FUL << AON_REG_SRAM_CTRL8_DS_low_pwr_retsram_Pos)

#define AON_REG_SRAM_CTRL8_SD_low_pwr_retsram_Pos                                                                        5U
#define AON_REG_SRAM_CTRL8_SD_low_pwr_retsram_Msk                                                                        (0x1FUL << AON_REG_SRAM_CTRL8_SD_low_pwr_retsram_Pos)

#define AON_REG_SRAM_CTRL8_LS_low_pwr_retsram_Pos                                                                        10U
#define AON_REG_SRAM_CTRL8_LS_low_pwr_retsram_Msk                                                                        (0x1FUL << AON_REG_SRAM_CTRL8_LS_low_pwr_retsram_Pos)

