rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL8_DS_norm_pwr_retsram_Pos                                                                       15U
#define AON_REG_SRAM_CTRL8_DS_norm_pwr_retsram_Msk                                                                       (0x1FUL << AON_REG_SRAM_CTRL8_DS_norm_pwr_retsram_Pos)

#define AON_REG_SRAM_CTRL8_SD_norm_pwr_retsram_Pos                                                                       20U
#define AON_REG_SRAM_CTRL8_SD_norm_pwr_retsram_Msk                                                                       (0x1FUL << AON_REG_SRAM_CTRL8_SD_norm_pwr_retsram_Pos)

#define AON_REG_SRAM_CTRL8_LS_norm_pwr_retsram_Pos                                                                       25U
#define AON_REG_SRAM_CTRL8_LS_norm_pwr_retsram_Msk                                                                       (0x1FUL << AON_REG_SRAM_CTRL8_LS_norm_pwr_retsram_Pos)

#define AON_REG_SRAM_CTRL8_TEST1_retsram_0_Pos                                                                           30U
#define AON_REG_SRAM_CTRL8_TEST1_retsram_0_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL8_TEST1_retsram_0_Pos)

#define AON_REG_SRAM_CTRL8_TEST1_retsram_1_Pos                                                                           31U
#define AON_REG_SRAM_CTRL8_TEST1_retsram_1_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL8_TEST1_retsram_1_Pos)

/* 0x84C    0x4000_084c
    0       R/W     DS_UNK_low_pwr_retsram_0                                    1'b0
    2:1     R/W     DS_K_low_pwr_retsram_0                                      2'b01
    3       R/W     DS_UNK_low_pwr_retsram_1                                    1'b0
    5:4     R/W     DS_K_low_pwr_retsram_1                                      2'b01
    6       R/W     DS_UNK_low_pwr_retsram_2                                    1'b0
    8:7     R/W     DS_K_low_pwr_retsram_2                                      2'b01
    9       R/W     DS_UNK_low_pwr_retsram_3                                    1'b0
    11:10   R/W     DS_K_low_pwr_retsram_3                                      2'b01
    12      R/W     DS_UNK_low_pwr_retsram_4                                    1'b0
    14:13   R/W     DS_K_low_pwr_retsram_4                                      2'b01
    15      R       RSVD_1                                                      0
    16      R/W     DS_UNK_norm_pwr_retsram_0                                   1'b0
    18:17   R/W     DS_K_norm_pwr_retsram_0                                     2'b01
    19      R/W     DS_UNK_norm_pwr_retsram_1                                   1'b0
    21:20   R/W     DS_K_norm_pwr_retsram_1                                     2'b01
    22      R/W     DS_UNK_norm_pwr_retsram_2                                   1'b0
    24:23   R/W     DS_K_norm_pwr_retsram_2                                     2'b01
    25      R/W     DS_UNK_norm_pwr_retsram_3                                   1'b0
    27:26   R/W     DS_K_norm_pwr_retsram_3                                     2'b01
    28      R/W     DS_UNK_norm_pwr_retsram_4                                   1'b0
    30:29   R/W     DS_K_norm_pwr_retsram_4                                     2'b01
    31      R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL9_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DS_UNK_low_pwr_retsram_0: 1;
        uint32_t DS_K_low_pwr_retsram_0: 2;
        uint32_t DS_UNK_low_pwr_retsram_1: 1;
        uint32_t DS_K_low_pwr_retsram_1: 2;
        uint32_t DS_UNK_low_pwr_retsram_2: 1;
        uint32_t DS_K_low_pwr_retsram_2: 2;
        uint32_t DS_UNK_low_pwr_retsram_3: 1;
        uint32_t DS_K_low_pwr_retsram_3: 2;
        uint32_t DS_UNK_low_pwr_retsram_4: 1;
        uint32_t DS_K_low_pwr_retsram_4: 2;
        uint32_t RSVD_1: 1;
        uint32_t DS_UNK_norm_pwr_retsram_0: 1;
        uint32_t DS_K_norm_pwr_retsram_0: 2;
        uint32_t DS_UNK_norm_pwr_retsram_1: 1;
        uint32_t DS_K_norm_pwr_retsram_1: 2;
        uint32_t DS_UNK_norm_pwr_retsram_2: 1;
        uint32_t DS_K_norm_pwr_retsram_2: 2;
        uint32_t DS_UNK_norm_pwr_retsram_3: 1;
        uint32_t DS_K_norm_pwr_retsram_3: 2;
        uint32_t DS_UNK_norm_pwr_retsram_4: 1;
        uint32_t DS_K_norm_pwr_retsram_4: 2;
        uint32_t RSVD: 1;
    };
} AON_REG_SRAM_CTRL9_TYPE;

/*0x4000_084c AON_REG_SRAM_CTRL9*/
#define AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_0_Pos                                                                  0U
#define AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_0_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_0_Pos)

#define AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_0_Pos                                                                    1U
#define AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_0_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_0_Pos)

#define AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_1_Pos                                                                  3U
#define AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_1_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_1_Pos)

#define AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_1_Pos                                                                    4U
#define AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_1_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_1_Pos)

#define AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_2_Pos                                                                  6U
#define AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_2_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_2_Pos)

#define AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_2_Pos                                                                    7U
#define AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_2_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_2_Pos)

