rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_3_Pos                                                                  9U
#define AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_3_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_3_Pos)

#define AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_3_Pos                                                                    10U
#define AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_3_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_3_Pos)

#define AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_4_Pos                                                                  12U
#define AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_4_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL9_DS_UNK_low_pwr_retsram_4_Pos)

#define AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_4_Pos                                                                    13U
#define AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_4_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL9_DS_K_low_pwr_retsram_4_Pos)

#define AON_REG_SRAM_CTRL9_RSVD_1_Pos                                                                                    15U
#define AON_REG_SRAM_CTRL9_RSVD_1_Msk                                                                                    (0x1UL << AON_REG_SRAM_CTRL9_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_0_Pos                                                                 16U
#define AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_0_Msk                                                                 (0x1UL << AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_0_Pos)

#define AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_0_Pos                                                                   17U
#define AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_0_Msk                                                                   (0x3UL << AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_0_Pos)

#define AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_1_Pos                                                                 19U
#define AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_1_Msk                                                                 (0x1UL << AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_1_Pos)

#define AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_1_Pos                                                                   20U
#define AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_1_Msk                                                                   (0x3UL << AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_1_Pos)

#define AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_2_Pos                                                                 22U
#define AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_2_Msk                                                                 (0x1UL << AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_2_Pos)

#define AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_2_Pos                                                                   23U
#define AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_2_Msk                                                                   (0x3UL << AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_2_Pos)

#define AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_3_Pos                                                                 25U
#define AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_3_Msk                                                                 (0x1UL << AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_3_Pos)

#define AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_3_Pos                                                                   26U
#define AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_3_Msk                                                                   (0x3UL << AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_3_Pos)

#define AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_4_Pos                                                                 28U
#define AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_4_Msk                                                                 (0x1UL << AON_REG_SRAM_CTRL9_DS_UNK_norm_pwr_retsram_4_Pos)

#define AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_4_Pos                                                                   29U
#define AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_4_Msk                                                                   (0x3UL << AON_REG_SRAM_CTRL9_DS_K_norm_pwr_retsram_4_Pos)

#define AON_REG_SRAM_CTRL9_RSVD_Pos                                                                                      31U
#define AON_REG_SRAM_CTRL9_RSVD_Msk                                                                                      (0x1UL << AON_REG_SRAM_CTRL9_RSVD_Pos)

/* 0x850    0x4000_0850
    0       R/W     DS_BKEN_retsram_0                                           1'b0
    2:1     R/W     DS_BK_retsram_0                                             2'b11
    3       R/W     DS_BKEN_retsram_1                                           1'b0
    5:4     R/W     DS_BK_retsram_1                                             2'b11
    6       R/W     DS_BKEN_retsram_2                                           1'b0
    8:7     R/W     DS_BK_retsram_2                                             2'b11
    9       R/W     DS_BKEN_retsram_3                                           1'b0
    11:10   R/W     DS_BK_retsram_3                                             2'b11
    12      R/W     DS_BKEN_retsram_4                                           1'b0
    14:13   R/W     DS_BK_retsram_4                                             2'b11
    31:15   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL10_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DS_BKEN_retsram_0: 1;
        uint32_t DS_BK_retsram_0: 2;
        uint32_t DS_BKEN_retsram_1: 1;
        uint32_t DS_BK_retsram_1: 2;
        uint32_t DS_BKEN_retsram_2: 1;
        uint32_t DS_BK_retsram_2: 2;
        uint32_t DS_BKEN_retsram_3: 1;
        uint32_t DS_BK_retsram_3: 2;
        uint32_t DS_BKEN_retsram_4: 1;
        uint32_t DS_BK_retsram_4: 2;
        uint32_t RSVD: 17;
    };
} AON_REG_SRAM_CTRL10_TYPE;

/*0x4000_0850 AON_REG_SRAM_CTRL10*/
#define AON_REG_SRAM_CTRL10_DS_BKEN_retsram_0_Pos                                                                        0U
#define AON_REG_SRAM_CTRL10_DS_BKEN_retsram_0_Msk                                                                        (0x1UL << AON_REG_SRAM_CTRL10_DS_BKEN_retsram_0_Pos)

#define AON_REG_SRAM_CTRL10_DS_BK_retsram_0_Pos                                                                          1U
#define AON_REG_SRAM_CTRL10_DS_BK_retsram_0_Msk                                                                          (0x3UL << AON_REG_SRAM_CTRL10_DS_BK_retsram_0_Pos)

#define AON_REG_SRAM_CTRL10_DS_BKEN_retsram_1_Pos                                                                        3U
#define AON_REG_SRAM_CTRL10_DS_BKEN_retsram_1_Msk                                                                        (0x1UL << AON_REG_SRAM_CTRL10_DS_BKEN_retsram_1_Pos)

#define AON_REG_SRAM_CTRL10_DS_BK_retsram_1_Pos                                                                          4U
#define AON_REG_SRAM_CTRL10_DS_BK_retsram_1_Msk                                                                          (0x3UL << AON_REG_SRAM_CTRL10_DS_BK_retsram_1_Pos)

#define AON_REG_SRAM_CTRL10_DS_BKEN_retsram_2_Pos                                                                        6U
#define AON_REG_SRAM_CTRL10_DS_BKEN_retsram_2_Msk                                                                        (0x1UL << AON_REG_SRAM_CTRL10_DS_BKEN_retsram_2_Pos)

#define AON_REG_SRAM_CTRL10_DS_BK_retsram_2_Pos                                                                          7U
#define AON_REG_SRAM_CTRL10_DS_BK_retsram_2_Msk                                                                          (0x3UL << AON_REG_SRAM_CTRL10_DS_BK_retsram_2_Pos)

#define AON_REG_SRAM_CTRL10_DS_BKEN_retsram_3_Pos                                                                        9U
#define AON_REG_SRAM_CTRL10_DS_BKEN_retsram_3_Msk                                                                        (0x1UL << AON_REG_SRAM_CTRL10_DS_BKEN_retsram_3_Pos)

#define AON_REG_SRAM_CTRL10_DS_BK_retsram_3_Pos                                                                          10U
#define AON_REG_SRAM_CTRL10_DS_BK_retsram_3_Msk                                                                          (0x3UL << AON_REG_SRAM_CTRL10_DS_BK_retsram_3_Pos)

#define AON_REG_SRAM_CTRL10_DS_BKEN_retsram_4_Pos                                                                        12U
#define AON_REG_SRAM_CTRL10_DS_BKEN_retsram_4_Msk                                                                        (0x1UL << AON_REG_SRAM_CTRL10_DS_BKEN_retsram_4_Pos)

