rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL10_DS_BK_retsram_4_Pos                                                                          13U
#define AON_REG_SRAM_CTRL10_DS_BK_retsram_4_Msk                                                                          (0x3UL << AON_REG_SRAM_CTRL10_DS_BK_retsram_4_Pos)

#define AON_REG_SRAM_CTRL10_RSVD_Pos                                                                                     15U
#define AON_REG_SRAM_CTRL10_RSVD_Msk                                                                                     (0x1FFFFUL << AON_REG_SRAM_CTRL10_RSVD_Pos)

/* 0x854    0x4000_0854
    2:0     R/W     WPULSE_retsram_0_lv                                         3'b000
    5:3     R/W     WA_retsram_0_lv                                             3'b101
    9:6     R/W     RM_retsram_0_lv                                             4'b0010
    10      R/W     RME_retsram_0_lv                                            1'b1
    12:11   R/W     RA_retsram_0_lv                                             2'b00
    15:13   R/W     RSVD_1                                                      0
    18:16   R/W     WPULSE_retsram_0_hv                                         3'b000
    21:19   R/W     WA_retsram_0_hv                                             3'b100
    25:22   R/W     RM_retsram_0_hv                                             4'b0011
    26      R/W     RME_retsram_0_hv                                            1'b1
    28:27   R/W     RA_retsram_0_hv                                             2'b00
    31:29   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL11_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WPULSE_retsram_0_lv: 3;
        uint32_t WA_retsram_0_lv: 3;
        uint32_t RM_retsram_0_lv: 4;
        uint32_t RME_retsram_0_lv: 1;
        uint32_t RA_retsram_0_lv: 2;
        uint32_t RSVD_1: 3;
        uint32_t WPULSE_retsram_0_hv: 3;
        uint32_t WA_retsram_0_hv: 3;
        uint32_t RM_retsram_0_hv: 4;
        uint32_t RME_retsram_0_hv: 1;
        uint32_t RA_retsram_0_hv: 2;
        uint32_t RSVD: 3;
    };
} AON_REG_SRAM_CTRL11_TYPE;

/*0x4000_0854 AON_REG_SRAM_CTRL11*/
#define AON_REG_SRAM_CTRL11_WPULSE_retsram_0_lv_Pos                                                                      0U
#define AON_REG_SRAM_CTRL11_WPULSE_retsram_0_lv_Msk                                                                      (0x7UL << AON_REG_SRAM_CTRL11_WPULSE_retsram_0_lv_Pos)

#define AON_REG_SRAM_CTRL11_WA_retsram_0_lv_Pos                                                                          3U
#define AON_REG_SRAM_CTRL11_WA_retsram_0_lv_Msk                                                                          (0x7UL << AON_REG_SRAM_CTRL11_WA_retsram_0_lv_Pos)

#define AON_REG_SRAM_CTRL11_RM_retsram_0_lv_Pos                                                                          6U
#define AON_REG_SRAM_CTRL11_RM_retsram_0_lv_Msk                                                                          (0xFUL << AON_REG_SRAM_CTRL11_RM_retsram_0_lv_Pos)

#define AON_REG_SRAM_CTRL11_RME_retsram_0_lv_Pos                                                                         10U
#define AON_REG_SRAM_CTRL11_RME_retsram_0_lv_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL11_RME_retsram_0_lv_Pos)

#define AON_REG_SRAM_CTRL11_RA_retsram_0_lv_Pos                                                                          11U
#define AON_REG_SRAM_CTRL11_RA_retsram_0_lv_Msk                                                                          (0x3UL << AON_REG_SRAM_CTRL11_RA_retsram_0_lv_Pos)

#define AON_REG_SRAM_CTRL11_RSVD_1_Pos                                                                                   13U
#define AON_REG_SRAM_CTRL11_RSVD_1_Msk                                                                                   (0x7UL << AON_REG_SRAM_CTRL11_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL11_WPULSE_retsram_0_hv_Pos                                                                      16U
#define AON_REG_SRAM_CTRL11_WPULSE_retsram_0_hv_Msk                                                                      (0x7UL << AON_REG_SRAM_CTRL11_WPULSE_retsram_0_hv_Pos)

#define AON_REG_SRAM_CTRL11_WA_retsram_0_hv_Pos                                                                          19U
#define AON_REG_SRAM_CTRL11_WA_retsram_0_hv_Msk                                                                          (0x7UL << AON_REG_SRAM_CTRL11_WA_retsram_0_hv_Pos)

#define AON_REG_SRAM_CTRL11_RM_retsram_0_hv_Pos                                                                          22U
#define AON_REG_SRAM_CTRL11_RM_retsram_0_hv_Msk                                                                          (0xFUL << AON_REG_SRAM_CTRL11_RM_retsram_0_hv_Pos)

#define AON_REG_SRAM_CTRL11_RME_retsram_0_hv_Pos                                                                         26U
#define AON_REG_SRAM_CTRL11_RME_retsram_0_hv_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL11_RME_retsram_0_hv_Pos)

#define AON_REG_SRAM_CTRL11_RA_retsram_0_hv_Pos                                                                          27U
#define AON_REG_SRAM_CTRL11_RA_retsram_0_hv_Msk                                                                          (0x3UL << AON_REG_SRAM_CTRL11_RA_retsram_0_hv_Pos)

#define AON_REG_SRAM_CTRL11_RSVD_Pos                                                                                     29U
#define AON_REG_SRAM_CTRL11_RSVD_Msk                                                                                     (0x7UL << AON_REG_SRAM_CTRL11_RSVD_Pos)

/* 0x858    0x4000_0858
    2:0     R/W     WPULSE_retsram_1_lv                                         3'b000
    5:3     R/W     WA_retsram_1_lv                                             3'b101
    9:6     R/W     RM_retsram_1_lv                                             4'b0010
    10      R/W     RME_retsram_1_lv                                            1'b1
    12:11   R/W     RA_retsram_1_lv                                             2'b00
    15:13   R       RSVD_1                                                      0
    18:16   R/W     WPULSE_retsram_1_hv                                         3'b000
    21:19   R/W     WA_retsram_1_hv                                             3'b100
    25:22   R/W     RM_retsram_1_hv                                             4'b0011
    26      R/W     RME_retsram_1_hv                                            1'b1
    28:27   R/W     RA_retsram_1_hv                                             2'b00
    31:29   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL12_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WPULSE_retsram_1_lv: 3;
        uint32_t WA_retsram_1_lv: 3;
        uint32_t RM_retsram_1_lv: 4;
        uint32_t RME_retsram_1_lv: 1;
        uint32_t RA_retsram_1_lv: 2;
        uint32_t RSVD_1: 3;
        uint32_t WPULSE_retsram_1_hv: 3;
        uint32_t WA_retsram_1_hv: 3;
        uint32_t RM_retsram_1_hv: 4;
        uint32_t RME_retsram_1_hv: 1;
        uint32_t RA_retsram_1_hv: 2;
        uint32_t RSVD: 3;
    };
} AON_REG_SRAM_CTRL12_TYPE;

/*0x4000_0858 AON_REG_SRAM_CTRL12*/
#define AON_REG_SRAM_CTRL12_WPULSE_retsram_1_lv_Pos                                                                      0U
#define AON_REG_SRAM_CTRL12_WPULSE_retsram_1_lv_Msk                                                                      (0x7UL << AON_REG_SRAM_CTRL12_WPULSE_retsram_1_lv_Pos)

#define AON_REG_SRAM_CTRL12_WA_retsram_1_lv_Pos                                                                          3U
#define AON_REG_SRAM_CTRL12_WA_retsram_1_lv_Msk                                                                          (0x7UL << AON_REG_SRAM_CTRL12_WA_retsram_1_lv_Pos)

#define AON_REG_SRAM_CTRL12_RM_retsram_1_lv_Pos                                                                          6U
#define AON_REG_SRAM_CTRL12_RM_retsram_1_lv_Msk                                                                          (0xFUL << AON_REG_SRAM_CTRL12_RM_retsram_1_lv_Pos)

#define AON_REG_SRAM_CTRL12_RME_retsram_1_lv_Pos                                                                         10U
#define AON_REG_SRAM_CTRL12_RME_retsram_1_lv_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL12_RME_retsram_1_lv_Pos)

#define AON_REG_SRAM_CTRL12_RA_retsram_1_lv_Pos                                                                          11U
#define AON_REG_SRAM_CTRL12_RA_retsram_1_lv_Msk                                                                          (0x3UL << AON_REG_SRAM_CTRL12_RA_retsram_1_lv_Pos)

#define AON_REG_SRAM_CTRL12_RSVD_1_Pos                                                                                   13U
#define AON_REG_SRAM_CTRL12_RSVD_1_Msk                                                                                   (0x7UL << AON_REG_SRAM_CTRL12_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL12_WPULSE_retsram_1_hv_Pos                                                                      16U
#define AON_REG_SRAM_CTRL12_WPULSE_retsram_1_hv_Msk                                                                      (0x7UL << AON_REG_SRAM_CTRL12_WPULSE_retsram_1_hv_Pos)

#define AON_REG_SRAM_CTRL12_WA_retsram_1_hv_Pos                                                                          19U
#define AON_REG_SRAM_CTRL12_WA_retsram_1_hv_Msk                                                                          (0x7UL << AON_REG_SRAM_CTRL12_WA_retsram_1_hv_Pos)

