rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL12_RM_retsram_1_hv_Pos                                                                          22U
#define AON_REG_SRAM_CTRL12_RM_retsram_1_hv_Msk                                                                          (0xFUL << AON_REG_SRAM_CTRL12_RM_retsram_1_hv_Pos)

#define AON_REG_SRAM_CTRL12_RME_retsram_1_hv_Pos                                                                         26U
#define AON_REG_SRAM_CTRL12_RME_retsram_1_hv_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL12_RME_retsram_1_hv_Pos)

#define AON_REG_SRAM_CTRL12_RA_retsram_1_hv_Pos                                                                          27U
#define AON_REG_SRAM_CTRL12_RA_retsram_1_hv_Msk                                                                          (0x3UL << AON_REG_SRAM_CTRL12_RA_retsram_1_hv_Pos)

#define AON_REG_SRAM_CTRL12_RSVD_Pos                                                                                     29U
#define AON_REG_SRAM_CTRL12_RSVD_Msk                                                                                     (0x7UL << AON_REG_SRAM_CTRL12_RSVD_Pos)

/* 0x85C    0x4000_085c
    0       R/W     DS_UNK_low_pwr_cache_0                                      1'b0
    2:1     R/W     DS_K_low_pwr_cache_0                                        2'b01
    3       R/W     DS_UNK_low_pwr_cache_1                                      1'b0
    5:4     R/W     DS_K_low_pwr_cache_1                                        2'b01
    6       R/W     DS_UNK_low_pwr_cache_2                                      1'b0
    8:7     R/W     DS_K_low_pwr_cache_2                                        2'b01
    9       R/W     DS_UNK_low_pwr_cache_3                                      1'b0
    11:10   R/W     DS_K_low_pwr_cache_3                                        2'b01
    12      R/W     DS_UNK_low_pwr_cache_4                                      1'b0
    14:13   R/W     DS_K_low_pwr_cache_4                                        2'b01
    15      R/W     DS_UNK_low_pwr_cache_5                                      1'b0
    17:16   R/W     DS_K_low_pwr_cache_5                                        2'b01
    18      R/W     DS_UNK_low_pwr_cache_6                                      1'b0
    20:19   R/W     DS_K_low_pwr_cache_6                                        2'b01
    21      R/W     DS_UNK_low_pwr_cache_7                                      1'b0
    23:22   R/W     DS_K_low_pwr_cache_7                                        2'b01
    24      R/W     DS_UNK_low_pwr_cache_8                                      1'b0
    26:25   R/W     DS_K_low_pwr_cache_8                                        2'b01
    31:27   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL13_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DS_UNK_low_pwr_cache_0: 1;
        uint32_t DS_K_low_pwr_cache_0: 2;
        uint32_t DS_UNK_low_pwr_cache_1: 1;
        uint32_t DS_K_low_pwr_cache_1: 2;
        uint32_t DS_UNK_low_pwr_cache_2: 1;
        uint32_t DS_K_low_pwr_cache_2: 2;
        uint32_t DS_UNK_low_pwr_cache_3: 1;
        uint32_t DS_K_low_pwr_cache_3: 2;
        uint32_t DS_UNK_low_pwr_cache_4: 1;
        uint32_t DS_K_low_pwr_cache_4: 2;
        uint32_t DS_UNK_low_pwr_cache_5: 1;
        uint32_t DS_K_low_pwr_cache_5: 2;
        uint32_t DS_UNK_low_pwr_cache_6: 1;
        uint32_t DS_K_low_pwr_cache_6: 2;
        uint32_t DS_UNK_low_pwr_cache_7: 1;
        uint32_t DS_K_low_pwr_cache_7: 2;
        uint32_t DS_UNK_low_pwr_cache_8: 1;
        uint32_t DS_K_low_pwr_cache_8: 2;
        uint32_t RSVD: 5;
    };
} AON_REG_SRAM_CTRL13_TYPE;

/*0x4000_085c AON_REG_SRAM_CTRL13*/
#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_0_Pos                                                                   0U
#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_0_Msk                                                                   (0x1UL << AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_0_Pos)

#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_0_Pos                                                                     1U
#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_0_Msk                                                                     (0x3UL << AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_0_Pos)

#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_1_Pos                                                                   3U
#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_1_Msk                                                                   (0x1UL << AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_1_Pos)

#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_1_Pos                                                                     4U
#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_1_Msk                                                                     (0x3UL << AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_1_Pos)

#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_2_Pos                                                                   6U
#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_2_Msk                                                                   (0x1UL << AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_2_Pos)

#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_2_Pos                                                                     7U
#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_2_Msk                                                                     (0x3UL << AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_2_Pos)

#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_3_Pos                                                                   9U
#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_3_Msk                                                                   (0x1UL << AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_3_Pos)

#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_3_Pos                                                                     10U
#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_3_Msk                                                                     (0x3UL << AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_3_Pos)

