rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_4_Pos                                                                   12U
#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_4_Msk                                                                   (0x1UL << AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_4_Pos)

#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_4_Pos                                                                     13U
#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_4_Msk                                                                     (0x3UL << AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_4_Pos)

#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_5_Pos                                                                   15U
#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_5_Msk                                                                   (0x1UL << AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_5_Pos)

#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_5_Pos                                                                     16U
#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_5_Msk                                                                     (0x3UL << AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_5_Pos)

#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_6_Pos                                                                   18U
#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_6_Msk                                                                   (0x1UL << AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_6_Pos)

#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_6_Pos                                                                     19U
#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_6_Msk                                                                     (0x3UL << AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_6_Pos)

#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_7_Pos                                                                   21U
#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_7_Msk                                                                   (0x1UL << AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_7_Pos)

#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_7_Pos                                                                     22U
#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_7_Msk                                                                     (0x3UL << AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_7_Pos)

#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_8_Pos                                                                   24U
#define AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_8_Msk                                                                   (0x1UL << AON_REG_SRAM_CTRL13_DS_UNK_low_pwr_cache_8_Pos)

#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_8_Pos                                                                     25U
#define AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_8_Msk                                                                     (0x3UL << AON_REG_SRAM_CTRL13_DS_K_low_pwr_cache_8_Pos)

#define AON_REG_SRAM_CTRL13_RSVD_Pos                                                                                     27U
#define AON_REG_SRAM_CTRL13_RSVD_Msk                                                                                     (0x1FUL << AON_REG_SRAM_CTRL13_RSVD_Pos)

/* 0x860    0x4000_0860
    0       R/W     DS_UNK_norm_pwr_cache_0                                     1'b0
    2:1     R/W     DS_K_norm_pwr_cache_0                                       2'b01
    3       R/W     DS_UNK_norm_pwr_cache_1                                     1'b0
    5:4     R/W     DS_K_norm_pwr_cache_1                                       2'b01
    6       R/W     DS_UNK_norm_pwr_cache_2                                     1'b0
    8:7     R/W     DS_K_norm_pwr_cache_2                                       2'b01
    9       R/W     DS_UNK_norm_pwr_cache_3                                     1'b0
    11:10   R/W     DS_K_norm_pwr_cache_3                                       2'b01
    12      R/W     DS_UNK_norm_pwr_cache_4                                     1'b0
    14:13   R/W     DS_K_norm_pwr_cache_4                                       2'b01
    15      R/W     DS_UNK_norm_pwr_cache_5                                     1'b0
    17:16   R/W     DS_K_norm_pwr_cache_5                                       2'b01
    18      R/W     DS_UNK_norm_pwr_cache_6                                     1'b0
    20:19   R/W     DS_K_norm_pwr_cache_6                                       2'b01
    21      R/W     DS_UNK_norm_pwr_cache_7                                     1'b0
    23:22   R/W     DS_K_norm_pwr_cache_7                                       2'b01
    24      R/W     DS_UNK_norm_pwr_cache_8                                     1'b0
    26:25   R/W     DS_K_norm_pwr_cache_8                                       2'b01
    31:27   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL14_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DS_UNK_norm_pwr_cache_0: 1;
        uint32_t DS_K_norm_pwr_cache_0: 2;
        uint32_t DS_UNK_norm_pwr_cache_1: 1;
        uint32_t DS_K_norm_pwr_cache_1: 2;
        uint32_t DS_UNK_norm_pwr_cache_2: 1;
        uint32_t DS_K_norm_pwr_cache_2: 2;
        uint32_t DS_UNK_norm_pwr_cache_3: 1;
        uint32_t DS_K_norm_pwr_cache_3: 2;
        uint32_t DS_UNK_norm_pwr_cache_4: 1;
        uint32_t DS_K_norm_pwr_cache_4: 2;
        uint32_t DS_UNK_norm_pwr_cache_5: 1;
        uint32_t DS_K_norm_pwr_cache_5: 2;
        uint32_t DS_UNK_norm_pwr_cache_6: 1;
        uint32_t DS_K_norm_pwr_cache_6: 2;
        uint32_t DS_UNK_norm_pwr_cache_7: 1;
        uint32_t DS_K_norm_pwr_cache_7: 2;
        uint32_t DS_UNK_norm_pwr_cache_8: 1;
        uint32_t DS_K_norm_pwr_cache_8: 2;
        uint32_t RSVD: 5;
    };
} AON_REG_SRAM_CTRL14_TYPE;

/*0x4000_0860 AON_REG_SRAM_CTRL14*/
#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_0_Pos                                                                  0U
#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_0_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_0_Pos)

#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_0_Pos                                                                    1U
#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_0_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_0_Pos)

#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_1_Pos                                                                  3U
#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_1_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_1_Pos)

#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_1_Pos                                                                    4U
#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_1_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_1_Pos)

#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_2_Pos                                                                  6U
#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_2_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_2_Pos)

#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_2_Pos                                                                    7U
#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_2_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_2_Pos)

