rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_3_Pos                                                                  9U
#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_3_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_3_Pos)

#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_3_Pos                                                                    10U
#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_3_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_3_Pos)

#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_4_Pos                                                                  12U
#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_4_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_4_Pos)

#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_4_Pos                                                                    13U
#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_4_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_4_Pos)

#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_5_Pos                                                                  15U
#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_5_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_5_Pos)

#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_5_Pos                                                                    16U
#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_5_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_5_Pos)

#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_6_Pos                                                                  18U
#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_6_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_6_Pos)

#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_6_Pos                                                                    19U
#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_6_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_6_Pos)

#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_7_Pos                                                                  21U
#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_7_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_7_Pos)

#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_7_Pos                                                                    22U
#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_7_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_7_Pos)

#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_8_Pos                                                                  24U
#define AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_8_Msk                                                                  (0x1UL << AON_REG_SRAM_CTRL14_DS_UNK_norm_pwr_cache_8_Pos)

#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_8_Pos                                                                    25U
#define AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_8_Msk                                                                    (0x3UL << AON_REG_SRAM_CTRL14_DS_K_norm_pwr_cache_8_Pos)

#define AON_REG_SRAM_CTRL14_RSVD_Pos                                                                                     27U
#define AON_REG_SRAM_CTRL14_RSVD_Msk                                                                                     (0x1FUL << AON_REG_SRAM_CTRL14_RSVD_Pos)

/* 0x864    0x4000_0864
    0       R/W     DS_low_pwr_cache_0                                          1'b0
    1       R/W     SD_low_pwr_cache_0                                          1'b0
    2       R/W     LS_low_pwr_cache_0                                          1'b0
    3       R/W     DS_low_pwr_cache_1                                          1'b0
    4       R/W     SD_low_pwr_cache_1                                          1'b0
    5       R/W     LS_low_pwr_cache_1                                          1'b0
    6       R/W     DS_low_pwr_cache_2                                          1'b0
    7       R/W     SD_low_pwr_cache_2                                          1'b0
    8       R/W     LS_low_pwr_cache_2                                          1'b0
    9       R/W     DS_low_pwr_cache_3                                          1'b0
    10      R/W     SD_low_pwr_cache_3                                          1'b0
    11      R/W     LS_low_pwr_cache_3                                          1'b0
    15:12   R       RSVD_1                                                      0
    16      R/W     DS_norm_pwr_cache_0                                         1'b0
    17      R/W     SD_norm_pwr_cache_0                                         1'b0
    18      R/W     LS_norm_pwr_cache_0                                         1'b0
    19      R/W     DS_norm_pwr_cache_1                                         1'b0
    20      R/W     SD_norm_pwr_cache_1                                         1'b0
    21      R/W     LS_norm_pwr_cache_1                                         1'b0
    22      R/W     DS_norm_pwr_cache_2                                         1'b0
    23      R/W     SD_norm_pwr_cache_2                                         1'b0
    24      R/W     LS_norm_pwr_cache_2                                         1'b0
    25      R/W     DS_norm_pwr_cache_3                                         1'b0
    26      R/W     SD_norm_pwr_cache_3                                         1'b0
    27      R/W     LS_norm_pwr_cache_3                                         1'b0
    31:28   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL15_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DS_low_pwr_cache_0: 1;
        uint32_t SD_low_pwr_cache_0: 1;
        uint32_t LS_low_pwr_cache_0: 1;
        uint32_t DS_low_pwr_cache_1: 1;
        uint32_t SD_low_pwr_cache_1: 1;
        uint32_t LS_low_pwr_cache_1: 1;
        uint32_t DS_low_pwr_cache_2: 1;
        uint32_t SD_low_pwr_cache_2: 1;
        uint32_t LS_low_pwr_cache_2: 1;
        uint32_t DS_low_pwr_cache_3: 1;
        uint32_t SD_low_pwr_cache_3: 1;
        uint32_t LS_low_pwr_cache_3: 1;
        uint32_t RSVD_1: 4;
        uint32_t DS_norm_pwr_cache_0: 1;
        uint32_t SD_norm_pwr_cache_0: 1;
        uint32_t LS_norm_pwr_cache_0: 1;
        uint32_t DS_norm_pwr_cache_1: 1;
        uint32_t SD_norm_pwr_cache_1: 1;
        uint32_t LS_norm_pwr_cache_1: 1;
        uint32_t DS_norm_pwr_cache_2: 1;
        uint32_t SD_norm_pwr_cache_2: 1;
        uint32_t LS_norm_pwr_cache_2: 1;
        uint32_t DS_norm_pwr_cache_3: 1;
        uint32_t SD_norm_pwr_cache_3: 1;
        uint32_t LS_norm_pwr_cache_3: 1;
        uint32_t RSVD: 4;
    };
} AON_REG_SRAM_CTRL15_TYPE;

/*0x4000_0864 AON_REG_SRAM_CTRL15*/
#define AON_REG_SRAM_CTRL15_DS_low_pwr_cache_0_Pos                                                                       0U
#define AON_REG_SRAM_CTRL15_DS_low_pwr_cache_0_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_DS_low_pwr_cache_0_Pos)

#define AON_REG_SRAM_CTRL15_SD_low_pwr_cache_0_Pos                                                                       1U
#define AON_REG_SRAM_CTRL15_SD_low_pwr_cache_0_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_SD_low_pwr_cache_0_Pos)

