rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL15_LS_low_pwr_cache_0_Pos                                                                       2U
#define AON_REG_SRAM_CTRL15_LS_low_pwr_cache_0_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_LS_low_pwr_cache_0_Pos)

#define AON_REG_SRAM_CTRL15_DS_low_pwr_cache_1_Pos                                                                       3U
#define AON_REG_SRAM_CTRL15_DS_low_pwr_cache_1_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_DS_low_pwr_cache_1_Pos)

#define AON_REG_SRAM_CTRL15_SD_low_pwr_cache_1_Pos                                                                       4U
#define AON_REG_SRAM_CTRL15_SD_low_pwr_cache_1_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_SD_low_pwr_cache_1_Pos)

#define AON_REG_SRAM_CTRL15_LS_low_pwr_cache_1_Pos                                                                       5U
#define AON_REG_SRAM_CTRL15_LS_low_pwr_cache_1_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_LS_low_pwr_cache_1_Pos)

#define AON_REG_SRAM_CTRL15_DS_low_pwr_cache_2_Pos                                                                       6U
#define AON_REG_SRAM_CTRL15_DS_low_pwr_cache_2_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_DS_low_pwr_cache_2_Pos)

#define AON_REG_SRAM_CTRL15_SD_low_pwr_cache_2_Pos                                                                       7U
#define AON_REG_SRAM_CTRL15_SD_low_pwr_cache_2_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_SD_low_pwr_cache_2_Pos)

#define AON_REG_SRAM_CTRL15_LS_low_pwr_cache_2_Pos                                                                       8U
#define AON_REG_SRAM_CTRL15_LS_low_pwr_cache_2_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_LS_low_pwr_cache_2_Pos)

#define AON_REG_SRAM_CTRL15_DS_low_pwr_cache_3_Pos                                                                       9U
#define AON_REG_SRAM_CTRL15_DS_low_pwr_cache_3_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_DS_low_pwr_cache_3_Pos)

#define AON_REG_SRAM_CTRL15_SD_low_pwr_cache_3_Pos                                                                       10U
#define AON_REG_SRAM_CTRL15_SD_low_pwr_cache_3_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_SD_low_pwr_cache_3_Pos)

#define AON_REG_SRAM_CTRL15_LS_low_pwr_cache_3_Pos                                                                       11U
#define AON_REG_SRAM_CTRL15_LS_low_pwr_cache_3_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL15_LS_low_pwr_cache_3_Pos)

#define AON_REG_SRAM_CTRL15_RSVD_1_Pos                                                                                   12U
#define AON_REG_SRAM_CTRL15_RSVD_1_Msk                                                                                   (0xFUL << AON_REG_SRAM_CTRL15_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_0_Pos                                                                      16U
#define AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_0_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_0_Pos)

#define AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_0_Pos                                                                      17U
#define AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_0_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_0_Pos)

#define AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_0_Pos                                                                      18U
#define AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_0_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_0_Pos)

#define AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_1_Pos                                                                      19U
#define AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_1_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_1_Pos)

#define AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_1_Pos                                                                      20U
#define AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_1_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_1_Pos)

#define AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_1_Pos                                                                      21U
#define AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_1_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_1_Pos)

#define AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_2_Pos                                                                      22U
#define AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_2_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_2_Pos)

#define AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_2_Pos                                                                      23U
#define AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_2_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_2_Pos)

#define AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_2_Pos                                                                      24U
#define AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_2_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_2_Pos)

#define AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_3_Pos                                                                      25U
#define AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_3_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_DS_norm_pwr_cache_3_Pos)

#define AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_3_Pos                                                                      26U
#define AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_3_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_SD_norm_pwr_cache_3_Pos)

#define AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_3_Pos                                                                      27U
#define AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_3_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL15_LS_norm_pwr_cache_3_Pos)

#define AON_REG_SRAM_CTRL15_RSVD_Pos                                                                                     28U
#define AON_REG_SRAM_CTRL15_RSVD_Msk                                                                                     (0xFUL << AON_REG_SRAM_CTRL15_RSVD_Pos)

/* 0x868    0x4000_0868
    0       R/W     DS_low_pwr_cache_4                                          1'b0
    1       R/W     SD_low_pwr_cache_4                                          1'b0
    2       R/W     LS_low_pwr_cache_4                                          1'b0
    3       R/W     DS_low_pwr_cache_5                                          1'b0
    4       R/W     SD_low_pwr_cache_5                                          1'b0
    5       R/W     LS_low_pwr_cache_5                                          1'b0
    6       R/W     DS_low_pwr_cache_6                                          1'b0
    7       R/W     SD_low_pwr_cache_6                                          1'b0
    8       R/W     LS_low_pwr_cache_6                                          1'b0
    9       R/W     DS_low_pwr_cache_7                                          1'b0
    10      R/W     SD_low_pwr_cache_7                                          1'b0
    11      R/W     LS_low_pwr_cache_7                                          1'b0
    12      R/W     DS_low_pwr_cache_8                                          1'b0
    13      R/W     SD_low_pwr_cache_8                                          1'b0
    14      R/W     LS_low_pwr_cache_8                                          1'b0
    15      R       RSVD_1                                                      0
    16      R/W     DS_norm_pwr_cache_4                                         1'b0
    17      R/W     SD_norm_pwr_cache_4                                         1'b0
    18      R/W     LS_norm_pwr_cache_4                                         1'b0
    19      R/W     DS_norm_pwr_cache_5                                         1'b0
    20      R/W     SD_norm_pwr_cache_5                                         1'b0
    21      R/W     LS_norm_pwr_cache_5                                         1'b0
    22      R/W     DS_norm_pwr_cache_6                                         1'b0
    23      R/W     SD_norm_pwr_cache_6                                         1'b0
    24      R/W     LS_norm_pwr_cache_6                                         1'b0
    25      R/W     DS_norm_pwr_cache_7                                         1'b0
    26      R/W     SD_norm_pwr_cache_7                                         1'b0
    27      R/W     LS_norm_pwr_cache_7                                         1'b0
    28      R/W     DS_norm_pwr_cache_8                                         1'b0
    29      R/W     SD_norm_pwr_cache_8                                         1'b0
    30      R/W     LS_norm_pwr_cache_8                                         1'b0
    31      R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL16_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DS_low_pwr_cache_4: 1;
        uint32_t SD_low_pwr_cache_4: 1;
        uint32_t LS_low_pwr_cache_4: 1;
        uint32_t DS_low_pwr_cache_5: 1;
        uint32_t SD_low_pwr_cache_5: 1;
        uint32_t LS_low_pwr_cache_5: 1;
        uint32_t DS_low_pwr_cache_6: 1;
        uint32_t SD_low_pwr_cache_6: 1;
        uint32_t LS_low_pwr_cache_6: 1;
        uint32_t DS_low_pwr_cache_7: 1;
        uint32_t SD_low_pwr_cache_7: 1;
        uint32_t LS_low_pwr_cache_7: 1;
        uint32_t DS_low_pwr_cache_8: 1;
        uint32_t SD_low_pwr_cache_8: 1;
        uint32_t LS_low_pwr_cache_8: 1;
        uint32_t RSVD_1: 1;
        uint32_t DS_norm_pwr_cache_4: 1;
        uint32_t SD_norm_pwr_cache_4: 1;
        uint32_t LS_norm_pwr_cache_4: 1;
        uint32_t DS_norm_pwr_cache_5: 1;
        uint32_t SD_norm_pwr_cache_5: 1;
        uint32_t LS_norm_pwr_cache_5: 1;
        uint32_t DS_norm_pwr_cache_6: 1;
        uint32_t SD_norm_pwr_cache_6: 1;
        uint32_t LS_norm_pwr_cache_6: 1;
        uint32_t DS_norm_pwr_cache_7: 1;
        uint32_t SD_norm_pwr_cache_7: 1;
        uint32_t LS_norm_pwr_cache_7: 1;
        uint32_t DS_norm_pwr_cache_8: 1;
        uint32_t SD_norm_pwr_cache_8: 1;
        uint32_t LS_norm_pwr_cache_8: 1;
        uint32_t RSVD: 1;
    };
} AON_REG_SRAM_CTRL16_TYPE;

/*0x4000_0868 AON_REG_SRAM_CTRL16*/
#define AON_REG_SRAM_CTRL16_DS_low_pwr_cache_4_Pos                                                                       0U
#define AON_REG_SRAM_CTRL16_DS_low_pwr_cache_4_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_DS_low_pwr_cache_4_Pos)

#define AON_REG_SRAM_CTRL16_SD_low_pwr_cache_4_Pos                                                                       1U
#define AON_REG_SRAM_CTRL16_SD_low_pwr_cache_4_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_SD_low_pwr_cache_4_Pos)

#define AON_REG_SRAM_CTRL16_LS_low_pwr_cache_4_Pos                                                                       2U
#define AON_REG_SRAM_CTRL16_LS_low_pwr_cache_4_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_LS_low_pwr_cache_4_Pos)

#define AON_REG_SRAM_CTRL16_DS_low_pwr_cache_5_Pos                                                                       3U
#define AON_REG_SRAM_CTRL16_DS_low_pwr_cache_5_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_DS_low_pwr_cache_5_Pos)

#define AON_REG_SRAM_CTRL16_SD_low_pwr_cache_5_Pos                                                                       4U
#define AON_REG_SRAM_CTRL16_SD_low_pwr_cache_5_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_SD_low_pwr_cache_5_Pos)

#define AON_REG_SRAM_CTRL16_LS_low_pwr_cache_5_Pos                                                                       5U
#define AON_REG_SRAM_CTRL16_LS_low_pwr_cache_5_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_LS_low_pwr_cache_5_Pos)

