rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL16_DS_low_pwr_cache_6_Pos                                                                       6U
#define AON_REG_SRAM_CTRL16_DS_low_pwr_cache_6_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_DS_low_pwr_cache_6_Pos)

#define AON_REG_SRAM_CTRL16_SD_low_pwr_cache_6_Pos                                                                       7U
#define AON_REG_SRAM_CTRL16_SD_low_pwr_cache_6_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_SD_low_pwr_cache_6_Pos)

#define AON_REG_SRAM_CTRL16_LS_low_pwr_cache_6_Pos                                                                       8U
#define AON_REG_SRAM_CTRL16_LS_low_pwr_cache_6_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_LS_low_pwr_cache_6_Pos)

#define AON_REG_SRAM_CTRL16_DS_low_pwr_cache_7_Pos                                                                       9U
#define AON_REG_SRAM_CTRL16_DS_low_pwr_cache_7_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_DS_low_pwr_cache_7_Pos)

#define AON_REG_SRAM_CTRL16_SD_low_pwr_cache_7_Pos                                                                       10U
#define AON_REG_SRAM_CTRL16_SD_low_pwr_cache_7_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_SD_low_pwr_cache_7_Pos)

#define AON_REG_SRAM_CTRL16_LS_low_pwr_cache_7_Pos                                                                       11U
#define AON_REG_SRAM_CTRL16_LS_low_pwr_cache_7_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_LS_low_pwr_cache_7_Pos)

#define AON_REG_SRAM_CTRL16_DS_low_pwr_cache_8_Pos                                                                       12U
#define AON_REG_SRAM_CTRL16_DS_low_pwr_cache_8_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_DS_low_pwr_cache_8_Pos)

#define AON_REG_SRAM_CTRL16_SD_low_pwr_cache_8_Pos                                                                       13U
#define AON_REG_SRAM_CTRL16_SD_low_pwr_cache_8_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_SD_low_pwr_cache_8_Pos)

#define AON_REG_SRAM_CTRL16_LS_low_pwr_cache_8_Pos                                                                       14U
#define AON_REG_SRAM_CTRL16_LS_low_pwr_cache_8_Msk                                                                       (0x1UL << AON_REG_SRAM_CTRL16_LS_low_pwr_cache_8_Pos)

#define AON_REG_SRAM_CTRL16_RSVD_1_Pos                                                                                   15U
#define AON_REG_SRAM_CTRL16_RSVD_1_Msk                                                                                   (0x1UL << AON_REG_SRAM_CTRL16_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_4_Pos                                                                      16U
#define AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_4_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_4_Pos)

#define AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_4_Pos                                                                      17U
#define AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_4_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_4_Pos)

#define AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_4_Pos                                                                      18U
#define AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_4_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_4_Pos)

#define AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_5_Pos                                                                      19U
#define AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_5_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_5_Pos)

#define AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_5_Pos                                                                      20U
#define AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_5_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_5_Pos)

#define AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_5_Pos                                                                      21U
#define AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_5_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_5_Pos)

#define AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_6_Pos                                                                      22U
#define AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_6_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_6_Pos)

#define AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_6_Pos                                                                      23U
#define AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_6_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_6_Pos)

#define AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_6_Pos                                                                      24U
#define AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_6_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_6_Pos)

#define AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_7_Pos                                                                      25U
#define AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_7_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_7_Pos)

#define AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_7_Pos                                                                      26U
#define AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_7_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_7_Pos)

#define AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_7_Pos                                                                      27U
#define AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_7_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_7_Pos)

