rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_8_Pos                                                                      28U
#define AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_8_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_DS_norm_pwr_cache_8_Pos)

#define AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_8_Pos                                                                      29U
#define AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_8_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_SD_norm_pwr_cache_8_Pos)

#define AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_8_Pos                                                                      30U
#define AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_8_Msk                                                                      (0x1UL << AON_REG_SRAM_CTRL16_LS_norm_pwr_cache_8_Pos)

#define AON_REG_SRAM_CTRL16_RSVD_Pos                                                                                     31U
#define AON_REG_SRAM_CTRL16_RSVD_Msk                                                                                     (0x1UL << AON_REG_SRAM_CTRL16_RSVD_Pos)

/* 0x86C    0x4000_086c
    0       R/W     TEST1_cache_0                                               1'b0
    3:1     R/W     WPULSE_cache_0_lv                                           3'b000
    6:4     R/W     WA_cache_0_lv                                               3'b101
    10:7    R/W     RM_cache_0_lv                                               4'b0010
    11      R/W     RME_cache_0_lv                                              1'b1
    13:12   R/W     RA_cache_0_lv                                               2'b00
    15:14   R       RSVD_1                                                      0
    18:16   R/W     WPULSE_cache_0_hv                                           3'b000
    21:19   R/W     WA_cache_0_hv                                               3'b101
    25:22   R/W     RM_cache_0_hv                                               4'b0010
    26      R/W     RME_cache_0_hv                                              1'b1
    28:27   R/W     RA_cache_0_hv                                               2'b00
    31:29   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL17_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TEST1_cache_0: 1;
        uint32_t WPULSE_cache_0_lv: 3;
        uint32_t WA_cache_0_lv: 3;
        uint32_t RM_cache_0_lv: 4;
        uint32_t RME_cache_0_lv: 1;
        uint32_t RA_cache_0_lv: 2;
        uint32_t RSVD_1: 2;
        uint32_t WPULSE_cache_0_hv: 3;
        uint32_t WA_cache_0_hv: 3;
        uint32_t RM_cache_0_hv: 4;
        uint32_t RME_cache_0_hv: 1;
        uint32_t RA_cache_0_hv: 2;
        uint32_t RSVD: 3;
    };
} AON_REG_SRAM_CTRL17_TYPE;

/*0x4000_086c AON_REG_SRAM_CTRL17*/
#define AON_REG_SRAM_CTRL17_TEST1_cache_0_Pos                                                                            0U
#define AON_REG_SRAM_CTRL17_TEST1_cache_0_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL17_TEST1_cache_0_Pos)

#define AON_REG_SRAM_CTRL17_WPULSE_cache_0_lv_Pos                                                                        1U
#define AON_REG_SRAM_CTRL17_WPULSE_cache_0_lv_Msk                                                                        (0x7UL << AON_REG_SRAM_CTRL17_WPULSE_cache_0_lv_Pos)

#define AON_REG_SRAM_CTRL17_WA_cache_0_lv_Pos                                                                            4U
#define AON_REG_SRAM_CTRL17_WA_cache_0_lv_Msk                                                                            (0x7UL << AON_REG_SRAM_CTRL17_WA_cache_0_lv_Pos)

#define AON_REG_SRAM_CTRL17_RM_cache_0_lv_Pos                                                                            7U
#define AON_REG_SRAM_CTRL17_RM_cache_0_lv_Msk                                                                            (0xFUL << AON_REG_SRAM_CTRL17_RM_cache_0_lv_Pos)

#define AON_REG_SRAM_CTRL17_RME_cache_0_lv_Pos                                                                           11U
#define AON_REG_SRAM_CTRL17_RME_cache_0_lv_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL17_RME_cache_0_lv_Pos)

#define AON_REG_SRAM_CTRL17_RA_cache_0_lv_Pos                                                                            12U
#define AON_REG_SRAM_CTRL17_RA_cache_0_lv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL17_RA_cache_0_lv_Pos)

#define AON_REG_SRAM_CTRL17_RSVD_1_Pos                                                                                   14U
#define AON_REG_SRAM_CTRL17_RSVD_1_Msk                                                                                   (0x3UL << AON_REG_SRAM_CTRL17_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL17_WPULSE_cache_0_hv_Pos                                                                        16U
#define AON_REG_SRAM_CTRL17_WPULSE_cache_0_hv_Msk                                                                        (0x7UL << AON_REG_SRAM_CTRL17_WPULSE_cache_0_hv_Pos)

#define AON_REG_SRAM_CTRL17_WA_cache_0_hv_Pos                                                                            19U
#define AON_REG_SRAM_CTRL17_WA_cache_0_hv_Msk                                                                            (0x7UL << AON_REG_SRAM_CTRL17_WA_cache_0_hv_Pos)

#define AON_REG_SRAM_CTRL17_RM_cache_0_hv_Pos                                                                            22U
#define AON_REG_SRAM_CTRL17_RM_cache_0_hv_Msk                                                                            (0xFUL << AON_REG_SRAM_CTRL17_RM_cache_0_hv_Pos)

#define AON_REG_SRAM_CTRL17_RME_cache_0_hv_Pos                                                                           26U
#define AON_REG_SRAM_CTRL17_RME_cache_0_hv_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL17_RME_cache_0_hv_Pos)

#define AON_REG_SRAM_CTRL17_RA_cache_0_hv_Pos                                                                            27U
#define AON_REG_SRAM_CTRL17_RA_cache_0_hv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL17_RA_cache_0_hv_Pos)

#define AON_REG_SRAM_CTRL17_RSVD_Pos                                                                                     29U
#define AON_REG_SRAM_CTRL17_RSVD_Msk                                                                                     (0x7UL << AON_REG_SRAM_CTRL17_RSVD_Pos)

/* 0x870    0x4000_0870
    0       R/W     TEST1_cache_1                                               1'b0
    3:1     R/W     WPULSE_cache_1_lv                                           3'b000
    6:4     R/W     WA_cache_1_lv                                               3'b101
    10:7    R/W     RM_cache_1_lv                                               4'b0010
    11      R/W     RME_cache_1_lv                                              1'b1
    13:12   R/W     RA_cache_1_lv                                               2'b00
    15:14   R       RSVD_1                                                      0
    18:16   R/W     WPULSE_cache_1_hv                                           3'b000
    21:19   R/W     WA_cache_1_hv                                               3'b101
    25:22   R/W     RM_cache_1_hv                                               4'b0010
    26      R/W     RME_cache_1_hv                                              1'b1
    28:27   R/W     RA_cache_1_hv                                               2'b00
    31:29   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL18_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TEST1_cache_1: 1;
        uint32_t WPULSE_cache_1_lv: 3;
        uint32_t WA_cache_1_lv: 3;
        uint32_t RM_cache_1_lv: 4;
        uint32_t RME_cache_1_lv: 1;
        uint32_t RA_cache_1_lv: 2;
        uint32_t RSVD_1: 2;
        uint32_t WPULSE_cache_1_hv: 3;
        uint32_t WA_cache_1_hv: 3;
        uint32_t RM_cache_1_hv: 4;
        uint32_t RME_cache_1_hv: 1;
        uint32_t RA_cache_1_hv: 2;
        uint32_t RSVD: 3;
    };
} AON_REG_SRAM_CTRL18_TYPE;

/*0x4000_0870 AON_REG_SRAM_CTRL18*/
#define AON_REG_SRAM_CTRL18_TEST1_cache_1_Pos                                                                            0U
#define AON_REG_SRAM_CTRL18_TEST1_cache_1_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL18_TEST1_cache_1_Pos)

#define AON_REG_SRAM_CTRL18_WPULSE_cache_1_lv_Pos                                                                        1U
#define AON_REG_SRAM_CTRL18_WPULSE_cache_1_lv_Msk                                                                        (0x7UL << AON_REG_SRAM_CTRL18_WPULSE_cache_1_lv_Pos)

