rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL18_WA_cache_1_lv_Pos                                                                            4U
#define AON_REG_SRAM_CTRL18_WA_cache_1_lv_Msk                                                                            (0x7UL << AON_REG_SRAM_CTRL18_WA_cache_1_lv_Pos)

#define AON_REG_SRAM_CTRL18_RM_cache_1_lv_Pos                                                                            7U
#define AON_REG_SRAM_CTRL18_RM_cache_1_lv_Msk                                                                            (0xFUL << AON_REG_SRAM_CTRL18_RM_cache_1_lv_Pos)

#define AON_REG_SRAM_CTRL18_RME_cache_1_lv_Pos                                                                           11U
#define AON_REG_SRAM_CTRL18_RME_cache_1_lv_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL18_RME_cache_1_lv_Pos)

#define AON_REG_SRAM_CTRL18_RA_cache_1_lv_Pos                                                                            12U
#define AON_REG_SRAM_CTRL18_RA_cache_1_lv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL18_RA_cache_1_lv_Pos)

#define AON_REG_SRAM_CTRL18_RSVD_1_Pos                                                                                   14U
#define AON_REG_SRAM_CTRL18_RSVD_1_Msk                                                                                   (0x3UL << AON_REG_SRAM_CTRL18_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL18_WPULSE_cache_1_hv_Pos                                                                        16U
#define AON_REG_SRAM_CTRL18_WPULSE_cache_1_hv_Msk                                                                        (0x7UL << AON_REG_SRAM_CTRL18_WPULSE_cache_1_hv_Pos)

#define AON_REG_SRAM_CTRL18_WA_cache_1_hv_Pos                                                                            19U
#define AON_REG_SRAM_CTRL18_WA_cache_1_hv_Msk                                                                            (0x7UL << AON_REG_SRAM_CTRL18_WA_cache_1_hv_Pos)

#define AON_REG_SRAM_CTRL18_RM_cache_1_hv_Pos                                                                            22U
#define AON_REG_SRAM_CTRL18_RM_cache_1_hv_Msk                                                                            (0xFUL << AON_REG_SRAM_CTRL18_RM_cache_1_hv_Pos)

#define AON_REG_SRAM_CTRL18_RME_cache_1_hv_Pos                                                                           26U
#define AON_REG_SRAM_CTRL18_RME_cache_1_hv_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL18_RME_cache_1_hv_Pos)

#define AON_REG_SRAM_CTRL18_RA_cache_1_hv_Pos                                                                            27U
#define AON_REG_SRAM_CTRL18_RA_cache_1_hv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL18_RA_cache_1_hv_Pos)

#define AON_REG_SRAM_CTRL18_RSVD_Pos                                                                                     29U
#define AON_REG_SRAM_CTRL18_RSVD_Msk                                                                                     (0x7UL << AON_REG_SRAM_CTRL18_RSVD_Pos)

/* 0x874    0x4000_0874
    0       R/W     TEST1_cache_2                                               1'b0
    3:1     R/W     WPULSE_cache_2_lv                                           3'b000
    6:4     R/W     WA_cache_2_lv                                               3'b101
    10:7    R/W     RM_cache_2_lv                                               4'b0010
    11      R/W     RME_cache_2_lv                                              1'b1
    13:12   R/W     RA_cache_2_lv                                               2'b00
    15:14   R       RSVD_1                                                      0
    18:16   R/W     WPULSE_cache_2_hv                                           3'b000
    21:19   R/W     WA_cache_2_hv                                               3'b101
    25:22   R/W     RM_cache_2_hv                                               4'b0010
    26      R/W     RME_cache_2_hv                                              1'b1
    28:27   R/W     RA_cache_2_hv                                               2'b00
    31:29   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL19_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TEST1_cache_2: 1;
        uint32_t WPULSE_cache_2_lv: 3;
        uint32_t WA_cache_2_lv: 3;
        uint32_t RM_cache_2_lv: 4;
        uint32_t RME_cache_2_lv: 1;
        uint32_t RA_cache_2_lv: 2;
        uint32_t RSVD_1: 2;
        uint32_t WPULSE_cache_2_hv: 3;
        uint32_t WA_cache_2_hv: 3;
        uint32_t RM_cache_2_hv: 4;
        uint32_t RME_cache_2_hv: 1;
        uint32_t RA_cache_2_hv: 2;
        uint32_t RSVD: 3;
    };
} AON_REG_SRAM_CTRL19_TYPE;

/*0x4000_0874 AON_REG_SRAM_CTRL19*/
#define AON_REG_SRAM_CTRL19_TEST1_cache_2_Pos                                                                            0U
#define AON_REG_SRAM_CTRL19_TEST1_cache_2_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL19_TEST1_cache_2_Pos)

#define AON_REG_SRAM_CTRL19_WPULSE_cache_2_lv_Pos                                                                        1U
#define AON_REG_SRAM_CTRL19_WPULSE_cache_2_lv_Msk                                                                        (0x7UL << AON_REG_SRAM_CTRL19_WPULSE_cache_2_lv_Pos)

#define AON_REG_SRAM_CTRL19_WA_cache_2_lv_Pos                                                                            4U
#define AON_REG_SRAM_CTRL19_WA_cache_2_lv_Msk                                                                            (0x7UL << AON_REG_SRAM_CTRL19_WA_cache_2_lv_Pos)

#define AON_REG_SRAM_CTRL19_RM_cache_2_lv_Pos                                                                            7U
#define AON_REG_SRAM_CTRL19_RM_cache_2_lv_Msk                                                                            (0xFUL << AON_REG_SRAM_CTRL19_RM_cache_2_lv_Pos)

#define AON_REG_SRAM_CTRL19_RME_cache_2_lv_Pos                                                                           11U
#define AON_REG_SRAM_CTRL19_RME_cache_2_lv_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL19_RME_cache_2_lv_Pos)

#define AON_REG_SRAM_CTRL19_RA_cache_2_lv_Pos                                                                            12U
#define AON_REG_SRAM_CTRL19_RA_cache_2_lv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL19_RA_cache_2_lv_Pos)

#define AON_REG_SRAM_CTRL19_RSVD_1_Pos                                                                                   14U
#define AON_REG_SRAM_CTRL19_RSVD_1_Msk                                                                                   (0x3UL << AON_REG_SRAM_CTRL19_RSVD_1_Pos)

