rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL19_WPULSE_cache_2_hv_Pos                                                                        16U
#define AON_REG_SRAM_CTRL19_WPULSE_cache_2_hv_Msk                                                                        (0x7UL << AON_REG_SRAM_CTRL19_WPULSE_cache_2_hv_Pos)

#define AON_REG_SRAM_CTRL19_WA_cache_2_hv_Pos                                                                            19U
#define AON_REG_SRAM_CTRL19_WA_cache_2_hv_Msk                                                                            (0x7UL << AON_REG_SRAM_CTRL19_WA_cache_2_hv_Pos)

#define AON_REG_SRAM_CTRL19_RM_cache_2_hv_Pos                                                                            22U
#define AON_REG_SRAM_CTRL19_RM_cache_2_hv_Msk                                                                            (0xFUL << AON_REG_SRAM_CTRL19_RM_cache_2_hv_Pos)

#define AON_REG_SRAM_CTRL19_RME_cache_2_hv_Pos                                                                           26U
#define AON_REG_SRAM_CTRL19_RME_cache_2_hv_Msk                                                                           (0x1UL << AON_REG_SRAM_CTRL19_RME_cache_2_hv_Pos)

#define AON_REG_SRAM_CTRL19_RA_cache_2_hv_Pos                                                                            27U
#define AON_REG_SRAM_CTRL19_RA_cache_2_hv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL19_RA_cache_2_hv_Pos)

#define AON_REG_SRAM_CTRL19_RSVD_Pos                                                                                     29U
#define AON_REG_SRAM_CTRL19_RSVD_Msk                                                                                     (0x7UL << AON_REG_SRAM_CTRL19_RSVD_Pos)

/* 0x878    0x4000_0878
    31:0    R/W     DUMMY0                                                      0
 */
typedef union _AON_REG_SRAM_CTRL20_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DUMMY0;
    };
} AON_REG_SRAM_CTRL20_TYPE;

/*0x4000_0878 AON_REG_SRAM_CTRL20*/
#define AON_REG_SRAM_CTRL20_DUMMY0_Pos                                                                                   0U
#define AON_REG_SRAM_CTRL20_DUMMY0_Msk                                                                                   (0xFFFFFFFFUL << AON_REG_SRAM_CTRL20_DUMMY0_Pos)

/* 0x87C    0x4000_087c
    31:0    R       DUMMY1                                                      0
 */
typedef union _AON_REG_SRAM_CTRL21_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DUMMY1;
    };
} AON_REG_SRAM_CTRL21_TYPE;

/*0x4000_087c AON_REG_SRAM_CTRL21*/
#define AON_REG_SRAM_CTRL21_DUMMY1_Pos                                                                                   0U
#define AON_REG_SRAM_CTRL21_DUMMY1_Msk                                                                                   (0xFFFFFFFFUL << AON_REG_SRAM_CTRL21_DUMMY1_Pos)

/* 0x880    0x4000_0880
    0       R/W     PGEN_rom_0                                                  1'b0
    1       R/W     KEN_rom_0                                                   1'b1
    4:2     R/W     EMA_rom_0_lv                                                3'b011
    7:5     R/W     EMA_rom_0_hv                                                3'b010
    31:8    R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL22_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PGEN_rom_0: 1;
        uint32_t KEN_rom_0: 1;
        uint32_t EMA_rom_0_lv: 3;
        uint32_t EMA_rom_0_hv: 3;
        uint32_t RSVD: 24;
    };
} AON_REG_SRAM_CTRL22_TYPE;

/*0x4000_0880 AON_REG_SRAM_CTRL22*/
#define AON_REG_SRAM_CTRL22_PGEN_rom_0_Pos                                                                               0U
#define AON_REG_SRAM_CTRL22_PGEN_rom_0_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL22_PGEN_rom_0_Pos)

#define AON_REG_SRAM_CTRL22_KEN_rom_0_Pos                                                                                1U
#define AON_REG_SRAM_CTRL22_KEN_rom_0_Msk                                                                                (0x1UL << AON_REG_SRAM_CTRL22_KEN_rom_0_Pos)

#define AON_REG_SRAM_CTRL22_EMA_rom_0_lv_Pos                                                                             2U
#define AON_REG_SRAM_CTRL22_EMA_rom_0_lv_Msk                                                                             (0x7UL << AON_REG_SRAM_CTRL22_EMA_rom_0_lv_Pos)

#define AON_REG_SRAM_CTRL22_EMA_rom_0_hv_Pos                                                                             5U
#define AON_REG_SRAM_CTRL22_EMA_rom_0_hv_Msk                                                                             (0x7UL << AON_REG_SRAM_CTRL22_EMA_rom_0_hv_Pos)

#define AON_REG_SRAM_CTRL22_RSVD_Pos                                                                                     8U
#define AON_REG_SRAM_CTRL22_RSVD_Msk                                                                                     (0xFFFFFFUL << AON_REG_SRAM_CTRL22_RSVD_Pos)

/* 0x884    0x4000_0884
    2:0     R/W     EMA_cpu                                                     3'b011
    5:3     R/W     EMA_usb                                                     3'b010
    8:6     R/W     EMA_can                                                     3'b011
    11:9    R/W     EMA_lebis                                                   3'b011
    14:12   R/W     EMA_audio                                                   3'b011
    17:15   R/W     EMA_btphy                                                   3'b011
    20:18   R/W     EMA_ccmp                                                    3'b011
    23:21   R/W     EMA_snps                                                    3'b011
    31:24   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL23_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t EMA_cpu: 3;
        uint32_t EMA_usb: 3;
        uint32_t EMA_can: 3;
        uint32_t EMA_lebis: 3;
        uint32_t EMA_audio: 3;
        uint32_t EMA_btphy: 3;
        uint32_t EMA_ccmp: 3;
        uint32_t EMA_snps: 3;
        uint32_t RSVD: 8;
    };
} AON_REG_SRAM_CTRL23_TYPE;

