rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0884 AON_REG_SRAM_CTRL23*/
#define AON_REG_SRAM_CTRL23_EMA_cpu_Pos                                                                                  0U
#define AON_REG_SRAM_CTRL23_EMA_cpu_Msk                                                                                  (0x7UL << AON_REG_SRAM_CTRL23_EMA_cpu_Pos)

#define AON_REG_SRAM_CTRL23_EMA_usb_Pos                                                                                  3U
#define AON_REG_SRAM_CTRL23_EMA_usb_Msk                                                                                  (0x7UL << AON_REG_SRAM_CTRL23_EMA_usb_Pos)

#define AON_REG_SRAM_CTRL23_EMA_can_Pos                                                                                  6U
#define AON_REG_SRAM_CTRL23_EMA_can_Msk                                                                                  (0x7UL << AON_REG_SRAM_CTRL23_EMA_can_Pos)

#define AON_REG_SRAM_CTRL23_EMA_lebis_Pos                                                                                9U
#define AON_REG_SRAM_CTRL23_EMA_lebis_Msk                                                                                (0x7UL << AON_REG_SRAM_CTRL23_EMA_lebis_Pos)

#define AON_REG_SRAM_CTRL23_EMA_audio_Pos                                                                                12U
#define AON_REG_SRAM_CTRL23_EMA_audio_Msk                                                                                (0x7UL << AON_REG_SRAM_CTRL23_EMA_audio_Pos)

#define AON_REG_SRAM_CTRL23_EMA_btphy_Pos                                                                                15U
#define AON_REG_SRAM_CTRL23_EMA_btphy_Msk                                                                                (0x7UL << AON_REG_SRAM_CTRL23_EMA_btphy_Pos)

#define AON_REG_SRAM_CTRL23_EMA_ccmp_Pos                                                                                 18U
#define AON_REG_SRAM_CTRL23_EMA_ccmp_Msk                                                                                 (0x7UL << AON_REG_SRAM_CTRL23_EMA_ccmp_Pos)

#define AON_REG_SRAM_CTRL23_EMA_snps_Pos                                                                                 21U
#define AON_REG_SRAM_CTRL23_EMA_snps_Msk                                                                                 (0x7UL << AON_REG_SRAM_CTRL23_EMA_snps_Pos)

#define AON_REG_SRAM_CTRL23_RSVD_Pos                                                                                     24U
#define AON_REG_SRAM_CTRL23_RSVD_Msk                                                                                     (0xFFUL << AON_REG_SRAM_CTRL23_RSVD_Pos)

/* 0x888    0x4000_0888
    2:0     R/W     EMA_cpu                                                     3'b010
    5:3     R/W     EMA_usb                                                     3'b010
    8:6     R/W     EMA_can                                                     3'b010
    11:9    R/W     EMA_lebis                                                   3'b010
    14:12   R/W     EMA_audio                                                   3'b010
    17:15   R/W     EMA_btphy                                                   3'b010
    20:18   R/W     EMA_ccmp                                                    3'b010
    23:21   R/W     EMA_snps                                                    3'b010
    31:24   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL24_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t EMA_cpu: 3;
        uint32_t EMA_usb: 3;
        uint32_t EMA_can: 3;
        uint32_t EMA_lebis: 3;
        uint32_t EMA_audio: 3;
        uint32_t EMA_btphy: 3;
        uint32_t EMA_ccmp: 3;
        uint32_t EMA_snps: 3;
        uint32_t RSVD: 8;
    };
} AON_REG_SRAM_CTRL24_TYPE;

/*0x4000_0888 AON_REG_SRAM_CTRL24*/
#define AON_REG_SRAM_CTRL24_EMA_cpu_Pos                                                                                  0U
#define AON_REG_SRAM_CTRL24_EMA_cpu_Msk                                                                                  (0x7UL << AON_REG_SRAM_CTRL24_EMA_cpu_Pos)

#define AON_REG_SRAM_CTRL24_EMA_usb_Pos                                                                                  3U
#define AON_REG_SRAM_CTRL24_EMA_usb_Msk                                                                                  (0x7UL << AON_REG_SRAM_CTRL24_EMA_usb_Pos)

#define AON_REG_SRAM_CTRL24_EMA_can_Pos                                                                                  6U
#define AON_REG_SRAM_CTRL24_EMA_can_Msk                                                                                  (0x7UL << AON_REG_SRAM_CTRL24_EMA_can_Pos)

#define AON_REG_SRAM_CTRL24_EMA_lebis_Pos                                                                                9U
#define AON_REG_SRAM_CTRL24_EMA_lebis_Msk                                                                                (0x7UL << AON_REG_SRAM_CTRL24_EMA_lebis_Pos)

#define AON_REG_SRAM_CTRL24_EMA_audio_Pos                                                                                12U
#define AON_REG_SRAM_CTRL24_EMA_audio_Msk                                                                                (0x7UL << AON_REG_SRAM_CTRL24_EMA_audio_Pos)

#define AON_REG_SRAM_CTRL24_EMA_btphy_Pos                                                                                15U
#define AON_REG_SRAM_CTRL24_EMA_btphy_Msk                                                                                (0x7UL << AON_REG_SRAM_CTRL24_EMA_btphy_Pos)

#define AON_REG_SRAM_CTRL24_EMA_ccmp_Pos                                                                                 18U
#define AON_REG_SRAM_CTRL24_EMA_ccmp_Msk                                                                                 (0x7UL << AON_REG_SRAM_CTRL24_EMA_ccmp_Pos)

#define AON_REG_SRAM_CTRL24_EMA_snps_Pos                                                                                 21U
#define AON_REG_SRAM_CTRL24_EMA_snps_Msk                                                                                 (0x7UL << AON_REG_SRAM_CTRL24_EMA_snps_Pos)

#define AON_REG_SRAM_CTRL24_RSVD_Pos                                                                                     24U
#define AON_REG_SRAM_CTRL24_RSVD_Msk                                                                                     (0xFFUL << AON_REG_SRAM_CTRL24_RSVD_Pos)

/* 0x88C    0x4000_088c
    1:0     R/W     EMAW_cpu_lv                                                 2'b01
    3:2     R/W     EMAW_usb_lv                                                 2'b01
    5:4     R/W     EMAW_can_lv                                                 2'b01
    7:6     R/W     EMAW_lebis_lv                                               2'b01
    9:8     R/W     EMAW_audio_lv                                               2'b01
    11:10   R/W     EMAW_btphy_lv                                               2'b01
    13:12   R/W     EMAW_ccmp_lv                                                2'b01
    15:14   R/W     EMAW_snps_lv                                                2'b01
    17:16   R/W     EMAW_cpu_hv                                                 2'b01
    19:18   R/W     EMAW_usb_hv                                                 2'b01
    21:20   R/W     EMAW_can_hv                                                 2'b01
    23:22   R/W     EMAW_lebis_hv                                               2'b01
    25:24   R/W     EMAW_audio_hv                                               2'b01
    27:26   R/W     EMAW_btphy_hv                                               2'b01
    29:28   R/W     EMAW_ccmp_hv                                                2'b01
    31:30   R/W     EMAW_snps_hv                                                2'b01
 */
typedef union _AON_REG_SRAM_CTRL25_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t EMAW_cpu_lv: 2;
        uint32_t EMAW_usb_lv: 2;
        uint32_t EMAW_can_lv: 2;
        uint32_t EMAW_lebis_lv: 2;
        uint32_t EMAW_audio_lv: 2;
        uint32_t EMAW_btphy_lv: 2;
        uint32_t EMAW_ccmp_lv: 2;
        uint32_t EMAW_snps_lv: 2;
        uint32_t EMAW_cpu_hv: 2;
        uint32_t EMAW_usb_hv: 2;
        uint32_t EMAW_can_hv: 2;
        uint32_t EMAW_lebis_hv: 2;
        uint32_t EMAW_audio_hv: 2;
        uint32_t EMAW_btphy_hv: 2;
        uint32_t EMAW_ccmp_hv: 2;
        uint32_t EMAW_snps_hv: 2;
    };
} AON_REG_SRAM_CTRL25_TYPE;

