rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_088c AON_REG_SRAM_CTRL25*/
#define AON_REG_SRAM_CTRL25_EMAW_cpu_lv_Pos                                                                              0U
#define AON_REG_SRAM_CTRL25_EMAW_cpu_lv_Msk                                                                              (0x3UL << AON_REG_SRAM_CTRL25_EMAW_cpu_lv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_usb_lv_Pos                                                                              2U
#define AON_REG_SRAM_CTRL25_EMAW_usb_lv_Msk                                                                              (0x3UL << AON_REG_SRAM_CTRL25_EMAW_usb_lv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_can_lv_Pos                                                                              4U
#define AON_REG_SRAM_CTRL25_EMAW_can_lv_Msk                                                                              (0x3UL << AON_REG_SRAM_CTRL25_EMAW_can_lv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_lebis_lv_Pos                                                                            6U
#define AON_REG_SRAM_CTRL25_EMAW_lebis_lv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL25_EMAW_lebis_lv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_audio_lv_Pos                                                                            8U
#define AON_REG_SRAM_CTRL25_EMAW_audio_lv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL25_EMAW_audio_lv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_btphy_lv_Pos                                                                            10U
#define AON_REG_SRAM_CTRL25_EMAW_btphy_lv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL25_EMAW_btphy_lv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_ccmp_lv_Pos                                                                             12U
#define AON_REG_SRAM_CTRL25_EMAW_ccmp_lv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL25_EMAW_ccmp_lv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_snps_lv_Pos                                                                             14U
#define AON_REG_SRAM_CTRL25_EMAW_snps_lv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL25_EMAW_snps_lv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_cpu_hv_Pos                                                                              16U
#define AON_REG_SRAM_CTRL25_EMAW_cpu_hv_Msk                                                                              (0x3UL << AON_REG_SRAM_CTRL25_EMAW_cpu_hv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_usb_hv_Pos                                                                              18U
#define AON_REG_SRAM_CTRL25_EMAW_usb_hv_Msk                                                                              (0x3UL << AON_REG_SRAM_CTRL25_EMAW_usb_hv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_can_hv_Pos                                                                              20U
#define AON_REG_SRAM_CTRL25_EMAW_can_hv_Msk                                                                              (0x3UL << AON_REG_SRAM_CTRL25_EMAW_can_hv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_lebis_hv_Pos                                                                            22U
#define AON_REG_SRAM_CTRL25_EMAW_lebis_hv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL25_EMAW_lebis_hv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_audio_hv_Pos                                                                            24U
#define AON_REG_SRAM_CTRL25_EMAW_audio_hv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL25_EMAW_audio_hv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_btphy_hv_Pos                                                                            26U
#define AON_REG_SRAM_CTRL25_EMAW_btphy_hv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL25_EMAW_btphy_hv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_ccmp_hv_Pos                                                                             28U
#define AON_REG_SRAM_CTRL25_EMAW_ccmp_hv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL25_EMAW_ccmp_hv_Pos)

#define AON_REG_SRAM_CTRL25_EMAW_snps_hv_Pos                                                                             30U
#define AON_REG_SRAM_CTRL25_EMAW_snps_hv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL25_EMAW_snps_hv_Pos)

/* 0x890    0x4000_0890
    0       R/W     PGEN_cpu                                                    1'b0
    1       R/W     PGEN_usb                                                    1'b0
    2       R/W     PGEN_can                                                    1'b0
    3       R/W     PGEN_lebis                                                  1'b0
    4       R/W     PGEN_audio                                                  1'b0
    5       R/W     PGEN_btphy                                                  1'b0
    6       R/W     PGEN_ccmp                                                   1'b0
    7       R/W     PGEN_snps                                                   1'b0
    11:8    R       RSVD_1                                                      0
    12      R/W     RET1N_cpu                                                   1'b1
    13      R/W     RET1N_usb                                                   1'b1
    14      R/W     RET1N_can                                                   1'b1
    15      R/W     RET1N_lebis                                                 1'b1
    16      R/W     RET1N_audio                                                 1'b1
    17      R/W     RET1N_btphy                                                 1'b1
    18      R/W     RET1N_ccmp                                                  1'b1
    19      R/W     RET1N_snps                                                  1'b1
    23:20   R       RSVD                                                        0
    24      R/W     RET2N_cpu                                                   1'b1
    25      R/W     RET2N_usb                                                   1'b1
    26      R/W     RET2N_can                                                   1'b1
    27      R/W     RET2N_lebis                                                 1'b1
    28      R/W     RET2N_audio                                                 1'b1
    29      R/W     RET2N_btphy                                                 1'b1
    30      R/W     RET2N_ccmp                                                  1'b1
    31      R/W     RET2N_snps                                                  1'b1
 */
typedef union _AON_REG_SRAM_CTRL27_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PGEN_cpu: 1;
        uint32_t PGEN_usb: 1;
        uint32_t PGEN_can: 1;
        uint32_t PGEN_lebis: 1;
        uint32_t PGEN_audio: 1;
        uint32_t PGEN_btphy: 1;
        uint32_t PGEN_ccmp: 1;
        uint32_t PGEN_snps: 1;
        uint32_t RSVD_1: 4;
        uint32_t RET1N_cpu: 1;
        uint32_t RET1N_usb: 1;
        uint32_t RET1N_can: 1;
        uint32_t RET1N_lebis: 1;
        uint32_t RET1N_audio: 1;
        uint32_t RET1N_btphy: 1;
        uint32_t RET1N_ccmp: 1;
        uint32_t RET1N_snps: 1;
        uint32_t RSVD: 4;
        uint32_t RET2N_cpu: 1;
        uint32_t RET2N_usb: 1;
        uint32_t RET2N_can: 1;
        uint32_t RET2N_lebis: 1;
        uint32_t RET2N_audio: 1;
        uint32_t RET2N_btphy: 1;
        uint32_t RET2N_ccmp: 1;
        uint32_t RET2N_snps: 1;
    };
} AON_REG_SRAM_CTRL27_TYPE;

