rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0890 AON_REG_SRAM_CTRL27*/
#define AON_REG_SRAM_CTRL27_PGEN_cpu_Pos                                                                                 0U
#define AON_REG_SRAM_CTRL27_PGEN_cpu_Msk                                                                                 (0x1UL << AON_REG_SRAM_CTRL27_PGEN_cpu_Pos)

#define AON_REG_SRAM_CTRL27_PGEN_usb_Pos                                                                                 1U
#define AON_REG_SRAM_CTRL27_PGEN_usb_Msk                                                                                 (0x1UL << AON_REG_SRAM_CTRL27_PGEN_usb_Pos)

#define AON_REG_SRAM_CTRL27_PGEN_can_Pos                                                                                 2U
#define AON_REG_SRAM_CTRL27_PGEN_can_Msk                                                                                 (0x1UL << AON_REG_SRAM_CTRL27_PGEN_can_Pos)

#define AON_REG_SRAM_CTRL27_PGEN_lebis_Pos                                                                               3U
#define AON_REG_SRAM_CTRL27_PGEN_lebis_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL27_PGEN_lebis_Pos)

#define AON_REG_SRAM_CTRL27_PGEN_audio_Pos                                                                               4U
#define AON_REG_SRAM_CTRL27_PGEN_audio_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL27_PGEN_audio_Pos)

#define AON_REG_SRAM_CTRL27_PGEN_btphy_Pos                                                                               5U
#define AON_REG_SRAM_CTRL27_PGEN_btphy_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL27_PGEN_btphy_Pos)

#define AON_REG_SRAM_CTRL27_PGEN_ccmp_Pos                                                                                6U
#define AON_REG_SRAM_CTRL27_PGEN_ccmp_Msk                                                                                (0x1UL << AON_REG_SRAM_CTRL27_PGEN_ccmp_Pos)

#define AON_REG_SRAM_CTRL27_PGEN_snps_Pos                                                                                7U
#define AON_REG_SRAM_CTRL27_PGEN_snps_Msk                                                                                (0x1UL << AON_REG_SRAM_CTRL27_PGEN_snps_Pos)

#define AON_REG_SRAM_CTRL27_RSVD_1_Pos                                                                                   8U
#define AON_REG_SRAM_CTRL27_RSVD_1_Msk                                                                                   (0xFUL << AON_REG_SRAM_CTRL27_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL27_RET1N_cpu_Pos                                                                                12U
#define AON_REG_SRAM_CTRL27_RET1N_cpu_Msk                                                                                (0x1UL << AON_REG_SRAM_CTRL27_RET1N_cpu_Pos)

#define AON_REG_SRAM_CTRL27_RET1N_usb_Pos                                                                                13U
#define AON_REG_SRAM_CTRL27_RET1N_usb_Msk                                                                                (0x1UL << AON_REG_SRAM_CTRL27_RET1N_usb_Pos)

#define AON_REG_SRAM_CTRL27_RET1N_can_Pos                                                                                14U
#define AON_REG_SRAM_CTRL27_RET1N_can_Msk                                                                                (0x1UL << AON_REG_SRAM_CTRL27_RET1N_can_Pos)

#define AON_REG_SRAM_CTRL27_RET1N_lebis_Pos                                                                              15U
#define AON_REG_SRAM_CTRL27_RET1N_lebis_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL27_RET1N_lebis_Pos)

#define AON_REG_SRAM_CTRL27_RET1N_audio_Pos                                                                              16U
#define AON_REG_SRAM_CTRL27_RET1N_audio_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL27_RET1N_audio_Pos)

#define AON_REG_SRAM_CTRL27_RET1N_btphy_Pos                                                                              17U
#define AON_REG_SRAM_CTRL27_RET1N_btphy_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL27_RET1N_btphy_Pos)

#define AON_REG_SRAM_CTRL27_RET1N_ccmp_Pos                                                                               18U
#define AON_REG_SRAM_CTRL27_RET1N_ccmp_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL27_RET1N_ccmp_Pos)

#define AON_REG_SRAM_CTRL27_RET1N_snps_Pos                                                                               19U
#define AON_REG_SRAM_CTRL27_RET1N_snps_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL27_RET1N_snps_Pos)

#define AON_REG_SRAM_CTRL27_RSVD_Pos                                                                                     20U
#define AON_REG_SRAM_CTRL27_RSVD_Msk                                                                                     (0xFUL << AON_REG_SRAM_CTRL27_RSVD_Pos)

#define AON_REG_SRAM_CTRL27_RET2N_cpu_Pos                                                                                24U
#define AON_REG_SRAM_CTRL27_RET2N_cpu_Msk                                                                                (0x1UL << AON_REG_SRAM_CTRL27_RET2N_cpu_Pos)

#define AON_REG_SRAM_CTRL27_RET2N_usb_Pos                                                                                25U
#define AON_REG_SRAM_CTRL27_RET2N_usb_Msk                                                                                (0x1UL << AON_REG_SRAM_CTRL27_RET2N_usb_Pos)

#define AON_REG_SRAM_CTRL27_RET2N_can_Pos                                                                                26U
#define AON_REG_SRAM_CTRL27_RET2N_can_Msk                                                                                (0x1UL << AON_REG_SRAM_CTRL27_RET2N_can_Pos)

