rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL27_RET2N_lebis_Pos                                                                              27U
#define AON_REG_SRAM_CTRL27_RET2N_lebis_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL27_RET2N_lebis_Pos)

#define AON_REG_SRAM_CTRL27_RET2N_audio_Pos                                                                              28U
#define AON_REG_SRAM_CTRL27_RET2N_audio_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL27_RET2N_audio_Pos)

#define AON_REG_SRAM_CTRL27_RET2N_btphy_Pos                                                                              29U
#define AON_REG_SRAM_CTRL27_RET2N_btphy_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL27_RET2N_btphy_Pos)

#define AON_REG_SRAM_CTRL27_RET2N_ccmp_Pos                                                                               30U
#define AON_REG_SRAM_CTRL27_RET2N_ccmp_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL27_RET2N_ccmp_Pos)

#define AON_REG_SRAM_CTRL27_RET2N_snps_Pos                                                                               31U
#define AON_REG_SRAM_CTRL27_RET2N_snps_Msk                                                                               (0x1UL << AON_REG_SRAM_CTRL27_RET2N_snps_Pos)

/* 0x894    0x4000_0894
    0       R/W     RAWL_cpu_lv                                                 1'b0
    1       R/W     RAWL_usb_lv                                                 1'b0
    2       R/W     RAWL_can_lv                                                 1'b0
    3       R/W     RAWL_lebis_lv                                               1'b0
    4       R/W     RAWL_audio_lv                                               1'b0
    5       R/W     RAWL_btphy_lv                                               1'b0
    6       R/W     RAWL_ccmp_lv                                                1'b0
    7       R/W     RAWL_snps_lv                                                1'b0
    15:8    R       RSVD_1                                                      0
    16      R/W     RAWL_cpu_hv                                                 1'b0
    17      R/W     RAWL_usb_hv                                                 1'b0
    18      R/W     RAWL_can_hv                                                 1'b0
    19      R/W     RAWL_lebis_hv                                               1'b0
    20      R/W     RAWL_audio_hv                                               1'b0
    21      R/W     RAWL_btphy_hv                                               1'b0
    22      R/W     RAWL_ccmp_hv                                                1'b0
    23      R/W     RAWL_snps_hv                                                1'b0
    31:24   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL28_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RAWL_cpu_lv: 1;
        uint32_t RAWL_usb_lv: 1;
        uint32_t RAWL_can_lv: 1;
        uint32_t RAWL_lebis_lv: 1;
        uint32_t RAWL_audio_lv: 1;
        uint32_t RAWL_btphy_lv: 1;
        uint32_t RAWL_ccmp_lv: 1;
        uint32_t RAWL_snps_lv: 1;
        uint32_t RSVD_1: 8;
        uint32_t RAWL_cpu_hv: 1;
        uint32_t RAWL_usb_hv: 1;
        uint32_t RAWL_can_hv: 1;
        uint32_t RAWL_lebis_hv: 1;
        uint32_t RAWL_audio_hv: 1;
        uint32_t RAWL_btphy_hv: 1;
        uint32_t RAWL_ccmp_hv: 1;
        uint32_t RAWL_snps_hv: 1;
        uint32_t RSVD: 8;
    };
} AON_REG_SRAM_CTRL28_TYPE;

/*0x4000_0894 AON_REG_SRAM_CTRL28*/
#define AON_REG_SRAM_CTRL28_RAWL_cpu_lv_Pos                                                                              0U
#define AON_REG_SRAM_CTRL28_RAWL_cpu_lv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL28_RAWL_cpu_lv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_usb_lv_Pos                                                                              1U
#define AON_REG_SRAM_CTRL28_RAWL_usb_lv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL28_RAWL_usb_lv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_can_lv_Pos                                                                              2U
#define AON_REG_SRAM_CTRL28_RAWL_can_lv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL28_RAWL_can_lv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_lebis_lv_Pos                                                                            3U
#define AON_REG_SRAM_CTRL28_RAWL_lebis_lv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL28_RAWL_lebis_lv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_audio_lv_Pos                                                                            4U
#define AON_REG_SRAM_CTRL28_RAWL_audio_lv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL28_RAWL_audio_lv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_btphy_lv_Pos                                                                            5U
#define AON_REG_SRAM_CTRL28_RAWL_btphy_lv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL28_RAWL_btphy_lv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_ccmp_lv_Pos                                                                             6U
#define AON_REG_SRAM_CTRL28_RAWL_ccmp_lv_Msk                                                                             (0x1UL << AON_REG_SRAM_CTRL28_RAWL_ccmp_lv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_snps_lv_Pos                                                                             7U
#define AON_REG_SRAM_CTRL28_RAWL_snps_lv_Msk                                                                             (0x1UL << AON_REG_SRAM_CTRL28_RAWL_snps_lv_Pos)

