rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL28_RSVD_1_Pos                                                                                   8U
#define AON_REG_SRAM_CTRL28_RSVD_1_Msk                                                                                   (0xFFUL << AON_REG_SRAM_CTRL28_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_cpu_hv_Pos                                                                              16U
#define AON_REG_SRAM_CTRL28_RAWL_cpu_hv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL28_RAWL_cpu_hv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_usb_hv_Pos                                                                              17U
#define AON_REG_SRAM_CTRL28_RAWL_usb_hv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL28_RAWL_usb_hv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_can_hv_Pos                                                                              18U
#define AON_REG_SRAM_CTRL28_RAWL_can_hv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL28_RAWL_can_hv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_lebis_hv_Pos                                                                            19U
#define AON_REG_SRAM_CTRL28_RAWL_lebis_hv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL28_RAWL_lebis_hv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_audio_hv_Pos                                                                            20U
#define AON_REG_SRAM_CTRL28_RAWL_audio_hv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL28_RAWL_audio_hv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_btphy_hv_Pos                                                                            21U
#define AON_REG_SRAM_CTRL28_RAWL_btphy_hv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL28_RAWL_btphy_hv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_ccmp_hv_Pos                                                                             22U
#define AON_REG_SRAM_CTRL28_RAWL_ccmp_hv_Msk                                                                             (0x1UL << AON_REG_SRAM_CTRL28_RAWL_ccmp_hv_Pos)

#define AON_REG_SRAM_CTRL28_RAWL_snps_hv_Pos                                                                             23U
#define AON_REG_SRAM_CTRL28_RAWL_snps_hv_Msk                                                                             (0x1UL << AON_REG_SRAM_CTRL28_RAWL_snps_hv_Pos)

#define AON_REG_SRAM_CTRL28_RSVD_Pos                                                                                     24U
#define AON_REG_SRAM_CTRL28_RSVD_Msk                                                                                     (0xFFUL << AON_REG_SRAM_CTRL28_RSVD_Pos)

/* 0x898    0x4000_0898
    1:0     R/W     RAWLM_cpu_lv                                                2'b0
    3:2     R/W     RAWLM_usb_lv                                                2'b0
    5:4     R/W     RAWLM_can_lv                                                2'b0
    7:6     R/W     RAWLM_lebis_lv                                              2'b0
    9:8     R/W     RAWLM_audio_lv                                              2'b0
    11:10   R/W     RAWLM_btphy_lv                                              2'b0
    13:12   R/W     RAWLM_ccmp_lv                                               2'b0
    15:14   R/W     RAWLM_snps_lv                                               2'b0
    17:16   R/W     RAWLM_cpu_hv                                                2'b0
    19:18   R/W     RAWLM_usb_hv                                                2'b0
    21:20   R/W     RAWLM_can_hv                                                2'b0
    23:22   R/W     RAWLM_lebis_hv                                              2'b0
    25:24   R/W     RAWLM_audio_hv                                              2'b0
    27:26   R/W     RAWLM_btphy_hv                                              2'b0
    29:28   R/W     RAWLM_ccmp_hv                                               2'b0
    31:30   R/W     RAWLM_snps_hv                                               2'b0
 */
typedef union _AON_REG_SRAM_CTRL29_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RAWLM_cpu_lv: 2;
        uint32_t RAWLM_usb_lv: 2;
        uint32_t RAWLM_can_lv: 2;
        uint32_t RAWLM_lebis_lv: 2;
        uint32_t RAWLM_audio_lv: 2;
        uint32_t RAWLM_btphy_lv: 2;
        uint32_t RAWLM_ccmp_lv: 2;
        uint32_t RAWLM_snps_lv: 2;
        uint32_t RAWLM_cpu_hv: 2;
        uint32_t RAWLM_usb_hv: 2;
        uint32_t RAWLM_can_hv: 2;
        uint32_t RAWLM_lebis_hv: 2;
        uint32_t RAWLM_audio_hv: 2;
        uint32_t RAWLM_btphy_hv: 2;
        uint32_t RAWLM_ccmp_hv: 2;
        uint32_t RAWLM_snps_hv: 2;
    };
} AON_REG_SRAM_CTRL29_TYPE;

/*0x4000_0898 AON_REG_SRAM_CTRL29*/
#define AON_REG_SRAM_CTRL29_RAWLM_cpu_lv_Pos                                                                             0U
#define AON_REG_SRAM_CTRL29_RAWLM_cpu_lv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_cpu_lv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_usb_lv_Pos                                                                             2U
#define AON_REG_SRAM_CTRL29_RAWLM_usb_lv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_usb_lv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_can_lv_Pos                                                                             4U
#define AON_REG_SRAM_CTRL29_RAWLM_can_lv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_can_lv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_lebis_lv_Pos                                                                           6U
#define AON_REG_SRAM_CTRL29_RAWLM_lebis_lv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_lebis_lv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_audio_lv_Pos                                                                           8U
#define AON_REG_SRAM_CTRL29_RAWLM_audio_lv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_audio_lv_Pos)

