rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL29_RAWLM_btphy_lv_Pos                                                                           10U
#define AON_REG_SRAM_CTRL29_RAWLM_btphy_lv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_btphy_lv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_ccmp_lv_Pos                                                                            12U
#define AON_REG_SRAM_CTRL29_RAWLM_ccmp_lv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_ccmp_lv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_snps_lv_Pos                                                                            14U
#define AON_REG_SRAM_CTRL29_RAWLM_snps_lv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_snps_lv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_cpu_hv_Pos                                                                             16U
#define AON_REG_SRAM_CTRL29_RAWLM_cpu_hv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_cpu_hv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_usb_hv_Pos                                                                             18U
#define AON_REG_SRAM_CTRL29_RAWLM_usb_hv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_usb_hv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_can_hv_Pos                                                                             20U
#define AON_REG_SRAM_CTRL29_RAWLM_can_hv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_can_hv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_lebis_hv_Pos                                                                           22U
#define AON_REG_SRAM_CTRL29_RAWLM_lebis_hv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_lebis_hv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_audio_hv_Pos                                                                           24U
#define AON_REG_SRAM_CTRL29_RAWLM_audio_hv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_audio_hv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_btphy_hv_Pos                                                                           26U
#define AON_REG_SRAM_CTRL29_RAWLM_btphy_hv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_btphy_hv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_ccmp_hv_Pos                                                                            28U
#define AON_REG_SRAM_CTRL29_RAWLM_ccmp_hv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_ccmp_hv_Pos)

#define AON_REG_SRAM_CTRL29_RAWLM_snps_hv_Pos                                                                            30U
#define AON_REG_SRAM_CTRL29_RAWLM_snps_hv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL29_RAWLM_snps_hv_Pos)

/* 0x89C    0x4000_089c
    0       R/W     WABL_cpu_lv                                                 1'b1
    1       R/W     WABL_usb_lv                                                 1'b1
    2       R/W     WABL_can_lv                                                 1'b1
    3       R/W     WABL_lebis_lv                                               1'b1
    4       R/W     WABL_audio_lv                                               1'b1
    5       R/W     WABL_btphy_lv                                               1'b1
    6       R/W     WABL_ccmp_lv                                                1'b1
    7       R/W     WABL_snps_lv                                                1'b1
    15:8    R       RSVD_1                                                      0
    16      R/W     WABL_cpu_hv                                                 1'b1
    17      R/W     WABL_usb_hv                                                 1'b1
    18      R/W     WABL_can_hv                                                 1'b1
    19      R/W     WABL_lebis_hv                                               1'b1
    20      R/W     WABL_audio_hv                                               1'b1
    21      R/W     WABL_btphy_hv                                               1'b1
    22      R/W     WABL_ccmp_hv                                                1'b1
    23      R/W     WABL_snps_hv                                                1'b1
    31:24   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL30_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WABL_cpu_lv: 1;
        uint32_t WABL_usb_lv: 1;
        uint32_t WABL_can_lv: 1;
        uint32_t WABL_lebis_lv: 1;
        uint32_t WABL_audio_lv: 1;
        uint32_t WABL_btphy_lv: 1;
        uint32_t WABL_ccmp_lv: 1;
        uint32_t WABL_snps_lv: 1;
        uint32_t RSVD_1: 8;
        uint32_t WABL_cpu_hv: 1;
        uint32_t WABL_usb_hv: 1;
        uint32_t WABL_can_hv: 1;
        uint32_t WABL_lebis_hv: 1;
        uint32_t WABL_audio_hv: 1;
        uint32_t WABL_btphy_hv: 1;
        uint32_t WABL_ccmp_hv: 1;
        uint32_t WABL_snps_hv: 1;
        uint32_t RSVD: 8;
    };
} AON_REG_SRAM_CTRL30_TYPE;

/*0x4000_089c AON_REG_SRAM_CTRL30*/
#define AON_REG_SRAM_CTRL30_WABL_cpu_lv_Pos                                                                              0U
#define AON_REG_SRAM_CTRL30_WABL_cpu_lv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL30_WABL_cpu_lv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_usb_lv_Pos                                                                              1U
#define AON_REG_SRAM_CTRL30_WABL_usb_lv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL30_WABL_usb_lv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_can_lv_Pos                                                                              2U
#define AON_REG_SRAM_CTRL30_WABL_can_lv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL30_WABL_can_lv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_lebis_lv_Pos                                                                            3U
#define AON_REG_SRAM_CTRL30_WABL_lebis_lv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL30_WABL_lebis_lv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_audio_lv_Pos                                                                            4U
#define AON_REG_SRAM_CTRL30_WABL_audio_lv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL30_WABL_audio_lv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_btphy_lv_Pos                                                                            5U
#define AON_REG_SRAM_CTRL30_WABL_btphy_lv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL30_WABL_btphy_lv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_ccmp_lv_Pos                                                                             6U
#define AON_REG_SRAM_CTRL30_WABL_ccmp_lv_Msk                                                                             (0x1UL << AON_REG_SRAM_CTRL30_WABL_ccmp_lv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_snps_lv_Pos                                                                             7U
#define AON_REG_SRAM_CTRL30_WABL_snps_lv_Msk                                                                             (0x1UL << AON_REG_SRAM_CTRL30_WABL_snps_lv_Pos)

#define AON_REG_SRAM_CTRL30_RSVD_1_Pos                                                                                   8U
#define AON_REG_SRAM_CTRL30_RSVD_1_Msk                                                                                   (0xFFUL << AON_REG_SRAM_CTRL30_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL30_WABL_cpu_hv_Pos                                                                              16U
#define AON_REG_SRAM_CTRL30_WABL_cpu_hv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL30_WABL_cpu_hv_Pos)

