rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL30_WABL_usb_hv_Pos                                                                              17U
#define AON_REG_SRAM_CTRL30_WABL_usb_hv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL30_WABL_usb_hv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_can_hv_Pos                                                                              18U
#define AON_REG_SRAM_CTRL30_WABL_can_hv_Msk                                                                              (0x1UL << AON_REG_SRAM_CTRL30_WABL_can_hv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_lebis_hv_Pos                                                                            19U
#define AON_REG_SRAM_CTRL30_WABL_lebis_hv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL30_WABL_lebis_hv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_audio_hv_Pos                                                                            20U
#define AON_REG_SRAM_CTRL30_WABL_audio_hv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL30_WABL_audio_hv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_btphy_hv_Pos                                                                            21U
#define AON_REG_SRAM_CTRL30_WABL_btphy_hv_Msk                                                                            (0x1UL << AON_REG_SRAM_CTRL30_WABL_btphy_hv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_ccmp_hv_Pos                                                                             22U
#define AON_REG_SRAM_CTRL30_WABL_ccmp_hv_Msk                                                                             (0x1UL << AON_REG_SRAM_CTRL30_WABL_ccmp_hv_Pos)

#define AON_REG_SRAM_CTRL30_WABL_snps_hv_Pos                                                                             23U
#define AON_REG_SRAM_CTRL30_WABL_snps_hv_Msk                                                                             (0x1UL << AON_REG_SRAM_CTRL30_WABL_snps_hv_Pos)

#define AON_REG_SRAM_CTRL30_RSVD_Pos                                                                                     24U
#define AON_REG_SRAM_CTRL30_RSVD_Msk                                                                                     (0xFFUL << AON_REG_SRAM_CTRL30_RSVD_Pos)

/* 0x8A0    0x4000_08a0
    1:0     R/W     WABLM_cpu_lv                                                2'b0
    3:2     R/W     WABLM_usb_lv                                                2'b0
    5:4     R/W     WABLM_can_lv                                                2'b0
    7:6     R/W     WABLM_lebis_lv                                              2'b0
    9:8     R/W     WABLM_audio_lv                                              2'b0
    11:10   R/W     WABLM_btphy_lv                                              2'b0
    13:12   R/W     WABLM_ccmp_lv                                               2'b0
    15:14   R/W     WABLM_snps_lv                                               2'b0
    17:16   R/W     WABLM_cpu_hv                                                2'b0
    19:18   R/W     WABLM_usb_hv                                                2'b0
    21:20   R/W     WABLM_can_hv                                                2'b0
    23:22   R/W     WABLM_lebis_hv                                              2'b0
    25:24   R/W     WABLM_audio_hv                                              2'b0
    27:26   R/W     WABLM_btphy_hv                                              2'b0
    29:28   R/W     WABLM_ccmp_hv                                               2'b0
    31:30   R/W     WABLM_snps_hv                                               2'b0
 */
typedef union _AON_REG_SRAM_CTRL31_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WABLM_cpu_lv: 2;
        uint32_t WABLM_usb_lv: 2;
        uint32_t WABLM_can_lv: 2;
        uint32_t WABLM_lebis_lv: 2;
        uint32_t WABLM_audio_lv: 2;
        uint32_t WABLM_btphy_lv: 2;
        uint32_t WABLM_ccmp_lv: 2;
        uint32_t WABLM_snps_lv: 2;
        uint32_t WABLM_cpu_hv: 2;
        uint32_t WABLM_usb_hv: 2;
        uint32_t WABLM_can_hv: 2;
        uint32_t WABLM_lebis_hv: 2;
        uint32_t WABLM_audio_hv: 2;
        uint32_t WABLM_btphy_hv: 2;
        uint32_t WABLM_ccmp_hv: 2;
        uint32_t WABLM_snps_hv: 2;
    };
} AON_REG_SRAM_CTRL31_TYPE;

/*0x4000_08a0 AON_REG_SRAM_CTRL31*/
#define AON_REG_SRAM_CTRL31_WABLM_cpu_lv_Pos                                                                             0U
#define AON_REG_SRAM_CTRL31_WABLM_cpu_lv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL31_WABLM_cpu_lv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_usb_lv_Pos                                                                             2U
#define AON_REG_SRAM_CTRL31_WABLM_usb_lv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL31_WABLM_usb_lv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_can_lv_Pos                                                                             4U
#define AON_REG_SRAM_CTRL31_WABLM_can_lv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL31_WABLM_can_lv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_lebis_lv_Pos                                                                           6U
#define AON_REG_SRAM_CTRL31_WABLM_lebis_lv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL31_WABLM_lebis_lv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_audio_lv_Pos                                                                           8U
#define AON_REG_SRAM_CTRL31_WABLM_audio_lv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL31_WABLM_audio_lv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_btphy_lv_Pos                                                                           10U
#define AON_REG_SRAM_CTRL31_WABLM_btphy_lv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL31_WABLM_btphy_lv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_ccmp_lv_Pos                                                                            12U
#define AON_REG_SRAM_CTRL31_WABLM_ccmp_lv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL31_WABLM_ccmp_lv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_snps_lv_Pos                                                                            14U
#define AON_REG_SRAM_CTRL31_WABLM_snps_lv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL31_WABLM_snps_lv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_cpu_hv_Pos                                                                             16U
#define AON_REG_SRAM_CTRL31_WABLM_cpu_hv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL31_WABLM_cpu_hv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_usb_hv_Pos                                                                             18U
#define AON_REG_SRAM_CTRL31_WABLM_usb_hv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL31_WABLM_usb_hv_Pos)

