rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL31_WABLM_can_hv_Pos                                                                             20U
#define AON_REG_SRAM_CTRL31_WABLM_can_hv_Msk                                                                             (0x3UL << AON_REG_SRAM_CTRL31_WABLM_can_hv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_lebis_hv_Pos                                                                           22U
#define AON_REG_SRAM_CTRL31_WABLM_lebis_hv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL31_WABLM_lebis_hv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_audio_hv_Pos                                                                           24U
#define AON_REG_SRAM_CTRL31_WABLM_audio_hv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL31_WABLM_audio_hv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_btphy_hv_Pos                                                                           26U
#define AON_REG_SRAM_CTRL31_WABLM_btphy_hv_Msk                                                                           (0x3UL << AON_REG_SRAM_CTRL31_WABLM_btphy_hv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_ccmp_hv_Pos                                                                            28U
#define AON_REG_SRAM_CTRL31_WABLM_ccmp_hv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL31_WABLM_ccmp_hv_Pos)

#define AON_REG_SRAM_CTRL31_WABLM_snps_hv_Pos                                                                            30U
#define AON_REG_SRAM_CTRL31_WABLM_snps_hv_Msk                                                                            (0x3UL << AON_REG_SRAM_CTRL31_WABLM_snps_hv_Pos)

/* 0x8A4    0x4000_08a4
    0       R/W     RSVD_11                                                     1'b0
    1       R/W     RSVD_10                                                     1'b0
    2       R/W     RSVD_9                                                      1'b0
    3       R/W     RSVD_8                                                      1'b0
    4       R/W     RSVD_7                                                      1'b0
    5       R/W     RSVD_6                                                      1'b0
    6       R/W     RSVD_5                                                      1'b0
    7       R/W     RSVD_4                                                      1'b0
    8       R/W     RSVD_3                                                      1'b0
    9       R/W     RSVD_2                                                      1'b0
    10      R/W     RSVD_1                                                      1'b0
    31:11   R       RSVD                                                        21'h0
 */
typedef union _AON_REG_SRAM_CTRL32_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD_11: 1;
        uint32_t RSVD_10: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t RSVD_5: 1;
        uint32_t RSVD_4: 1;
        uint32_t RSVD_3: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 21;
    };
} AON_REG_SRAM_CTRL32_TYPE;

/*0x4000_08a4 AON_REG_SRAM_CTRL32*/
#define AON_REG_SRAM_CTRL32_RSVD_11_Pos                                                                                  0U
#define AON_REG_SRAM_CTRL32_RSVD_11_Msk                                                                                  (0x1UL << AON_REG_SRAM_CTRL32_RSVD_11_Pos)

#define AON_REG_SRAM_CTRL32_RSVD_10_Pos                                                                                  1U
#define AON_REG_SRAM_CTRL32_RSVD_10_Msk                                                                                  (0x1UL << AON_REG_SRAM_CTRL32_RSVD_10_Pos)

#define AON_REG_SRAM_CTRL32_RSVD_9_Pos                                                                                   2U
#define AON_REG_SRAM_CTRL32_RSVD_9_Msk                                                                                   (0x1UL << AON_REG_SRAM_CTRL32_RSVD_9_Pos)

#define AON_REG_SRAM_CTRL32_RSVD_8_Pos                                                                                   3U
#define AON_REG_SRAM_CTRL32_RSVD_8_Msk                                                                                   (0x1UL << AON_REG_SRAM_CTRL32_RSVD_8_Pos)

#define AON_REG_SRAM_CTRL32_RSVD_7_Pos                                                                                   4U
#define AON_REG_SRAM_CTRL32_RSVD_7_Msk                                                                                   (0x1UL << AON_REG_SRAM_CTRL32_RSVD_7_Pos)

#define AON_REG_SRAM_CTRL32_RSVD_6_Pos                                                                                   5U
#define AON_REG_SRAM_CTRL32_RSVD_6_Msk                                                                                   (0x1UL << AON_REG_SRAM_CTRL32_RSVD_6_Pos)

#define AON_REG_SRAM_CTRL32_RSVD_5_Pos                                                                                   6U
#define AON_REG_SRAM_CTRL32_RSVD_5_Msk                                                                                   (0x1UL << AON_REG_SRAM_CTRL32_RSVD_5_Pos)

#define AON_REG_SRAM_CTRL32_RSVD_4_Pos                                                                                   7U
#define AON_REG_SRAM_CTRL32_RSVD_4_Msk                                                                                   (0x1UL << AON_REG_SRAM_CTRL32_RSVD_4_Pos)

#define AON_REG_SRAM_CTRL32_RSVD_3_Pos                                                                                   8U
#define AON_REG_SRAM_CTRL32_RSVD_3_Msk                                                                                   (0x1UL << AON_REG_SRAM_CTRL32_RSVD_3_Pos)

#define AON_REG_SRAM_CTRL32_RSVD_2_Pos                                                                                   9U
#define AON_REG_SRAM_CTRL32_RSVD_2_Msk                                                                                   (0x1UL << AON_REG_SRAM_CTRL32_RSVD_2_Pos)

