rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SRAM_CTRL32_RSVD_1_Pos                                                                                   10U
#define AON_REG_SRAM_CTRL32_RSVD_1_Msk                                                                                   (0x1UL << AON_REG_SRAM_CTRL32_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL32_RSVD_Pos                                                                                     11U
#define AON_REG_SRAM_CTRL32_RSVD_Msk                                                                                     (0x1FFFFFUL << AON_REG_SRAM_CTRL32_RSVD_Pos)

/* 0x8A8    0x4000_08a8
    31:0    R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL33_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} AON_REG_SRAM_CTRL33_TYPE;

/*0x4000_08a8 AON_REG_SRAM_CTRL33*/
#define AON_REG_SRAM_CTRL33_RSVD_Pos                                                                                     0U
#define AON_REG_SRAM_CTRL33_RSVD_Msk                                                                                     (0xFFFFFFFFUL << AON_REG_SRAM_CTRL33_RSVD_Pos)

/* 0x8AC    0x4000_08ac
    2:0     R/W     WPULSE_buffer_8k_lv                                         3'b000
    5:3     R/W     WA_buffer_8k_lv                                             3'b101
    9:6     R/W     RM_buffer_8k_lv                                             4'b0010
    10      R/W     RME_buffer_8k_lv                                            1'b1
    12:11   R/W     RA_buffer_8k_lv                                             2'b00
    15:13   R       RSVD_1                                                      0
    18:16   R/W     WPULSE_buffer_8k_hv                                         3'b000
    21:19   R/W     WA_buffer_8k_hv                                             3'b100
    25:22   R/W     RM_buffer_8k_hv                                             4'b0011
    26      R/W     RME_buffer_8k_hv                                            1'b1
    28:27   R/W     RA_buffer_8k_hv                                             2'b00
    31:29   R       RSVD                                                        0
 */
typedef union _AON_REG_SRAM_CTRL34_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WPULSE_buffer_8k_lv: 3;
        uint32_t WA_buffer_8k_lv: 3;
        uint32_t RM_buffer_8k_lv: 4;
        uint32_t RME_buffer_8k_lv: 1;
        uint32_t RA_buffer_8k_lv: 2;
        uint32_t RSVD_1: 3;
        uint32_t WPULSE_buffer_8k_hv: 3;
        uint32_t WA_buffer_8k_hv: 3;
        uint32_t RM_buffer_8k_hv: 4;
        uint32_t RME_buffer_8k_hv: 1;
        uint32_t RA_buffer_8k_hv: 2;
        uint32_t RSVD: 3;
    };
} AON_REG_SRAM_CTRL34_TYPE;

/*0x4000_08ac AON_REG_SRAM_CTRL34*/
#define AON_REG_SRAM_CTRL34_WPULSE_buffer_8k_lv_Pos                                                                      0U
#define AON_REG_SRAM_CTRL34_WPULSE_buffer_8k_lv_Msk                                                                      (0x7UL << AON_REG_SRAM_CTRL34_WPULSE_buffer_8k_lv_Pos)

#define AON_REG_SRAM_CTRL34_WA_buffer_8k_lv_Pos                                                                          3U
#define AON_REG_SRAM_CTRL34_WA_buffer_8k_lv_Msk                                                                          (0x7UL << AON_REG_SRAM_CTRL34_WA_buffer_8k_lv_Pos)

#define AON_REG_SRAM_CTRL34_RM_buffer_8k_lv_Pos                                                                          6U
#define AON_REG_SRAM_CTRL34_RM_buffer_8k_lv_Msk                                                                          (0xFUL << AON_REG_SRAM_CTRL34_RM_buffer_8k_lv_Pos)

#define AON_REG_SRAM_CTRL34_RME_buffer_8k_lv_Pos                                                                         10U
#define AON_REG_SRAM_CTRL34_RME_buffer_8k_lv_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL34_RME_buffer_8k_lv_Pos)

#define AON_REG_SRAM_CTRL34_RA_buffer_8k_lv_Pos                                                                          11U
#define AON_REG_SRAM_CTRL34_RA_buffer_8k_lv_Msk                                                                          (0x3UL << AON_REG_SRAM_CTRL34_RA_buffer_8k_lv_Pos)

#define AON_REG_SRAM_CTRL34_RSVD_1_Pos                                                                                   13U
#define AON_REG_SRAM_CTRL34_RSVD_1_Msk                                                                                   (0x7UL << AON_REG_SRAM_CTRL34_RSVD_1_Pos)

#define AON_REG_SRAM_CTRL34_WPULSE_buffer_8k_hv_Pos                                                                      16U
#define AON_REG_SRAM_CTRL34_WPULSE_buffer_8k_hv_Msk                                                                      (0x7UL << AON_REG_SRAM_CTRL34_WPULSE_buffer_8k_hv_Pos)

#define AON_REG_SRAM_CTRL34_WA_buffer_8k_hv_Pos                                                                          19U
#define AON_REG_SRAM_CTRL34_WA_buffer_8k_hv_Msk                                                                          (0x7UL << AON_REG_SRAM_CTRL34_WA_buffer_8k_hv_Pos)

#define AON_REG_SRAM_CTRL34_RM_buffer_8k_hv_Pos                                                                          22U
#define AON_REG_SRAM_CTRL34_RM_buffer_8k_hv_Msk                                                                          (0xFUL << AON_REG_SRAM_CTRL34_RM_buffer_8k_hv_Pos)

#define AON_REG_SRAM_CTRL34_RME_buffer_8k_hv_Pos                                                                         26U
#define AON_REG_SRAM_CTRL34_RME_buffer_8k_hv_Msk                                                                         (0x1UL << AON_REG_SRAM_CTRL34_RME_buffer_8k_hv_Pos)

#define AON_REG_SRAM_CTRL34_RA_buffer_8k_hv_Pos                                                                          27U
#define AON_REG_SRAM_CTRL34_RA_buffer_8k_hv_Msk                                                                          (0x3UL << AON_REG_SRAM_CTRL34_RA_buffer_8k_hv_Pos)

#define AON_REG_SRAM_CTRL34_RSVD_Pos                                                                                     29U
#define AON_REG_SRAM_CTRL34_RSVD_Msk                                                                                     (0x7UL << AON_REG_SRAM_CTRL34_RSVD_Pos)

/* 0x8B0    0x4000_08b0
    31:0    R/W     DUMMY2                                                      0
 */
typedef union _AON_REG_SRAM_CTRL35_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DUMMY2;
    };
} AON_REG_SRAM_CTRL35_TYPE;

/*0x4000_08b0 AON_REG_SRAM_CTRL35*/
#define AON_REG_SRAM_CTRL35_DUMMY2_Pos                                                                                   0U
#define AON_REG_SRAM_CTRL35_DUMMY2_Msk                                                                                   (0xFFFFFFFFUL << AON_REG_SRAM_CTRL35_DUMMY2_Pos)

/* 0x8B4    0x4000_08b4
    0       R/W     CLKCTRL_OSC128K_QACTIVE_ONLY_EN                             1'b1
    1       R/W     REG_EN_OSC10_FOLLOW_PPU                                     1'b1
    2       R/W     REG_EN_OSC10_PON_FOLLOW_PPU                                 1'b1
    7:3     R/W     RESERVED_3                                                  5'b0
    15:8    R/W     RESERVED_2                                                  8'b0
    23:16   R/W     RESERVED_1                                                  8'b0
    31:24   R/W     RESERVED                                                    8'b0
 */
typedef union _AON_REG_PCK600_AON_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CLKCTRL_OSC128K_QACTIVE_ONLY_EN: 1;
        uint32_t REG_EN_OSC10_FOLLOW_PPU: 1;
        uint32_t REG_EN_OSC10_PON_FOLLOW_PPU: 1;
        uint32_t RESERVED_3: 5;
        uint32_t RESERVED_2: 8;
        uint32_t RESERVED_1: 8;
        uint32_t RESERVED: 8;
    };
} AON_REG_PCK600_AON_REG0X_TYPE;

/*0x4000_08b4 AON_REG_PCK600_AON_REG0X*/
#define AON_REG_PCK600_AON_REG0X_CLKCTRL_OSC128K_QACTIVE_ONLY_EN_Pos                                                     0U
#define AON_REG_PCK600_AON_REG0X_CLKCTRL_OSC128K_QACTIVE_ONLY_EN_Msk                                                     (0x1UL << AON_REG_PCK600_AON_REG0X_CLKCTRL_OSC128K_QACTIVE_ONLY_EN_Pos)

#define AON_REG_PCK600_AON_REG0X_REG_EN_OSC10_FOLLOW_PPU_Pos                                                             1U
#define AON_REG_PCK600_AON_REG0X_REG_EN_OSC10_FOLLOW_PPU_Msk                                                             (0x1UL << AON_REG_PCK600_AON_REG0X_REG_EN_OSC10_FOLLOW_PPU_Pos)

#define AON_REG_PCK600_AON_REG0X_REG_EN_OSC10_PON_FOLLOW_PPU_Pos                                                         2U
#define AON_REG_PCK600_AON_REG0X_REG_EN_OSC10_PON_FOLLOW_PPU_Msk                                                         (0x1UL << AON_REG_PCK600_AON_REG0X_REG_EN_OSC10_PON_FOLLOW_PPU_Pos)

