rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PCK600_AON_REG0X_RESERVED_3_Pos                                                                          3U
#define AON_REG_PCK600_AON_REG0X_RESERVED_3_Msk                                                                          (0x1FUL << AON_REG_PCK600_AON_REG0X_RESERVED_3_Pos)

#define AON_REG_PCK600_AON_REG0X_RESERVED_2_Pos                                                                          8U
#define AON_REG_PCK600_AON_REG0X_RESERVED_2_Msk                                                                          (0xFFUL << AON_REG_PCK600_AON_REG0X_RESERVED_2_Pos)

#define AON_REG_PCK600_AON_REG0X_RESERVED_1_Pos                                                                          16U
#define AON_REG_PCK600_AON_REG0X_RESERVED_1_Msk                                                                          (0xFFUL << AON_REG_PCK600_AON_REG0X_RESERVED_1_Pos)

#define AON_REG_PCK600_AON_REG0X_RESERVED_Pos                                                                            24U
#define AON_REG_PCK600_AON_REG0X_RESERVED_Msk                                                                            (0xFFUL << AON_REG_PCK600_AON_REG0X_RESERVED_Pos)

/* 0x8B8    0x4000_08b8
    7:0     R/W     RESERVED_2                                                  8'b0
    15:8    R/W     ENTRY_DELAY_PON_LV_DEV_OSC10                                8'b0
    23:16   R/W     RESERVED_1                                                  8'b0
    31:24   R/W     RESERVED                                                    8'b0
 */
typedef union _AON_REG_PCK600_AON_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_2: 8;
        uint32_t ENTRY_DELAY_PON_LV_DEV_OSC10: 8;
        uint32_t RESERVED_1: 8;
        uint32_t RESERVED: 8;
    };
} AON_REG_PCK600_AON_REG1X_TYPE;

/*0x4000_08b8 AON_REG_PCK600_AON_REG1X*/
#define AON_REG_PCK600_AON_REG1X_RESERVED_2_Pos                                                                          0U
#define AON_REG_PCK600_AON_REG1X_RESERVED_2_Msk                                                                          (0xFFUL << AON_REG_PCK600_AON_REG1X_RESERVED_2_Pos)

#define AON_REG_PCK600_AON_REG1X_ENTRY_DELAY_PON_LV_DEV_OSC10_Pos                                                        8U
#define AON_REG_PCK600_AON_REG1X_ENTRY_DELAY_PON_LV_DEV_OSC10_Msk                                                        (0xFFUL << AON_REG_PCK600_AON_REG1X_ENTRY_DELAY_PON_LV_DEV_OSC10_Pos)

#define AON_REG_PCK600_AON_REG1X_RESERVED_1_Pos                                                                          16U
#define AON_REG_PCK600_AON_REG1X_RESERVED_1_Msk                                                                          (0xFFUL << AON_REG_PCK600_AON_REG1X_RESERVED_1_Pos)

#define AON_REG_PCK600_AON_REG1X_RESERVED_Pos                                                                            24U
#define AON_REG_PCK600_AON_REG1X_RESERVED_Msk                                                                            (0xFFUL << AON_REG_PCK600_AON_REG1X_RESERVED_Pos)

/* 0x8BC    0x4000_08bc
    7:0     R/W     ENTRY_DELAY_OSC10_PON                                       8'h0
    15:8    R/W     ENTRY_DELAY_OSC10                                           8'b0
    23:16   R/W     ENTRY_DELAY_OSC128K_PON                                     8'b0
    31:24   R/W     ENTRY_DELAY_OSC128K                                         8'b0
 */
typedef union _AON_REG_PCK600_AON_REG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_OSC10_PON: 8;
        uint32_t ENTRY_DELAY_OSC10: 8;
        uint32_t ENTRY_DELAY_OSC128K_PON: 8;
        uint32_t ENTRY_DELAY_OSC128K: 8;
    };
} AON_REG_PCK600_AON_REG2X_TYPE;

/*0x4000_08bc AON_REG_PCK600_AON_REG2X*/
#define AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC10_PON_Pos                                                               0U
#define AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC10_PON_Msk                                                               (0xFFUL << AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC10_PON_Pos)

#define AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC10_Pos                                                                   8U
#define AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC10_Msk                                                                   (0xFFUL << AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC10_Pos)

#define AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC128K_PON_Pos                                                             16U
#define AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC128K_PON_Msk                                                             (0xFFUL << AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC128K_PON_Pos)

#define AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC128K_Pos                                                                 24U
#define AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC128K_Msk                                                                 (0xFFUL << AON_REG_PCK600_AON_REG2X_ENTRY_DELAY_OSC128K_Pos)

/* 0x8C0    0x4000_08c0
    0       R/W     OSC10_CORE_CLK_FORCE                                        1'b0
    1       R/W     OSC10_PON_CLK_FORCE                                         1'b0
    2       R/W     OSC10_CLK_FORCE                                             1'b0
    3       R/W     OSC128_CORE_CLK_FORCE                                       1'b0
    4       R/W     OSC128_PON_CLK_FORCE                                        1'b0
    5       R/W     OSC128_CLK_FORCE                                            1'b0
    15:6    R/W     RESERVED                                                    10'b0
    23:16   R/W     ENTRY_DELAY_OSC10_CORE                                      8'h0
    31:24   R/W     ENTRY_DELAY_OSC128K_CORE                                    8'b0
 */
typedef union _AON_REG_PCK600_AON_REG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC10_CORE_CLK_FORCE: 1;
        uint32_t OSC10_PON_CLK_FORCE: 1;
        uint32_t OSC10_CLK_FORCE: 1;
        uint32_t OSC128_CORE_CLK_FORCE: 1;
        uint32_t OSC128_PON_CLK_FORCE: 1;
        uint32_t OSC128_CLK_FORCE: 1;
        uint32_t RESERVED: 10;
        uint32_t ENTRY_DELAY_OSC10_CORE: 8;
        uint32_t ENTRY_DELAY_OSC128K_CORE: 8;
    };
} AON_REG_PCK600_AON_REG3X_TYPE;

/*0x4000_08c0 AON_REG_PCK600_AON_REG3X*/
#define AON_REG_PCK600_AON_REG3X_OSC10_CORE_CLK_FORCE_Pos                                                                0U
#define AON_REG_PCK600_AON_REG3X_OSC10_CORE_CLK_FORCE_Msk                                                                (0x1UL << AON_REG_PCK600_AON_REG3X_OSC10_CORE_CLK_FORCE_Pos)

#define AON_REG_PCK600_AON_REG3X_OSC10_PON_CLK_FORCE_Pos                                                                 1U
#define AON_REG_PCK600_AON_REG3X_OSC10_PON_CLK_FORCE_Msk                                                                 (0x1UL << AON_REG_PCK600_AON_REG3X_OSC10_PON_CLK_FORCE_Pos)

