rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PCK600_AON_REG3X_OSC10_CLK_FORCE_Pos                                                                     2U
#define AON_REG_PCK600_AON_REG3X_OSC10_CLK_FORCE_Msk                                                                     (0x1UL << AON_REG_PCK600_AON_REG3X_OSC10_CLK_FORCE_Pos)

#define AON_REG_PCK600_AON_REG3X_OSC128_CORE_CLK_FORCE_Pos                                                               3U
#define AON_REG_PCK600_AON_REG3X_OSC128_CORE_CLK_FORCE_Msk                                                               (0x1UL << AON_REG_PCK600_AON_REG3X_OSC128_CORE_CLK_FORCE_Pos)

#define AON_REG_PCK600_AON_REG3X_OSC128_PON_CLK_FORCE_Pos                                                                4U
#define AON_REG_PCK600_AON_REG3X_OSC128_PON_CLK_FORCE_Msk                                                                (0x1UL << AON_REG_PCK600_AON_REG3X_OSC128_PON_CLK_FORCE_Pos)

#define AON_REG_PCK600_AON_REG3X_OSC128_CLK_FORCE_Pos                                                                    5U
#define AON_REG_PCK600_AON_REG3X_OSC128_CLK_FORCE_Msk                                                                    (0x1UL << AON_REG_PCK600_AON_REG3X_OSC128_CLK_FORCE_Pos)

#define AON_REG_PCK600_AON_REG3X_RESERVED_Pos                                                                            6U
#define AON_REG_PCK600_AON_REG3X_RESERVED_Msk                                                                            (0x3FFUL << AON_REG_PCK600_AON_REG3X_RESERVED_Pos)

#define AON_REG_PCK600_AON_REG3X_ENTRY_DELAY_OSC10_CORE_Pos                                                              16U
#define AON_REG_PCK600_AON_REG3X_ENTRY_DELAY_OSC10_CORE_Msk                                                              (0xFFUL << AON_REG_PCK600_AON_REG3X_ENTRY_DELAY_OSC10_CORE_Pos)

#define AON_REG_PCK600_AON_REG3X_ENTRY_DELAY_OSC128K_CORE_Pos                                                            24U
#define AON_REG_PCK600_AON_REG3X_ENTRY_DELAY_OSC128K_CORE_Msk                                                            (0xFFUL << AON_REG_PCK600_AON_REG3X_ENTRY_DELAY_OSC128K_CORE_Pos)

/* 0x8C4    0x4000_08c4
    0       R       PCSM_PPU_VPON_QCH_BUSY_FLAG0                                1'b1
    1       R       PCSM_OSC10_PON_QCH_BUSY_FLAG0                               1'b1
    2       R       PCSM_OSC10_QCH_BUSY_FLAG0                                   1'b1
    15:3    R       RESERVED_1                                                  13'd0
    16      R       PCSM_PPU_VPON_QCH_BUSY_FLAG1                                1'b0
    17      R       PCSM_OSC10_PON_QCH_BUSY_FLAG1                               1'b0
    18      R       PCSM_OSC10_QCH_BUSY_FLAG1                                   1'b0
    30:19   R       RESERVED                                                    12'd0
    31      R/W1C   AON_DBG_QCH_BUSY_FLAG_W1C                                   1'b0
 */
typedef union _AON_REG_PCK600_AON_REG4X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PCSM_PPU_VPON_QCH_BUSY_FLAG0: 1;
        uint32_t PCSM_OSC10_PON_QCH_BUSY_FLAG0: 1;
        uint32_t PCSM_OSC10_QCH_BUSY_FLAG0: 1;
        uint32_t RESERVED_1: 13;
        uint32_t PCSM_PPU_VPON_QCH_BUSY_FLAG1: 1;
        uint32_t PCSM_OSC10_PON_QCH_BUSY_FLAG1: 1;
        uint32_t PCSM_OSC10_QCH_BUSY_FLAG1: 1;
        uint32_t RESERVED: 12;
        uint32_t AON_DBG_QCH_BUSY_FLAG_W1C: 1;
    };
} AON_REG_PCK600_AON_REG4X_TYPE;

/*0x4000_08c4 AON_REG_PCK600_AON_REG4X*/
#define AON_REG_PCK600_AON_REG4X_PCSM_PPU_VPON_QCH_BUSY_FLAG0_Pos                                                        0U
#define AON_REG_PCK600_AON_REG4X_PCSM_PPU_VPON_QCH_BUSY_FLAG0_Msk                                                        (0x1UL << AON_REG_PCK600_AON_REG4X_PCSM_PPU_VPON_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_AON_REG4X_PCSM_OSC10_PON_QCH_BUSY_FLAG0_Pos                                                       1U
#define AON_REG_PCK600_AON_REG4X_PCSM_OSC10_PON_QCH_BUSY_FLAG0_Msk                                                       (0x1UL << AON_REG_PCK600_AON_REG4X_PCSM_OSC10_PON_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_AON_REG4X_PCSM_OSC10_QCH_BUSY_FLAG0_Pos                                                           2U
#define AON_REG_PCK600_AON_REG4X_PCSM_OSC10_QCH_BUSY_FLAG0_Msk                                                           (0x1UL << AON_REG_PCK600_AON_REG4X_PCSM_OSC10_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_AON_REG4X_RESERVED_1_Pos                                                                          3U
#define AON_REG_PCK600_AON_REG4X_RESERVED_1_Msk                                                                          (0x1FFFUL << AON_REG_PCK600_AON_REG4X_RESERVED_1_Pos)

#define AON_REG_PCK600_AON_REG4X_PCSM_PPU_VPON_QCH_BUSY_FLAG1_Pos                                                        16U
#define AON_REG_PCK600_AON_REG4X_PCSM_PPU_VPON_QCH_BUSY_FLAG1_Msk                                                        (0x1UL << AON_REG_PCK600_AON_REG4X_PCSM_PPU_VPON_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_AON_REG4X_PCSM_OSC10_PON_QCH_BUSY_FLAG1_Pos                                                       17U
#define AON_REG_PCK600_AON_REG4X_PCSM_OSC10_PON_QCH_BUSY_FLAG1_Msk                                                       (0x1UL << AON_REG_PCK600_AON_REG4X_PCSM_OSC10_PON_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_AON_REG4X_PCSM_OSC10_QCH_BUSY_FLAG1_Pos                                                           18U
#define AON_REG_PCK600_AON_REG4X_PCSM_OSC10_QCH_BUSY_FLAG1_Msk                                                           (0x1UL << AON_REG_PCK600_AON_REG4X_PCSM_OSC10_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_AON_REG4X_RESERVED_Pos                                                                            19U
#define AON_REG_PCK600_AON_REG4X_RESERVED_Msk                                                                            (0xFFFUL << AON_REG_PCK600_AON_REG4X_RESERVED_Pos)

#define AON_REG_PCK600_AON_REG4X_AON_DBG_QCH_BUSY_FLAG_W1C_Pos                                                           31U
#define AON_REG_PCK600_AON_REG4X_AON_DBG_QCH_BUSY_FLAG_W1C_Msk                                                           (0x1UL << AON_REG_PCK600_AON_REG4X_AON_DBG_QCH_BUSY_FLAG_W1C_Pos)

