rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0x8C8    0x4000_08c8
    11:0    R       VPON_LEAVE_FUNC_RET_MODE_CNT_VALUE                          12'b0
    14:12   R       RESERVED_1                                                  3'b0
    15      R       VPON_LEAVE_FUNC_RET_MODE_CNT_CLAMP_FLAG                     1'b0
    30:16   R       RESERVED                                                    15'b0
    31      R/W1C   VPON_LEAVE_FUNC_RET_MODE_CNT_W1C                            1'b0
 */
typedef union _AON_REG_PCK600_AON_REG5X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t VPON_LEAVE_FUNC_RET_MODE_CNT_VALUE: 12;
        uint32_t RESERVED_1: 3;
        uint32_t VPON_LEAVE_FUNC_RET_MODE_CNT_CLAMP_FLAG: 1;
        uint32_t RESERVED: 15;
        uint32_t VPON_LEAVE_FUNC_RET_MODE_CNT_W1C: 1;
    };
} AON_REG_PCK600_AON_REG5X_TYPE;

/*0x4000_08c8 AON_REG_PCK600_AON_REG5X*/
#define AON_REG_PCK600_AON_REG5X_VPON_LEAVE_FUNC_RET_MODE_CNT_VALUE_Pos                                                  0U
#define AON_REG_PCK600_AON_REG5X_VPON_LEAVE_FUNC_RET_MODE_CNT_VALUE_Msk                                                  (0xFFFUL << AON_REG_PCK600_AON_REG5X_VPON_LEAVE_FUNC_RET_MODE_CNT_VALUE_Pos)

#define AON_REG_PCK600_AON_REG5X_RESERVED_1_Pos                                                                          12U
#define AON_REG_PCK600_AON_REG5X_RESERVED_1_Msk                                                                          (0x7UL << AON_REG_PCK600_AON_REG5X_RESERVED_1_Pos)

#define AON_REG_PCK600_AON_REG5X_VPON_LEAVE_FUNC_RET_MODE_CNT_CLAMP_FLAG_Pos                                             15U
#define AON_REG_PCK600_AON_REG5X_VPON_LEAVE_FUNC_RET_MODE_CNT_CLAMP_FLAG_Msk                                             (0x1UL << AON_REG_PCK600_AON_REG5X_VPON_LEAVE_FUNC_RET_MODE_CNT_CLAMP_FLAG_Pos)

#define AON_REG_PCK600_AON_REG5X_RESERVED_Pos                                                                            16U
#define AON_REG_PCK600_AON_REG5X_RESERVED_Msk                                                                            (0x7FFFUL << AON_REG_PCK600_AON_REG5X_RESERVED_Pos)

#define AON_REG_PCK600_AON_REG5X_VPON_LEAVE_FUNC_RET_MODE_CNT_W1C_Pos                                                    31U
#define AON_REG_PCK600_AON_REG5X_VPON_LEAVE_FUNC_RET_MODE_CNT_W1C_Msk                                                    (0x1UL << AON_REG_PCK600_AON_REG5X_VPON_LEAVE_FUNC_RET_MODE_CNT_W1C_Pos)

/* 0x8CC    0x4000_08cc
    7:0     R/W     DEBUG_SEL                                                   8'b0
    31:8    R/W     RESERVED                                                    24'b0
 */
typedef union _AON_REG_PCK600_VPON_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEBUG_SEL: 8;
        uint32_t RESERVED: 24;
    };
} AON_REG_PCK600_VPON_REG0X_TYPE;

/*0x4000_08cc AON_REG_PCK600_VPON_REG0X*/
#define AON_REG_PCK600_VPON_REG0X_DEBUG_SEL_Pos                                                                          0U
#define AON_REG_PCK600_VPON_REG0X_DEBUG_SEL_Msk                                                                          (0xFFUL << AON_REG_PCK600_VPON_REG0X_DEBUG_SEL_Pos)

#define AON_REG_PCK600_VPON_REG0X_RESERVED_Pos                                                                           8U
#define AON_REG_PCK600_VPON_REG0X_RESERVED_Msk                                                                           (0xFFFFFFUL << AON_REG_PCK600_VPON_REG0X_RESERVED_Pos)

/* 0x8D0    0x4000_08d0
    7:0     R/W     ENTRY_DELAY_OSC80                                           8'b0
    15:8    R/W     ENTRY_DELAY_OSC80_CG                                        8'b0
    23:16   R/W     ENTRY_DELAY_XTAL40                                          8'b0
    31:24   R/W     ENTRY_DELAY_PLL1                                            8'b0
 */
typedef union _AON_REG_PCK600_VPON_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ENTRY_DELAY_OSC80: 8;
        uint32_t ENTRY_DELAY_OSC80_CG: 8;
        uint32_t ENTRY_DELAY_XTAL40: 8;
        uint32_t ENTRY_DELAY_PLL1: 8;
    };
} AON_REG_PCK600_VPON_REG1X_TYPE;

/*0x4000_08d0 AON_REG_PCK600_VPON_REG1X*/
#define AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_OSC80_Pos                                                                  0U
#define AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_OSC80_Msk                                                                  (0xFFUL << AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_OSC80_Pos)

#define AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_OSC80_CG_Pos                                                               8U
#define AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_OSC80_CG_Msk                                                               (0xFFUL << AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_OSC80_CG_Pos)

#define AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_XTAL40_Pos                                                                 16U
#define AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_XTAL40_Msk                                                                 (0xFFUL << AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_XTAL40_Pos)

#define AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_PLL1_Pos                                                                   24U
#define AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_PLL1_Msk                                                                   (0xFFUL << AON_REG_PCK600_VPON_REG1X_ENTRY_DELAY_PLL1_Pos)

/* 0x8D4    0x4000_08d4
    0       R/W     OSC80_CLK_FORCE                                             1'b0
    1       R/W     OSC80_CG_CLK_FORCE                                          1'b0
    2       R/W     XTAL40_CLK_FORCE                                            1'b0
    3       R/W     PLL1_CLK_FORCE                                              1'b0
    28:4    R/W     RESERVED                                                    25'b0
    29      R/W     EN_BYPASS_EXIT_DSM_XTAL_CHECK                               1'b1
    30      R/W     LPDQ_REG_EN_CORE1_OSC_PWRQ                                  1'b1
    31      R/W     LPDQ_REG_EN_CORE1_XTAL40_PWRQ                               1'b1
 */
typedef union _AON_REG_PCK600_VPON_REG2X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC80_CLK_FORCE: 1;
        uint32_t OSC80_CG_CLK_FORCE: 1;
        uint32_t XTAL40_CLK_FORCE: 1;
        uint32_t PLL1_CLK_FORCE: 1;
        uint32_t RESERVED: 25;
        uint32_t EN_BYPASS_EXIT_DSM_XTAL_CHECK: 1;
        uint32_t LPDQ_REG_EN_CORE1_OSC_PWRQ: 1;
        uint32_t LPDQ_REG_EN_CORE1_XTAL40_PWRQ: 1;
    };
} AON_REG_PCK600_VPON_REG2X_TYPE;

/*0x4000_08d4 AON_REG_PCK600_VPON_REG2X*/
#define AON_REG_PCK600_VPON_REG2X_OSC80_CLK_FORCE_Pos                                                                    0U
#define AON_REG_PCK600_VPON_REG2X_OSC80_CLK_FORCE_Msk                                                                    (0x1UL << AON_REG_PCK600_VPON_REG2X_OSC80_CLK_FORCE_Pos)

#define AON_REG_PCK600_VPON_REG2X_OSC80_CG_CLK_FORCE_Pos                                                                 1U
#define AON_REG_PCK600_VPON_REG2X_OSC80_CG_CLK_FORCE_Msk                                                                 (0x1UL << AON_REG_PCK600_VPON_REG2X_OSC80_CG_CLK_FORCE_Pos)

#define AON_REG_PCK600_VPON_REG2X_XTAL40_CLK_FORCE_Pos                                                                   2U
#define AON_REG_PCK600_VPON_REG2X_XTAL40_CLK_FORCE_Msk                                                                   (0x1UL << AON_REG_PCK600_VPON_REG2X_XTAL40_CLK_FORCE_Pos)

