rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PCK600_VPON_REG2X_PLL1_CLK_FORCE_Pos                                                                     3U
#define AON_REG_PCK600_VPON_REG2X_PLL1_CLK_FORCE_Msk                                                                     (0x1UL << AON_REG_PCK600_VPON_REG2X_PLL1_CLK_FORCE_Pos)

#define AON_REG_PCK600_VPON_REG2X_RESERVED_Pos                                                                           4U
#define AON_REG_PCK600_VPON_REG2X_RESERVED_Msk                                                                           (0x1FFFFFFUL << AON_REG_PCK600_VPON_REG2X_RESERVED_Pos)

#define AON_REG_PCK600_VPON_REG2X_EN_BYPASS_EXIT_DSM_XTAL_CHECK_Pos                                                      29U
#define AON_REG_PCK600_VPON_REG2X_EN_BYPASS_EXIT_DSM_XTAL_CHECK_Msk                                                      (0x1UL << AON_REG_PCK600_VPON_REG2X_EN_BYPASS_EXIT_DSM_XTAL_CHECK_Pos)

#define AON_REG_PCK600_VPON_REG2X_LPDQ_REG_EN_CORE1_OSC_PWRQ_Pos                                                         30U
#define AON_REG_PCK600_VPON_REG2X_LPDQ_REG_EN_CORE1_OSC_PWRQ_Msk                                                         (0x1UL << AON_REG_PCK600_VPON_REG2X_LPDQ_REG_EN_CORE1_OSC_PWRQ_Pos)

#define AON_REG_PCK600_VPON_REG2X_LPDQ_REG_EN_CORE1_XTAL40_PWRQ_Pos                                                      31U
#define AON_REG_PCK600_VPON_REG2X_LPDQ_REG_EN_CORE1_XTAL40_PWRQ_Msk                                                      (0x1UL << AON_REG_PCK600_VPON_REG2X_LPDQ_REG_EN_CORE1_XTAL40_PWRQ_Pos)

/* 0x8D8    0x4000_08d8
    0       R/W     PPU_VCORE_CLK_FORCE                                         1'b0
    1       R/W     PLATFORM_EXTEND_CLK_FORCE                                   1'b0
    9:2     R/W     ENTRY_DELAY_PPU_VCORE                                       8'b0
    17:10   R/W     ENTRY_DELAY_PLATFORM_EXTEND                                 8'b0
    31:18   R/W     RESERVED                                                    14'b0
 */
typedef union _AON_REG_PCK600_VPON_REG3X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PPU_VCORE_CLK_FORCE: 1;
        uint32_t PLATFORM_EXTEND_CLK_FORCE: 1;
        uint32_t ENTRY_DELAY_PPU_VCORE: 8;
        uint32_t ENTRY_DELAY_PLATFORM_EXTEND: 8;
        uint32_t RESERVED: 14;
    };
} AON_REG_PCK600_VPON_REG3X_TYPE;

/*0x4000_08d8 AON_REG_PCK600_VPON_REG3X*/
#define AON_REG_PCK600_VPON_REG3X_PPU_VCORE_CLK_FORCE_Pos                                                                0U
#define AON_REG_PCK600_VPON_REG3X_PPU_VCORE_CLK_FORCE_Msk                                                                (0x1UL << AON_REG_PCK600_VPON_REG3X_PPU_VCORE_CLK_FORCE_Pos)

#define AON_REG_PCK600_VPON_REG3X_PLATFORM_EXTEND_CLK_FORCE_Pos                                                          1U
#define AON_REG_PCK600_VPON_REG3X_PLATFORM_EXTEND_CLK_FORCE_Msk                                                          (0x1UL << AON_REG_PCK600_VPON_REG3X_PLATFORM_EXTEND_CLK_FORCE_Pos)

#define AON_REG_PCK600_VPON_REG3X_ENTRY_DELAY_PPU_VCORE_Pos                                                              2U
#define AON_REG_PCK600_VPON_REG3X_ENTRY_DELAY_PPU_VCORE_Msk                                                              (0xFFUL << AON_REG_PCK600_VPON_REG3X_ENTRY_DELAY_PPU_VCORE_Pos)

#define AON_REG_PCK600_VPON_REG3X_ENTRY_DELAY_PLATFORM_EXTEND_Pos                                                        10U
#define AON_REG_PCK600_VPON_REG3X_ENTRY_DELAY_PLATFORM_EXTEND_Msk                                                        (0xFFUL << AON_REG_PCK600_VPON_REG3X_ENTRY_DELAY_PLATFORM_EXTEND_Pos)

#define AON_REG_PCK600_VPON_REG3X_RESERVED_Pos                                                                           18U
#define AON_REG_PCK600_VPON_REG3X_RESERVED_Msk                                                                           (0x3FFFUL << AON_REG_PCK600_VPON_REG3X_RESERVED_Pos)

/* 0x8DC    0x4000_08dc
    0       R       PSCM_OSC80_QCH_BUSY_FLAG1                                   1'b0
    1       R       PCSM_XTAL40_QCH_BUSY_FLAG1                                  1'b0
    2       R       PCSM_PPU_VCORE_QCH_BUSY_FLAG1                               1'b0
    3       R       PCSM_PLL1_QCH_BUSY_FLAG1                                    1'b0
    4       R       PCSM_OSC80_CG_QCH_BUSY_FLAG1                                1'b0
    5       R       WDT_BUS_QCH_BUSY_FLAG1                                      1'b0
    6       R       WDT_QCH_BUSY_FLAG1                                          1'b0
    7       R       SCH_PLN_QCH_BUSY_FLAG1                                      1'b0
    8       R       RTC_BUS_QCH_BUSY_FLAG1                                      1'b0
    9       R       RTC_QCH_BUSY_FLAG1                                          1'b0
    10      R       RAP_BUS_QCH_BUSY_FLAG1                                      1'b0
    11      R       RAP_QCH_BUSY_FLAG1                                          1'b0
    12      R       LPQDEC_BUS_QCH_BUSY_FLAG1                                   1'b0
    13      R       LPQDEC_QCH_BUSY_FLAG1                                       1'b0
    14      R       LPPWM_QCH_BUSY_FLAG1                                        1'b0
    15      R       LPC_BUS_QCH_BUSY_FLAG1                                      1'b0
    16      R       LPC_QCH_BUSY_FLAG1                                          1'b0
    17      R       GRTC_BUS_QCH_BUSY_FLAG1                                     1'b0
    18      R       GRTC_QCH_BUSY_FLAG1                                         1'b0
    19      R       BTMAC_32K_QCH_BUSY_FLAG1                                    1'b0
    31:20   R       RESERVED                                                    12'b0
 */
typedef union _AON_REG_PCK600_VPON_REG4X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PSCM_OSC80_QCH_BUSY_FLAG1: 1;
        uint32_t PCSM_XTAL40_QCH_BUSY_FLAG1: 1;
        uint32_t PCSM_PPU_VCORE_QCH_BUSY_FLAG1: 1;
        uint32_t PCSM_PLL1_QCH_BUSY_FLAG1: 1;
        uint32_t PCSM_OSC80_CG_QCH_BUSY_FLAG1: 1;
        uint32_t WDT_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t WDT_QCH_BUSY_FLAG1: 1;
        uint32_t SCH_PLN_QCH_BUSY_FLAG1: 1;
        uint32_t RTC_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t RTC_QCH_BUSY_FLAG1: 1;
        uint32_t RAP_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t RAP_QCH_BUSY_FLAG1: 1;
        uint32_t LPQDEC_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t LPQDEC_QCH_BUSY_FLAG1: 1;
        uint32_t LPPWM_QCH_BUSY_FLAG1: 1;
        uint32_t LPC_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t LPC_QCH_BUSY_FLAG1: 1;
        uint32_t GRTC_BUS_QCH_BUSY_FLAG1: 1;
        uint32_t GRTC_QCH_BUSY_FLAG1: 1;
        uint32_t BTMAC_32K_QCH_BUSY_FLAG1: 1;
        uint32_t RESERVED: 12;
    };
} AON_REG_PCK600_VPON_REG4X_TYPE;

