rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_08dc AON_REG_PCK600_VPON_REG4X*/
#define AON_REG_PCK600_VPON_REG4X_PSCM_OSC80_QCH_BUSY_FLAG1_Pos                                                          0U
#define AON_REG_PCK600_VPON_REG4X_PSCM_OSC80_QCH_BUSY_FLAG1_Msk                                                          (0x1UL << AON_REG_PCK600_VPON_REG4X_PSCM_OSC80_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_PCSM_XTAL40_QCH_BUSY_FLAG1_Pos                                                         1U
#define AON_REG_PCK600_VPON_REG4X_PCSM_XTAL40_QCH_BUSY_FLAG1_Msk                                                         (0x1UL << AON_REG_PCK600_VPON_REG4X_PCSM_XTAL40_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_PCSM_PPU_VCORE_QCH_BUSY_FLAG1_Pos                                                      2U
#define AON_REG_PCK600_VPON_REG4X_PCSM_PPU_VCORE_QCH_BUSY_FLAG1_Msk                                                      (0x1UL << AON_REG_PCK600_VPON_REG4X_PCSM_PPU_VCORE_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_PCSM_PLL1_QCH_BUSY_FLAG1_Pos                                                           3U
#define AON_REG_PCK600_VPON_REG4X_PCSM_PLL1_QCH_BUSY_FLAG1_Msk                                                           (0x1UL << AON_REG_PCK600_VPON_REG4X_PCSM_PLL1_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_PCSM_OSC80_CG_QCH_BUSY_FLAG1_Pos                                                       4U
#define AON_REG_PCK600_VPON_REG4X_PCSM_OSC80_CG_QCH_BUSY_FLAG1_Msk                                                       (0x1UL << AON_REG_PCK600_VPON_REG4X_PCSM_OSC80_CG_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_WDT_BUS_QCH_BUSY_FLAG1_Pos                                                             5U
#define AON_REG_PCK600_VPON_REG4X_WDT_BUS_QCH_BUSY_FLAG1_Msk                                                             (0x1UL << AON_REG_PCK600_VPON_REG4X_WDT_BUS_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_WDT_QCH_BUSY_FLAG1_Pos                                                                 6U
#define AON_REG_PCK600_VPON_REG4X_WDT_QCH_BUSY_FLAG1_Msk                                                                 (0x1UL << AON_REG_PCK600_VPON_REG4X_WDT_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_SCH_PLN_QCH_BUSY_FLAG1_Pos                                                             7U
#define AON_REG_PCK600_VPON_REG4X_SCH_PLN_QCH_BUSY_FLAG1_Msk                                                             (0x1UL << AON_REG_PCK600_VPON_REG4X_SCH_PLN_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_RTC_BUS_QCH_BUSY_FLAG1_Pos                                                             8U
#define AON_REG_PCK600_VPON_REG4X_RTC_BUS_QCH_BUSY_FLAG1_Msk                                                             (0x1UL << AON_REG_PCK600_VPON_REG4X_RTC_BUS_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_RTC_QCH_BUSY_FLAG1_Pos                                                                 9U
#define AON_REG_PCK600_VPON_REG4X_RTC_QCH_BUSY_FLAG1_Msk                                                                 (0x1UL << AON_REG_PCK600_VPON_REG4X_RTC_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_RAP_BUS_QCH_BUSY_FLAG1_Pos                                                             10U
#define AON_REG_PCK600_VPON_REG4X_RAP_BUS_QCH_BUSY_FLAG1_Msk                                                             (0x1UL << AON_REG_PCK600_VPON_REG4X_RAP_BUS_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_RAP_QCH_BUSY_FLAG1_Pos                                                                 11U
#define AON_REG_PCK600_VPON_REG4X_RAP_QCH_BUSY_FLAG1_Msk                                                                 (0x1UL << AON_REG_PCK600_VPON_REG4X_RAP_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_LPQDEC_BUS_QCH_BUSY_FLAG1_Pos                                                          12U
#define AON_REG_PCK600_VPON_REG4X_LPQDEC_BUS_QCH_BUSY_FLAG1_Msk                                                          (0x1UL << AON_REG_PCK600_VPON_REG4X_LPQDEC_BUS_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_LPQDEC_QCH_BUSY_FLAG1_Pos                                                              13U
#define AON_REG_PCK600_VPON_REG4X_LPQDEC_QCH_BUSY_FLAG1_Msk                                                              (0x1UL << AON_REG_PCK600_VPON_REG4X_LPQDEC_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_LPPWM_QCH_BUSY_FLAG1_Pos                                                               14U
#define AON_REG_PCK600_VPON_REG4X_LPPWM_QCH_BUSY_FLAG1_Msk                                                               (0x1UL << AON_REG_PCK600_VPON_REG4X_LPPWM_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_LPC_BUS_QCH_BUSY_FLAG1_Pos                                                             15U
#define AON_REG_PCK600_VPON_REG4X_LPC_BUS_QCH_BUSY_FLAG1_Msk                                                             (0x1UL << AON_REG_PCK600_VPON_REG4X_LPC_BUS_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_LPC_QCH_BUSY_FLAG1_Pos                                                                 16U
#define AON_REG_PCK600_VPON_REG4X_LPC_QCH_BUSY_FLAG1_Msk                                                                 (0x1UL << AON_REG_PCK600_VPON_REG4X_LPC_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_GRTC_BUS_QCH_BUSY_FLAG1_Pos                                                            17U
#define AON_REG_PCK600_VPON_REG4X_GRTC_BUS_QCH_BUSY_FLAG1_Msk                                                            (0x1UL << AON_REG_PCK600_VPON_REG4X_GRTC_BUS_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_GRTC_QCH_BUSY_FLAG1_Pos                                                                18U
#define AON_REG_PCK600_VPON_REG4X_GRTC_QCH_BUSY_FLAG1_Msk                                                                (0x1UL << AON_REG_PCK600_VPON_REG4X_GRTC_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_BTMAC_32K_QCH_BUSY_FLAG1_Pos                                                           19U
#define AON_REG_PCK600_VPON_REG4X_BTMAC_32K_QCH_BUSY_FLAG1_Msk                                                           (0x1UL << AON_REG_PCK600_VPON_REG4X_BTMAC_32K_QCH_BUSY_FLAG1_Pos)

#define AON_REG_PCK600_VPON_REG4X_RESERVED_Pos                                                                           20U
#define AON_REG_PCK600_VPON_REG4X_RESERVED_Msk                                                                           (0xFFFUL << AON_REG_PCK600_VPON_REG4X_RESERVED_Pos)

/* 0x8E0    0x4000_08e0
    0       R       PSCM_OSC80_QCH_BUSY_FLAG0                                   1'b1
    1       R       PCSM_XTAL40_QCH_BUSY_FLAG0                                  1'b1
    2       R       PCSM_PPU_VCORE_QCH_BUSY_FLAG0                               1'b1
    3       R       PCSM_PLL1_QCH_BUSY_FLAG0                                    1'b1
    4       R       PCSM_OSC80_CG_QCH_BUSY_FLAG0                                1'b1
    5       R       WDT_BUS_QCH_BUSY_FLAG0                                      1'b1
    6       R       WDT_QCH_BUSY_FLAG0                                          1'b1
    7       R       SCH_PLN_QCH_BUSY_FLAG0                                      1'b1
    8       R       RTC_BUS_QCH_BUSY_FLAG0                                      1'b1
    9       R       RTC_QCH_BUSY_FLAG0                                          1'b1
    10      R       RAP_BUS_QCH_BUSY_FLAG0                                      1'b1
    11      R       RAP_QCH_BUSY_FLAG0                                          1'b1
    12      R       LPQDEC_BUS_QCH_BUSY_FLAG0                                   1'b1
    13      R       LPQDEC_QCH_BUSY_FLAG0                                       1'b1
    14      R       LPPWM_QCH_BUSY_FLAG0                                        1'b1
    15      R       LPC_BUS_QCH_BUSY_FLAG0                                      1'b1
    16      R       LPC_QCH_BUSY_FLAG0                                          1'b1
    17      R       GRTC_BUS_QCH_BUSY_FLAG0                                     1'b1
    18      R       GRTC_QCH_BUSY_FLAG0                                         1'b1
    19      R       BTMAC_32K_QCH_BUSY_FLAG0                                    1'b1
    30:20   R       RESERVED                                                    11'b0
    31      R/W1C   PON_DBG_QCH_BUSY_FLAG_W1C                                   1'b0
 */
typedef union _AON_REG_PCK600_VPON_REG5X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t PSCM_OSC80_QCH_BUSY_FLAG0: 1;
        uint32_t PCSM_XTAL40_QCH_BUSY_FLAG0: 1;
        uint32_t PCSM_PPU_VCORE_QCH_BUSY_FLAG0: 1;
        uint32_t PCSM_PLL1_QCH_BUSY_FLAG0: 1;
        uint32_t PCSM_OSC80_CG_QCH_BUSY_FLAG0: 1;
        uint32_t WDT_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t WDT_QCH_BUSY_FLAG0: 1;
        uint32_t SCH_PLN_QCH_BUSY_FLAG0: 1;
        uint32_t RTC_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t RTC_QCH_BUSY_FLAG0: 1;
        uint32_t RAP_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t RAP_QCH_BUSY_FLAG0: 1;
        uint32_t LPQDEC_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t LPQDEC_QCH_BUSY_FLAG0: 1;
        uint32_t LPPWM_QCH_BUSY_FLAG0: 1;
        uint32_t LPC_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t LPC_QCH_BUSY_FLAG0: 1;
        uint32_t GRTC_BUS_QCH_BUSY_FLAG0: 1;
        uint32_t GRTC_QCH_BUSY_FLAG0: 1;
        uint32_t BTMAC_32K_QCH_BUSY_FLAG0: 1;
        uint32_t RESERVED: 11;
        uint32_t PON_DBG_QCH_BUSY_FLAG_W1C: 1;
    };
} AON_REG_PCK600_VPON_REG5X_TYPE;

/*0x4000_08e0 AON_REG_PCK600_VPON_REG5X*/
#define AON_REG_PCK600_VPON_REG5X_PSCM_OSC80_QCH_BUSY_FLAG0_Pos                                                          0U
#define AON_REG_PCK600_VPON_REG5X_PSCM_OSC80_QCH_BUSY_FLAG0_Msk                                                          (0x1UL << AON_REG_PCK600_VPON_REG5X_PSCM_OSC80_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_PCSM_XTAL40_QCH_BUSY_FLAG0_Pos                                                         1U
#define AON_REG_PCK600_VPON_REG5X_PCSM_XTAL40_QCH_BUSY_FLAG0_Msk                                                         (0x1UL << AON_REG_PCK600_VPON_REG5X_PCSM_XTAL40_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_PCSM_PPU_VCORE_QCH_BUSY_FLAG0_Pos                                                      2U
#define AON_REG_PCK600_VPON_REG5X_PCSM_PPU_VCORE_QCH_BUSY_FLAG0_Msk                                                      (0x1UL << AON_REG_PCK600_VPON_REG5X_PCSM_PPU_VCORE_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_PCSM_PLL1_QCH_BUSY_FLAG0_Pos                                                           3U
#define AON_REG_PCK600_VPON_REG5X_PCSM_PLL1_QCH_BUSY_FLAG0_Msk                                                           (0x1UL << AON_REG_PCK600_VPON_REG5X_PCSM_PLL1_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_PCSM_OSC80_CG_QCH_BUSY_FLAG0_Pos                                                       4U
#define AON_REG_PCK600_VPON_REG5X_PCSM_OSC80_CG_QCH_BUSY_FLAG0_Msk                                                       (0x1UL << AON_REG_PCK600_VPON_REG5X_PCSM_OSC80_CG_QCH_BUSY_FLAG0_Pos)

