rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PCK600_VPON_REG5X_WDT_BUS_QCH_BUSY_FLAG0_Pos                                                             5U
#define AON_REG_PCK600_VPON_REG5X_WDT_BUS_QCH_BUSY_FLAG0_Msk                                                             (0x1UL << AON_REG_PCK600_VPON_REG5X_WDT_BUS_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_WDT_QCH_BUSY_FLAG0_Pos                                                                 6U
#define AON_REG_PCK600_VPON_REG5X_WDT_QCH_BUSY_FLAG0_Msk                                                                 (0x1UL << AON_REG_PCK600_VPON_REG5X_WDT_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_SCH_PLN_QCH_BUSY_FLAG0_Pos                                                             7U
#define AON_REG_PCK600_VPON_REG5X_SCH_PLN_QCH_BUSY_FLAG0_Msk                                                             (0x1UL << AON_REG_PCK600_VPON_REG5X_SCH_PLN_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_RTC_BUS_QCH_BUSY_FLAG0_Pos                                                             8U
#define AON_REG_PCK600_VPON_REG5X_RTC_BUS_QCH_BUSY_FLAG0_Msk                                                             (0x1UL << AON_REG_PCK600_VPON_REG5X_RTC_BUS_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_RTC_QCH_BUSY_FLAG0_Pos                                                                 9U
#define AON_REG_PCK600_VPON_REG5X_RTC_QCH_BUSY_FLAG0_Msk                                                                 (0x1UL << AON_REG_PCK600_VPON_REG5X_RTC_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_RAP_BUS_QCH_BUSY_FLAG0_Pos                                                             10U
#define AON_REG_PCK600_VPON_REG5X_RAP_BUS_QCH_BUSY_FLAG0_Msk                                                             (0x1UL << AON_REG_PCK600_VPON_REG5X_RAP_BUS_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_RAP_QCH_BUSY_FLAG0_Pos                                                                 11U
#define AON_REG_PCK600_VPON_REG5X_RAP_QCH_BUSY_FLAG0_Msk                                                                 (0x1UL << AON_REG_PCK600_VPON_REG5X_RAP_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_LPQDEC_BUS_QCH_BUSY_FLAG0_Pos                                                          12U
#define AON_REG_PCK600_VPON_REG5X_LPQDEC_BUS_QCH_BUSY_FLAG0_Msk                                                          (0x1UL << AON_REG_PCK600_VPON_REG5X_LPQDEC_BUS_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_LPQDEC_QCH_BUSY_FLAG0_Pos                                                              13U
#define AON_REG_PCK600_VPON_REG5X_LPQDEC_QCH_BUSY_FLAG0_Msk                                                              (0x1UL << AON_REG_PCK600_VPON_REG5X_LPQDEC_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_LPPWM_QCH_BUSY_FLAG0_Pos                                                               14U
#define AON_REG_PCK600_VPON_REG5X_LPPWM_QCH_BUSY_FLAG0_Msk                                                               (0x1UL << AON_REG_PCK600_VPON_REG5X_LPPWM_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_LPC_BUS_QCH_BUSY_FLAG0_Pos                                                             15U
#define AON_REG_PCK600_VPON_REG5X_LPC_BUS_QCH_BUSY_FLAG0_Msk                                                             (0x1UL << AON_REG_PCK600_VPON_REG5X_LPC_BUS_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_LPC_QCH_BUSY_FLAG0_Pos                                                                 16U
#define AON_REG_PCK600_VPON_REG5X_LPC_QCH_BUSY_FLAG0_Msk                                                                 (0x1UL << AON_REG_PCK600_VPON_REG5X_LPC_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_GRTC_BUS_QCH_BUSY_FLAG0_Pos                                                            17U
#define AON_REG_PCK600_VPON_REG5X_GRTC_BUS_QCH_BUSY_FLAG0_Msk                                                            (0x1UL << AON_REG_PCK600_VPON_REG5X_GRTC_BUS_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_GRTC_QCH_BUSY_FLAG0_Pos                                                                18U
#define AON_REG_PCK600_VPON_REG5X_GRTC_QCH_BUSY_FLAG0_Msk                                                                (0x1UL << AON_REG_PCK600_VPON_REG5X_GRTC_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_BTMAC_32K_QCH_BUSY_FLAG0_Pos                                                           19U
#define AON_REG_PCK600_VPON_REG5X_BTMAC_32K_QCH_BUSY_FLAG0_Msk                                                           (0x1UL << AON_REG_PCK600_VPON_REG5X_BTMAC_32K_QCH_BUSY_FLAG0_Pos)

#define AON_REG_PCK600_VPON_REG5X_RESERVED_Pos                                                                           20U
#define AON_REG_PCK600_VPON_REG5X_RESERVED_Msk                                                                           (0x7FFUL << AON_REG_PCK600_VPON_REG5X_RESERVED_Pos)

#define AON_REG_PCK600_VPON_REG5X_PON_DBG_QCH_BUSY_FLAG_W1C_Pos                                                          31U
#define AON_REG_PCK600_VPON_REG5X_PON_DBG_QCH_BUSY_FLAG_W1C_Msk                                                          (0x1UL << AON_REG_PCK600_VPON_REG5X_PON_DBG_QCH_BUSY_FLAG_W1C_Pos)

/* 0x8E4    0x4000_08e4
    11:0    R       VCORE_ON_MODE_CNT_VALUE                                     12'b0
    14:12   R       RESERVED_1                                                  3'b0
    15      R       VCORE_ON_MODE_CNT_CLAMP_FLAG                                1'b0
    30:16   R       RESERVED                                                    15'b0
    31      R/W1C   VCORE_ON_MODE_CNT_W1C                                       1'b0
 */
typedef union _AON_REG_PCK600_VPON_REG6X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t VCORE_ON_MODE_CNT_VALUE: 12;
        uint32_t RESERVED_1: 3;
        uint32_t VCORE_ON_MODE_CNT_CLAMP_FLAG: 1;
        uint32_t RESERVED: 15;
        uint32_t VCORE_ON_MODE_CNT_W1C: 1;
    };
} AON_REG_PCK600_VPON_REG6X_TYPE;

