rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_08e4 AON_REG_PCK600_VPON_REG6X*/
#define AON_REG_PCK600_VPON_REG6X_VCORE_ON_MODE_CNT_VALUE_Pos                                                            0U
#define AON_REG_PCK600_VPON_REG6X_VCORE_ON_MODE_CNT_VALUE_Msk                                                            (0xFFFUL << AON_REG_PCK600_VPON_REG6X_VCORE_ON_MODE_CNT_VALUE_Pos)

#define AON_REG_PCK600_VPON_REG6X_RESERVED_1_Pos                                                                         12U
#define AON_REG_PCK600_VPON_REG6X_RESERVED_1_Msk                                                                         (0x7UL << AON_REG_PCK600_VPON_REG6X_RESERVED_1_Pos)

#define AON_REG_PCK600_VPON_REG6X_VCORE_ON_MODE_CNT_CLAMP_FLAG_Pos                                                       15U
#define AON_REG_PCK600_VPON_REG6X_VCORE_ON_MODE_CNT_CLAMP_FLAG_Msk                                                       (0x1UL << AON_REG_PCK600_VPON_REG6X_VCORE_ON_MODE_CNT_CLAMP_FLAG_Pos)

#define AON_REG_PCK600_VPON_REG6X_RESERVED_Pos                                                                           16U
#define AON_REG_PCK600_VPON_REG6X_RESERVED_Msk                                                                           (0x7FFFUL << AON_REG_PCK600_VPON_REG6X_RESERVED_Pos)

#define AON_REG_PCK600_VPON_REG6X_VCORE_ON_MODE_CNT_W1C_Pos                                                              31U
#define AON_REG_PCK600_VPON_REG6X_VCORE_ON_MODE_CNT_W1C_Msk                                                              (0x1UL << AON_REG_PCK600_VPON_REG6X_VCORE_ON_MODE_CNT_W1C_Pos)

/* 0x718    0x4000_0718
    0       R/W     ADDA_SW_LDO2PWRCUT                                          1'b1
    1       R/W     ADDA_POW_LDO                                                1'b1
    2       R/W     ADDA_LDO_VPULSE                                             1'b0
    6:3     R/W     ADDA_LDO_SW                                                 4'b0110
    7       R/W     ADDA_DOUBLE_OP_I                                            1'b0
    8       R/W     RESERVED_6                                                  1'b1
    9       R/W     ADDA_LDO_CPT_SW                                             1'b0
    10      R/W     RESERVED_5                                                  1'b0
    11      R/W     RESERVED_4                                                  1'b0
    12      R/W     RESERVED_3                                                  1'b0
    15:13   R/W     RESERVED_2                                                  3'b100
    16      R       RESERVED_1                                                  1'b0
    31:17   R       RESERVED                                                    16'b0
 */
typedef union _AON_BT_ANAPAR_LDO_ADDA_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t ADDA_SW_LDO2PWRCUT: 1;
        uint32_t ADDA_POW_LDO: 1;
        uint32_t ADDA_LDO_VPULSE: 1;
        uint32_t ADDA_LDO_SW: 4;
        uint32_t ADDA_DOUBLE_OP_I: 1;
        uint32_t RESERVED_6: 1;
        uint32_t ADDA_LDO_CPT_SW: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 3;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 15;
    };
} AON_BT_ANAPAR_LDO_ADDA_TYPE;

/*0x4000_0718 AON_BT_ANAPAR_LDO_ADDA*/
#define AON_BT_ANAPAR_LDO_ADDA_ADDA_SW_LDO2PWRCUT_Pos                                                                    0U
#define AON_BT_ANAPAR_LDO_ADDA_ADDA_SW_LDO2PWRCUT_Msk                                                                    (0x1UL << AON_BT_ANAPAR_LDO_ADDA_ADDA_SW_LDO2PWRCUT_Pos)

#define AON_BT_ANAPAR_LDO_ADDA_ADDA_POW_LDO_Pos                                                                          1U
#define AON_BT_ANAPAR_LDO_ADDA_ADDA_POW_LDO_Msk                                                                          (0x1UL << AON_BT_ANAPAR_LDO_ADDA_ADDA_POW_LDO_Pos)

#define AON_BT_ANAPAR_LDO_ADDA_ADDA_LDO_VPULSE_Pos                                                                       2U
#define AON_BT_ANAPAR_LDO_ADDA_ADDA_LDO_VPULSE_Msk                                                                       (0x1UL << AON_BT_ANAPAR_LDO_ADDA_ADDA_LDO_VPULSE_Pos)

#define AON_BT_ANAPAR_LDO_ADDA_ADDA_LDO_SW_Pos                                                                           3U
#define AON_BT_ANAPAR_LDO_ADDA_ADDA_LDO_SW_Msk                                                                           (0xFUL << AON_BT_ANAPAR_LDO_ADDA_ADDA_LDO_SW_Pos)

#define AON_BT_ANAPAR_LDO_ADDA_ADDA_DOUBLE_OP_I_Pos                                                                      7U
#define AON_BT_ANAPAR_LDO_ADDA_ADDA_DOUBLE_OP_I_Msk                                                                      (0x1UL << AON_BT_ANAPAR_LDO_ADDA_ADDA_DOUBLE_OP_I_Pos)

#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_6_Pos                                                                            8U
#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_6_Msk                                                                            (0x1UL << AON_BT_ANAPAR_LDO_ADDA_RESERVED_6_Pos)

#define AON_BT_ANAPAR_LDO_ADDA_ADDA_LDO_CPT_SW_Pos                                                                       9U
#define AON_BT_ANAPAR_LDO_ADDA_ADDA_LDO_CPT_SW_Msk                                                                       (0x1UL << AON_BT_ANAPAR_LDO_ADDA_ADDA_LDO_CPT_SW_Pos)

#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_5_Pos                                                                            10U
#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_5_Msk                                                                            (0x1UL << AON_BT_ANAPAR_LDO_ADDA_RESERVED_5_Pos)

#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_4_Pos                                                                            11U
#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_4_Msk                                                                            (0x1UL << AON_BT_ANAPAR_LDO_ADDA_RESERVED_4_Pos)

#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_3_Pos                                                                            12U
#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_3_Msk                                                                            (0x1UL << AON_BT_ANAPAR_LDO_ADDA_RESERVED_3_Pos)

