rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_2_Pos                                                                            13U
#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_2_Msk                                                                            (0x7UL << AON_BT_ANAPAR_LDO_ADDA_RESERVED_2_Pos)

#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_1_Pos                                                                            16U
#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_1_Msk                                                                            (0x1UL << AON_BT_ANAPAR_LDO_ADDA_RESERVED_1_Pos)

#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_Pos                                                                              17U
#define AON_BT_ANAPAR_LDO_ADDA_RESERVED_Msk                                                                              (0x7FFFUL << AON_BT_ANAPAR_LDO_ADDA_RESERVED_Pos)

/* 0x71C    0x4000_071c
    0       R/W     RESERVED_6                                                  1'b0
    1       R/W     RESERVED_5                                                  1'b0
    2       R/W     RESERVED_4                                                  1'b0
    6:3     R/W     RESERVED_3                                                  4'b0000
    7       R/W     RESERVED_2                                                  1'b0
    8       R/W     RESERVED_1                                                  1'b0
    31:9    R/W     RESERVED                                                    23'h0
 */
typedef union _AON_REG_BT_ANAPAR_LDO_IQMDA_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 4;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 23;
    };
} AON_REG_BT_ANAPAR_LDO_IQMDA_TYPE;

/*0x4000_071c AON_REG_BT_ANAPAR_LDO_IQMDA*/
#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_6_Pos                                                                       0U
#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_6_Msk                                                                       (0x1UL << AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_6_Pos)

#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_5_Pos                                                                       1U
#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_5_Msk                                                                       (0x1UL << AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_5_Pos)

#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_4_Pos                                                                       2U
#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_4_Msk                                                                       (0x1UL << AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_4_Pos)

#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_3_Pos                                                                       3U
#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_3_Msk                                                                       (0xFUL << AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_3_Pos)

#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_2_Pos                                                                       7U
#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_2_Msk                                                                       (0x1UL << AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_2_Pos)

#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_1_Pos                                                                       8U
#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_1_Msk                                                                       (0x1UL << AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_1_Pos)

#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_Pos                                                                         9U
#define AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_Msk                                                                         (0x7FFFFFUL << AON_REG_BT_ANAPAR_LDO_IQMDA_RESERVED_Pos)

/* 0x720    0x4000_0720
    0       R/W     SW_LDO2PWRCUT_TPMK_ADC                                      1'b1
    1       R/W     DOUBLE_OP_I                                                 1'b0
    2       R/W     LDO_VPULSE                                                  1'b0
    6:3     R/W     LDO_SW                                                      4'b0110
    7       R/W     POW_LDO_TPMK_ADC                                            1'b1
    8       R/W     RESERVED_1                                                  1'b0
    9       R/W     EN33_LDO_CPT_SW                                             1'b0
    31:10   R/W     RESERVED                                                    23'h0
 */
typedef union _AON_BT_TPMK_ADC_LDO_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SW_LDO2PWRCUT_TPMK_ADC: 1;
        uint32_t DOUBLE_OP_I: 1;
        uint32_t LDO_VPULSE: 1;
        uint32_t LDO_SW: 4;
        uint32_t POW_LDO_TPMK_ADC: 1;
        uint32_t RESERVED_1: 1;
        uint32_t EN33_LDO_CPT_SW: 1;
        uint32_t RESERVED: 22;
    };
} AON_BT_TPMK_ADC_LDO_TYPE;

/*0x4000_0720 AON_BT_TPMK_ADC_LDO*/
#define AON_BT_TPMK_ADC_LDO_SW_LDO2PWRCUT_TPMK_ADC_Pos                                                                   0U
#define AON_BT_TPMK_ADC_LDO_SW_LDO2PWRCUT_TPMK_ADC_Msk                                                                   (0x1UL << AON_BT_TPMK_ADC_LDO_SW_LDO2PWRCUT_TPMK_ADC_Pos)

#define AON_BT_TPMK_ADC_LDO_DOUBLE_OP_I_Pos                                                                              1U
#define AON_BT_TPMK_ADC_LDO_DOUBLE_OP_I_Msk                                                                              (0x1UL << AON_BT_TPMK_ADC_LDO_DOUBLE_OP_I_Pos)

#define AON_BT_TPMK_ADC_LDO_LDO_VPULSE_Pos                                                                               2U
#define AON_BT_TPMK_ADC_LDO_LDO_VPULSE_Msk                                                                               (0x1UL << AON_BT_TPMK_ADC_LDO_LDO_VPULSE_Pos)

#define AON_BT_TPMK_ADC_LDO_LDO_SW_Pos                                                                                   3U
#define AON_BT_TPMK_ADC_LDO_LDO_SW_Msk                                                                                   (0xFUL << AON_BT_TPMK_ADC_LDO_LDO_SW_Pos)

#define AON_BT_TPMK_ADC_LDO_POW_LDO_TPMK_ADC_Pos                                                                         7U
#define AON_BT_TPMK_ADC_LDO_POW_LDO_TPMK_ADC_Msk                                                                         (0x1UL << AON_BT_TPMK_ADC_LDO_POW_LDO_TPMK_ADC_Pos)

