rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_BT_TPMK_ADC_LDO_RESERVED_1_Pos                                                                               8U
#define AON_BT_TPMK_ADC_LDO_RESERVED_1_Msk                                                                               (0x1UL << AON_BT_TPMK_ADC_LDO_RESERVED_1_Pos)

#define AON_BT_TPMK_ADC_LDO_EN33_LDO_CPT_SW_Pos                                                                          9U
#define AON_BT_TPMK_ADC_LDO_EN33_LDO_CPT_SW_Msk                                                                          (0x1UL << AON_BT_TPMK_ADC_LDO_EN33_LDO_CPT_SW_Pos)

#define AON_BT_TPMK_ADC_LDO_RESERVED_Pos                                                                                 10U
#define AON_BT_TPMK_ADC_LDO_RESERVED_Msk                                                                                 (0x3FFFFFUL << AON_BT_TPMK_ADC_LDO_RESERVED_Pos)

/* 0x9A4    0x4000_09a4
    7:0     R/W     RESERVED_3                                                  8'h0
    8       R/W     RESERVED_2                                                  1'b0
    9       R/W     RESERVED_1                                                  1'b0
    10      R/W     LOP_PON_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA                      1'b1
    11      R/W     LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA                      1'b1
    16:12   R/W     LOP_PON_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ                    5'b10011
    24:17   R/W     LOP_PON_PPU_VPON_PCSM_TUNE_VDDANA                           8'b01111010
    25      R/W     LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA                    1'b1
    26      R/W     LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA                    1'b1
    27      R/W     LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA                     1'b0
    28      R/W     LOP_PON_PPU_VPON_PCSM_POW_VDDANA_DET                        1'b1
    29      R/W     LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDANA                      1'b1
    30      R/W     RESERVED                                                    1'b1
    31      R/W     LOP_PON_OSC128K_PCSM_POW_32KOSC                             1'b1
 */
typedef union _AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_3: 8;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ: 5;
        uint32_t LOP_PON_PPU_VPON_PCSM_TUNE_VDDANA: 8;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VDDANA_DET: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDANA: 1;
        uint32_t RESERVED: 1;
        uint32_t LOP_PON_OSC128K_PCSM_POW_32KOSC: 1;
    };
} AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_TYPE;

/*0x4000_09a4 AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1*/
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_3_Pos                                                         0U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_3_Msk                                                         (0xFFUL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_3_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_2_Pos                                                         8U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_2_Msk                                                         (0x1UL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_2_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_1_Pos                                                         9U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_1_Msk                                                         (0x1UL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_1_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Pos                             10U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Msk                             (0x1UL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Pos                             11U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Msk                             (0x1UL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Pos                           12U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Msk                           (0x1FUL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_TUNE_VDDANA_Pos                                  17U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_TUNE_VDDANA_Msk                                  (0xFFUL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_TUNE_VDDANA_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Pos                           25U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Msk                           (0x1UL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Pos                           26U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Msk                           (0x1UL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Pos                            27U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Msk                            (0x1UL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Pos)

