rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDDANA_DET_Pos                               28U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDDANA_DET_Msk                               (0x1UL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDDANA_DET_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Pos                             29U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Msk                             (0x1UL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_Pos                                                           30U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_Msk                                                           (0x1UL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_OSC128K_PCSM_POW_32KOSC_Pos                                    31U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_OSC128K_PCSM_POW_32KOSC_Msk                                    (0x1UL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_PON_OSC128K_PCSM_POW_32KOSC_Pos)

/* 0x9A8    0x4000_09a8
    7:0     R/W     RESERVED                                                    8'h0
    11:8    R/W     LOP_PON_OSC10_PON_PCSM_1_DELAY                              4'b0000
    15:12   R/W     LOP_PON_OSC10_PCSM_PWR_DELAY                                4'b0000
    19:16   R/W     LOP_PON_OSC10_PCSM_VDDANA_4_DELAY                           4'b0000
    23:20   R/W     LOP_PON_OSC10_PCSM_VDDANA_3_DELAY                           4'b0000
    27:24   R/W     LOP_PON_OSC10_PCSM_VDDANA_2_DELAY                           4'b0000
    31:28   R/W     LOP_PON_OSC10_PCSM_VDDANA_DELAY                             4'b0000
 */
typedef union _AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 8;
        uint32_t LOP_PON_OSC10_PON_PCSM_1_DELAY: 4;
        uint32_t LOP_PON_OSC10_PCSM_PWR_DELAY: 4;
        uint32_t LOP_PON_OSC10_PCSM_VDDANA_4_DELAY: 4;
        uint32_t LOP_PON_OSC10_PCSM_VDDANA_3_DELAY: 4;
        uint32_t LOP_PON_OSC10_PCSM_VDDANA_2_DELAY: 4;
        uint32_t LOP_PON_OSC10_PCSM_VDDANA_DELAY: 4;
    };
} AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_TYPE;

/*0x4000_09a8 AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2*/
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_RESERVED_Pos                                                           0U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_RESERVED_Msk                                                           (0xFFUL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_RESERVED_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PON_PCSM_1_DELAY_Pos                                     8U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PON_PCSM_1_DELAY_Msk                                     (0xFUL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PON_PCSM_1_DELAY_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_PWR_DELAY_Pos                                       12U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_PWR_DELAY_Msk                                       (0xFUL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_PWR_DELAY_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_4_DELAY_Pos                                  16U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_4_DELAY_Msk                                  (0xFUL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_4_DELAY_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_3_DELAY_Pos                                  20U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_3_DELAY_Msk                                  (0xFUL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_3_DELAY_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_2_DELAY_Pos                                  24U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_2_DELAY_Msk                                  (0xFUL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_2_DELAY_Pos)

#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_DELAY_Pos                                    28U
#define AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_DELAY_Msk                                    (0xFUL << AON_LOP_PON_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_PON_OSC10_PCSM_VDDANA_DELAY_Pos)

/* 0x9AC    0x4000_09ac
    0       R/W     LOP_PON_PPU_VPON_PCSM_VDDIO_EN_DISCHG                       1'b0
    1       R/W     LOP_PON_PPU_VPON_PCSM_VDDIO_EN_PC2                          1'b1
    2       R/W     LOP_PON_PPU_VPON_PCSM_VDDIO_EN_PC1                          1'b1
    3       R/W     LOP_PON_PPU_VPON_PCSM_EN_SYNC                               1'b0
    4       R/W     LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_VDDCORE                   1'b1
    5       R/W     LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_HV18                      1'b1
    6       R/W     LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDCORE                   1'b1
    7       R/W     LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDPA                     1'b1
    8       R/W     LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_HV18                      1'b1
    9       R/W     LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_HV25                      1'b1
    10      R/W     LOP_PON_PPU_VPON_PCSM_REG_ENHQ_REFCMP                       1'b1
    11      R/W     LOP_PON_PPU_VPON_PCSM_BYP_OPOR_LD                           1'b1
    12      R/W     LOP_PON_PPU_VPON_PCSM_REG_ENLPM                             1'b0
    13      R/W     LOP_PON_PPU_VPON_PCSM_REG_ENPCCM                            1'b0
    14      R/W     LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDCORE                     1'b1
    15      R/W     LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDPA                       1'b1
    16      R/W     LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_HV18                        1'b1
    17      R/W     LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_HV25                        1'b1
    19:18   R/W     LOP_PON_PPU_VPON_PCSM_ZCDLY_SET                             2'b10
    20      R/W     LOP_PON_PPU_VPON_PCSM_ENDLY_FOR_K                           1'b1
    21      R/W     LOP_PON_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_RSTB             1'b1
    22      R/W     LOP_PON_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_RSTB              1'b1
    23      R/W     LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDCORE                    1'b0
    24      R/W     LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDPA                      1'b0
    25      R/W     LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_HV18                       1'b0
    26      R/W     LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_HV25                       1'b0
    27      R/W     LOP_PON_PPU_VPON_PCSM_POW_VDDPA_DET                         1'b1
    28      R/W     LOP_PON_PPU_VPON_PCSM_POW_HV18_DET                          1'b1
    29      R/W     LOP_PON_PPU_VPON_PCSM_POW_VDDCORE_DET                       1'b1
    30      R/W     LOP_PON_PPU_VPON_PCSM_POW_VANA_DET                          1'b1
    31      R/W     LOP_PON_PPU_VPON_PCSM_EN_BIAS_10UA                          1'b1
 */
typedef union _AON_LOP_PON_PPU_VPON_PCSM_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_PON_PPU_VPON_PCSM_VDDIO_EN_DISCHG: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_VDDIO_EN_PC2: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_VDDIO_EN_PC1: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_SYNC: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_VDDCORE: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_HV18: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDCORE: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDPA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_HV18: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_HV25: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_REG_ENHQ_REFCMP: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_BYP_OPOR_LD: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_REG_ENLPM: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_REG_ENPCCM: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDCORE: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDPA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_HV18: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_HV25: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_ZCDLY_SET: 2;
        uint32_t LOP_PON_PPU_VPON_PCSM_ENDLY_FOR_K: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_RSTB: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_RSTB: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDCORE: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDPA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_HV18: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_HV25: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VDDPA_DET: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_HV18_DET: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VDDCORE_DET: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_POW_VANA_DET: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_BIAS_10UA: 1;
    };
} AON_LOP_PON_PPU_VPON_PCSM_1_TYPE;

/*0x4000_09ac AON_LOP_PON_PPU_VPON_PCSM_1*/
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_VDDIO_EN_DISCHG_Pos                                            0U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_VDDIO_EN_DISCHG_Msk                                            (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_VDDIO_EN_DISCHG_Pos)

