rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_VDDIO_EN_PC2_Pos                                               1U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_VDDIO_EN_PC2_Msk                                               (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_VDDIO_EN_PC2_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_VDDIO_EN_PC1_Pos                                               2U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_VDDIO_EN_PC1_Msk                                               (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_VDDIO_EN_PC1_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_SYNC_Pos                                                    3U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_SYNC_Msk                                                    (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_SYNC_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_VDDCORE_Pos                                        4U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_VDDCORE_Msk                                        (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_VDDCORE_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_HV18_Pos                                           5U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_HV18_Msk                                           (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_LQ_HV18_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDCORE_Pos                                        6U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDCORE_Msk                                        (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDCORE_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDPA_Pos                                          7U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDPA_Msk                                          (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_VDDPA_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_HV18_Pos                                           8U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_HV18_Msk                                           (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_HV18_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_HV25_Pos                                           9U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_HV25_Msk                                           (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDIV_HQ_HV25_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_REG_ENHQ_REFCMP_Pos                                            10U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_REG_ENHQ_REFCMP_Msk                                            (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_REG_ENHQ_REFCMP_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_BYP_OPOR_LD_Pos                                                11U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_BYP_OPOR_LD_Msk                                                (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_BYP_OPOR_LD_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_REG_ENLPM_Pos                                                  12U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_REG_ENLPM_Msk                                                  (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_REG_ENLPM_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_REG_ENPCCM_Pos                                                 13U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_REG_ENPCCM_Msk                                                 (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_REG_ENPCCM_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDCORE_Pos                                          14U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDCORE_Msk                                          (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDCORE_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDPA_Pos                                            15U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDPA_Msk                                            (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_VDDPA_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_HV18_Pos                                             16U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_HV18_Msk                                             (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_HV18_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_HV25_Pos                                             17U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_HV25_Msk                                             (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENCCM_OUT_HV25_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ZCDLY_SET_Pos                                                  18U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ZCDLY_SET_Msk                                                  (0x3UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ZCDLY_SET_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENDLY_FOR_K_Pos                                                20U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENDLY_FOR_K_Msk                                                (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_ENDLY_FOR_K_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_RSTB_Pos                                  21U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_RSTB_Msk                                  (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_RSTB_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_RSTB_Pos                                   22U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_RSTB_Msk                                   (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_RSTB_Pos)

