rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDCORE_Pos                                         23U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDCORE_Msk                                         (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDCORE_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDPA_Pos                                           24U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDPA_Msk                                           (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_VDDPA_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_HV18_Pos                                            25U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_HV18_Msk                                            (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_HV18_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_HV25_Pos                                            26U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_HV25_Msk                                            (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_DMYLOAD_HV25_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDDPA_DET_Pos                                              27U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDDPA_DET_Msk                                              (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDDPA_DET_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_HV18_DET_Pos                                               28U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_HV18_DET_Msk                                               (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_HV18_DET_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDDCORE_DET_Pos                                            29U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDDCORE_DET_Msk                                            (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VDDCORE_DET_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VANA_DET_Pos                                               30U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VANA_DET_Msk                                               (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_POW_VANA_DET_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_BIAS_10UA_Pos                                               31U
#define AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_BIAS_10UA_Msk                                               (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_1_LOP_PON_PPU_VPON_PCSM_EN_BIAS_10UA_Pos)

/* 0x9B0    0x4000_09b0
    0       R/W     LOP_PON_PPU_VPON_PCSM_EN_MCM_FLASH_PC2                      1'b1
    1       R/W     LOP_PON_PPU_VPON_PCSM_EN_MCM_FLASH_PC1                      1'b1
    2       R/W     LOP_PON_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH                   1'b0
    3       R/W     LOP_PON_PPU_VPON_PCSM_EN_BIAS_1UA                           1'b1
    4       R/W     LOP_PON_PPU_VPON_PCSM_IO_RSTB33_EN                          1'b1
    5       R/W     LOP_PON_PPU_VPON_PCSM_IO_SHDN33_EN                          1'b1
    13:6    R/W     LOP_PON_PPU_VPON_PCSM_TUNE_VDDPA                            8'b00100010
    19:14   R/W     LOP_PON_PPU_VPON_PCSM_TUNE_HV18                             6'b100000
    24:20   R/W     LOP_PON_PPU_VPON_PCSM_SEL_VREF_HV25_HQ                      5'b01111
    25      R/W     LOP_PON_PPU_VPON_PCSM_EN_CMP_LQ_VDDCORE                     1'b1
    26      R/W     LOP_PON_PPU_VPON_PCSM_EN_CMP_LQ_HV18                        1'b1
    27      R/W     LOP_PON_PPU_VPON_PCSM_EN_CMP_LQ_HV25                        1'b1
    28      R/W     LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_VDDCORE                     1'b1
    29      R/W     LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_VDDPA                       1'b1
    30      R/W     LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_HV18                        1'b1
    31      R/W     LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_HV25                        1'b1
 */
typedef union _AON_LOP_PON_PPU_VPON_PCSM_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_MCM_FLASH_PC2: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_MCM_FLASH_PC1: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_BIAS_1UA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_IO_RSTB33_EN: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_IO_SHDN33_EN: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_TUNE_VDDPA: 8;
        uint32_t LOP_PON_PPU_VPON_PCSM_TUNE_HV18: 6;
        uint32_t LOP_PON_PPU_VPON_PCSM_SEL_VREF_HV25_HQ: 5;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_CMP_LQ_VDDCORE: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_CMP_LQ_HV18: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_CMP_LQ_HV25: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_VDDCORE: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_VDDPA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_HV18: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_CMP_HQ_HV25: 1;
    };
} AON_LOP_PON_PPU_VPON_PCSM_2_TYPE;

/*0x4000_09b0 AON_LOP_PON_PPU_VPON_PCSM_2*/
#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_MCM_FLASH_PC2_Pos                                           0U
#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_MCM_FLASH_PC2_Msk                                           (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_MCM_FLASH_PC2_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_MCM_FLASH_PC1_Pos                                           1U
#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_MCM_FLASH_PC1_Msk                                           (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_MCM_FLASH_PC1_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH_Pos                                        2U
#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH_Msk                                        (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_BIAS_1UA_Pos                                                3U
#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_BIAS_1UA_Msk                                                (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_EN_BIAS_1UA_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_IO_RSTB33_EN_Pos                                               4U
#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_IO_RSTB33_EN_Msk                                               (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_IO_RSTB33_EN_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_IO_SHDN33_EN_Pos                                               5U
#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_IO_SHDN33_EN_Msk                                               (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_IO_SHDN33_EN_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_TUNE_VDDPA_Pos                                                 6U
#define AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_TUNE_VDDPA_Msk                                                 (0xFFUL << AON_LOP_PON_PPU_VPON_PCSM_2_LOP_PON_PPU_VPON_PCSM_TUNE_VDDPA_Pos)

