rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_PPU_VPON_PCSM_3_LOP_PON_PPU_VPON_PCSM_TUNE_VDDCORE_Pos                                               24U
#define AON_LOP_PON_PPU_VPON_PCSM_3_LOP_PON_PPU_VPON_PCSM_TUNE_VDDCORE_Msk                                               (0xFFUL << AON_LOP_PON_PPU_VPON_PCSM_3_LOP_PON_PPU_VPON_PCSM_TUNE_VDDCORE_Pos)

/* 0x9B8    0x4000_09b8
    0       R/W     RESERVED_1                                                  1'h0
    1       R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_BT_MAC_VSEL                   1'b1
    2       R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_BT_MAC_CCMP_VSEL              1'b1
    3       R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_BUFFER_RAM_VSEL               1'b1
    4       R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_USB_RAM_VSEL                  1'b1
    5       R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_CAN_RAM_VSEL                  1'b1
    6       R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_CPU_RAM_VSEL                  1'b1
    7       R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_AUDIO_RAM_VSEL                1'b1
    8       R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_BTPHY_RAM_VSEL                1'b1
    9       R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_PLATFORM_ROM_VSEL             1'b1
    10      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_RETSRAM_VSEL                  1'b1
    11      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_CACHE_VSEL                    1'b1
    12      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_AMU_RAM_VSEL                  1'b1
    13      R/W     RESERVED                                                    1'h0
    14      R/W     LOP_PON_PPU_VPON_PCSM_EN_FAST_TRNAS                         1'b0
    15      R/W     LOP_PON_PPU_VPON_PCSM_LDO_PA_POS_EN_POS                     1'b1
    16      R/W     LOP_PON_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS                    1'b1
    22:17   R/W     LOP_PON_PPU_VPON_PCSM_LDO_TUNE_LDOPA                        6'b010000
    27:23   R/W     LOP_PON_PPU_VPON_PCSM_LDO_TUNE_LDOANA                       5'b10001
    28      R/W     LOP_PON_PPU_VPON_PCSM_LDO_ENPC_LDOPA                        1'b0
    29      R/W     LOP_PON_PPU_VPON_PCSM_LDO_ENPC_LDOANA                       1'b0
    30      R/W     LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOPA                         1'b1
    31      R/W     LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOANA                        1'b1
 */
typedef union _AON_LOP_PON_PPU_VPON_PCSM_4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_1: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_BT_MAC_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_BT_MAC_CCMP_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_BUFFER_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_USB_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_CAN_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_CPU_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_AUDIO_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_BTPHY_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_PLATFORM_ROM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_RETSRAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_CACHE_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_AMU_RAM_VSEL: 1;
        uint32_t RESERVED: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_FAST_TRNAS: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO_PA_POS_EN_POS: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO_TUNE_LDOPA: 6;
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO_TUNE_LDOANA: 5;
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO_ENPC_LDOPA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO_ENPC_LDOANA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOPA: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOANA: 1;
    };
} AON_LOP_PON_PPU_VPON_PCSM_4_TYPE;

/*0x4000_09b8 AON_LOP_PON_PPU_VPON_PCSM_4*/
#define AON_LOP_PON_PPU_VPON_PCSM_4_RESERVED_1_Pos                                                                       0U
#define AON_LOP_PON_PPU_VPON_PCSM_4_RESERVED_1_Msk                                                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_RESERVED_1_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BT_MAC_VSEL_Pos                                        1U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BT_MAC_VSEL_Msk                                        (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BT_MAC_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BT_MAC_CCMP_VSEL_Pos                                   2U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BT_MAC_CCMP_VSEL_Msk                                   (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BT_MAC_CCMP_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BUFFER_RAM_VSEL_Pos                                    3U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BUFFER_RAM_VSEL_Msk                                    (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BUFFER_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_USB_RAM_VSEL_Pos                                       4U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_USB_RAM_VSEL_Msk                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_USB_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_CAN_RAM_VSEL_Pos                                       5U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_CAN_RAM_VSEL_Msk                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_CAN_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_CPU_RAM_VSEL_Pos                                       6U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_CPU_RAM_VSEL_Msk                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_CPU_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_AUDIO_RAM_VSEL_Pos                                     7U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_AUDIO_RAM_VSEL_Msk                                     (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_AUDIO_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BTPHY_RAM_VSEL_Pos                                     8U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BTPHY_RAM_VSEL_Msk                                     (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_BTPHY_RAM_VSEL_Pos)

