rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_PLATFORM_ROM_VSEL_Pos                                  9U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_PLATFORM_ROM_VSEL_Msk                                  (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_PLATFORM_ROM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_RETSRAM_VSEL_Pos                                       10U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_RETSRAM_VSEL_Msk                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_RETSRAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_CACHE_VSEL_Pos                                         11U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_CACHE_VSEL_Msk                                         (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_CACHE_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_AMU_RAM_VSEL_Pos                                       12U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_AMU_RAM_VSEL_Msk                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_DVFS_HV_AMU_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_RESERVED_Pos                                                                         13U
#define AON_LOP_PON_PPU_VPON_PCSM_4_RESERVED_Msk                                                                         (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_RESERVED_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_EN_FAST_TRNAS_Pos                                              14U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_EN_FAST_TRNAS_Msk                                              (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_EN_FAST_TRNAS_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_PA_POS_EN_POS_Pos                                          15U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_PA_POS_EN_POS_Msk                                          (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_PA_POS_EN_POS_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS_Pos                                         16U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS_Msk                                         (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_TUNE_LDOPA_Pos                                             17U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_TUNE_LDOPA_Msk                                             (0x3FUL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_TUNE_LDOPA_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_TUNE_LDOANA_Pos                                            23U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_TUNE_LDOANA_Msk                                            (0x1FUL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_TUNE_LDOANA_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_ENPC_LDOPA_Pos                                             28U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_ENPC_LDOPA_Msk                                             (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_ENPC_LDOPA_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_ENPC_LDOANA_Pos                                            29U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_ENPC_LDOANA_Msk                                            (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_ENPC_LDOANA_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOPA_Pos                                              30U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOPA_Msk                                              (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOPA_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOANA_Pos                                             31U
#define AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOANA_Msk                                             (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_4_LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOANA_Pos)

/* 0x9BC    0x4000_09bc
    2:0     R/W     RESERVED_1                                                  3'h0
    10:3    R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_TUNE_VDDCORE                  8'b01110110
    18:11   R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_TUNE_VDDCORE                  8'b01110110
    19      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_BT_MAC_VSEL                   1'b0
    20      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_BT_MAC_CCMP_VSEL              1'b0
    21      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_BUFFER_RAM_VSEL               1'b0
    22      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_USB_RAM_VSEL                  1'b0
    23      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_CAN_RAM_VSEL                  1'b0
    24      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_CPU_RAM_VSEL                  1'b0
    25      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_AUDIO_RAM_VSEL                1'b0
    26      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_BTPHY_RAM_VSEL                1'b0
    27      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_PLATFORM_ROM_VSEL             1'b0
    28      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_RETSRAM_VSEL                  1'b0
    29      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_CACHE_VSEL                    1'b0
    30      R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_AMU_RAM_VSEL                  1'b0
    31      R/W     RESERVED                                                    1'h0
 */
typedef union _AON_LOP_PON_PPU_VPON_PCSM_5_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_1: 3;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_TUNE_VDDCORE: 8;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_TUNE_VDDCORE: 8;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_BT_MAC_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_BT_MAC_CCMP_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_BUFFER_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_USB_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_CAN_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_CPU_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_AUDIO_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_BTPHY_RAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_PLATFORM_ROM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_RETSRAM_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_CACHE_VSEL: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_AMU_RAM_VSEL: 1;
        uint32_t RESERVED: 1;
    };
} AON_LOP_PON_PPU_VPON_PCSM_5_TYPE;

/*0x4000_09bc AON_LOP_PON_PPU_VPON_PCSM_5*/
#define AON_LOP_PON_PPU_VPON_PCSM_5_RESERVED_1_Pos                                                                       0U
#define AON_LOP_PON_PPU_VPON_PCSM_5_RESERVED_1_Msk                                                                       (0x7UL << AON_LOP_PON_PPU_VPON_PCSM_5_RESERVED_1_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_TUNE_VDDCORE_Pos                                       3U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_TUNE_VDDCORE_Msk                                       (0xFFUL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_TUNE_VDDCORE_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_HV_TUNE_VDDCORE_Pos                                       11U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_HV_TUNE_VDDCORE_Msk                                       (0xFFUL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_HV_TUNE_VDDCORE_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BT_MAC_VSEL_Pos                                        19U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BT_MAC_VSEL_Msk                                        (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BT_MAC_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BT_MAC_CCMP_VSEL_Pos                                   20U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BT_MAC_CCMP_VSEL_Msk                                   (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BT_MAC_CCMP_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BUFFER_RAM_VSEL_Pos                                    21U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BUFFER_RAM_VSEL_Msk                                    (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BUFFER_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_USB_RAM_VSEL_Pos                                       22U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_USB_RAM_VSEL_Msk                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_USB_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_CAN_RAM_VSEL_Pos                                       23U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_CAN_RAM_VSEL_Msk                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_CAN_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_CPU_RAM_VSEL_Pos                                       24U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_CPU_RAM_VSEL_Msk                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_CPU_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_AUDIO_RAM_VSEL_Pos                                     25U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_AUDIO_RAM_VSEL_Msk                                     (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_AUDIO_RAM_VSEL_Pos)

