rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BTPHY_RAM_VSEL_Pos                                     26U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BTPHY_RAM_VSEL_Msk                                     (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_BTPHY_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_PLATFORM_ROM_VSEL_Pos                                  27U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_PLATFORM_ROM_VSEL_Msk                                  (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_PLATFORM_ROM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_RETSRAM_VSEL_Pos                                       28U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_RETSRAM_VSEL_Msk                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_RETSRAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_CACHE_VSEL_Pos                                         29U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_CACHE_VSEL_Msk                                         (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_CACHE_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_AMU_RAM_VSEL_Pos                                       30U
#define AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_AMU_RAM_VSEL_Msk                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_LOP_PON_PPU_VPON_PCSM_DVFS_LV_AMU_RAM_VSEL_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_5_RESERVED_Pos                                                                         31U
#define AON_LOP_PON_PPU_VPON_PCSM_5_RESERVED_Msk                                                                         (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_5_RESERVED_Pos)

/* 0x9C0    0x4000_09c0
    3:0     R/W     LOP_PON_PPU_VPON_PCSM_SWR4_DELAY                            4'b1010
    7:4     R/W     LOP_PON_PPU_VPON_PCSM_SWR3_DELAY                            4'b0000
    11:8    R/W     LOP_PON_PPU_VPON_PCSM_SWR2_DELAY                            4'b0010
    15:12   R/W     LOP_PON_PPU_VPON_PCSM_SWR1_DELAY                            4'b0011
    23:16   R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_TUNE_VDDANA                   8'b01111010
    31:24   R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_TUNE_VDDANA                   8'b01111010
 */
typedef union _AON_LOP_PON_PPU_VPON_PCSM_6_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_PON_PPU_VPON_PCSM_SWR4_DELAY: 4;
        uint32_t LOP_PON_PPU_VPON_PCSM_SWR3_DELAY: 4;
        uint32_t LOP_PON_PPU_VPON_PCSM_SWR2_DELAY: 4;
        uint32_t LOP_PON_PPU_VPON_PCSM_SWR1_DELAY: 4;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_TUNE_VDDANA: 8;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_TUNE_VDDANA: 8;
    };
} AON_LOP_PON_PPU_VPON_PCSM_6_TYPE;

/*0x4000_09c0 AON_LOP_PON_PPU_VPON_PCSM_6*/
#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR4_DELAY_Pos                                                 0U
#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR4_DELAY_Msk                                                 (0xFUL << AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR4_DELAY_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR3_DELAY_Pos                                                 4U
#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR3_DELAY_Msk                                                 (0xFUL << AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR3_DELAY_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR2_DELAY_Pos                                                 8U
#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR2_DELAY_Msk                                                 (0xFUL << AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR2_DELAY_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR1_DELAY_Pos                                                 12U
#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR1_DELAY_Msk                                                 (0xFUL << AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_SWR1_DELAY_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_DVFS_LV_TUNE_VDDANA_Pos                                        16U
#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_DVFS_LV_TUNE_VDDANA_Msk                                        (0xFFUL << AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_DVFS_LV_TUNE_VDDANA_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_DVFS_HV_TUNE_VDDANA_Pos                                        24U
#define AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_DVFS_HV_TUNE_VDDANA_Msk                                        (0xFFUL << AON_LOP_PON_PPU_VPON_PCSM_6_LOP_PON_PPU_VPON_PCSM_DVFS_HV_TUNE_VDDANA_Pos)

/* 0x9C4    0x4000_09c4
    1:0     R/W     LOP_PON_PPU_VPON_PCSM_LDO2_DELAY_MSB                        2'b01
    5:2     R/W     LOP_PON_PPU_VPON_PCSM_DVFS_LV_DELAY                         4'b0001
    9:6     R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_DELAY                         4'b0000
    13:10   R/W     LOP_PON_PPU_VPON_PCSM_2_DELAY                               4'b0000
    17:14   R/W     LOP_PON_PPU_VPON_PCSM_1_DELAY                               4'b0000
    21:18   R/W     LOP_PON_PPU_VPON_PCSM_LDO2_DELAY                            4'b0001
    25:22   R/W     LOP_PON_PPU_VPON_PCSM_LDO1_DELAY                            4'b0000
    31:26   R/W     LOP_PON_PPU_VPON_PCSM_SWR5_DELAY                            6'b010001
 */
typedef union _AON_LOP_PON_PPU_VPON_PCSM_7_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO2_DELAY_MSB: 2;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_LV_DELAY: 4;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_DELAY: 4;
        uint32_t LOP_PON_PPU_VPON_PCSM_2_DELAY: 4;
        uint32_t LOP_PON_PPU_VPON_PCSM_1_DELAY: 4;
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO2_DELAY: 4;
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO1_DELAY: 4;
        uint32_t LOP_PON_PPU_VPON_PCSM_SWR5_DELAY: 6;
    };
} AON_LOP_PON_PPU_VPON_PCSM_7_TYPE;

/*0x4000_09c4 AON_LOP_PON_PPU_VPON_PCSM_7*/
#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_LDO2_DELAY_MSB_Pos                                             0U
#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_LDO2_DELAY_MSB_Msk                                             (0x3UL << AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_LDO2_DELAY_MSB_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_DVFS_LV_DELAY_Pos                                              2U
#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_DVFS_LV_DELAY_Msk                                              (0xFUL << AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_DVFS_LV_DELAY_Pos)

