rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_DVFS_HV_DELAY_Pos                                              6U
#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_DVFS_HV_DELAY_Msk                                              (0xFUL << AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_DVFS_HV_DELAY_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_2_DELAY_Pos                                                    10U
#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_2_DELAY_Msk                                                    (0xFUL << AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_2_DELAY_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_1_DELAY_Pos                                                    14U
#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_1_DELAY_Msk                                                    (0xFUL << AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_1_DELAY_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_LDO2_DELAY_Pos                                                 18U
#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_LDO2_DELAY_Msk                                                 (0xFUL << AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_LDO2_DELAY_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_LDO1_DELAY_Pos                                                 22U
#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_LDO1_DELAY_Msk                                                 (0xFUL << AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_LDO1_DELAY_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_SWR5_DELAY_Pos                                                 26U
#define AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_SWR5_DELAY_Msk                                                 (0x3FUL << AON_LOP_PON_PPU_VPON_PCSM_7_LOP_PON_PPU_VPON_PCSM_SWR5_DELAY_Pos)

/* 0x9C8    0x4000_09c8
    13:0    R/W     RESERVED_2                                                  14'h0
    14      R/W     RESERVED_1                                                  1'b0
    15      R/W     LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOANA_PARKING_START          1'b0
    16      R/W     RESERVED                                                    1'b0
    20:17   R/W     LOP_PON_PPU_VPON_PCSM_DVFS_HV_ACCEPT_DELAY                  4'b0001
    21      R/W     LOP_PON_PPU_VPON_PCSM_ENB_AUTO_PS                           1'b1
    22      R/W     LOP_PON_PPU_VPON_PCSM_SEL_SYNC2                             1'b1
    23      R/W     LOP_PON_PPU_VPON_PCSM_EN_SYNC2                              1'b0
    24      R/W     LOP_PON_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B                       1'b1
    29:25   R/W     LOP_PON_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2                    5'b11000
    30      R/W     LOP_PON_PPU_VPON_PCSM_EN_VO3CMPHQ2                          1'b0
    31      R/W     LOP_PON_PPU_VPON_PCSM_EN_VO3HQ2BETA                         1'b1
 */
typedef union _AON_LOP_PON_PPU_VPON_PCSM_8_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_2: 14;
        uint32_t RESERVED_1: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOANA_PARKING_START: 1;
        uint32_t RESERVED: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_DVFS_HV_ACCEPT_DELAY: 4;
        uint32_t LOP_PON_PPU_VPON_PCSM_ENB_AUTO_PS: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_SEL_SYNC2: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_SYNC2: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2: 5;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_VO3CMPHQ2: 1;
        uint32_t LOP_PON_PPU_VPON_PCSM_EN_VO3HQ2BETA: 1;
    };
} AON_LOP_PON_PPU_VPON_PCSM_8_TYPE;

/*0x4000_09c8 AON_LOP_PON_PPU_VPON_PCSM_8*/
#define AON_LOP_PON_PPU_VPON_PCSM_8_RESERVED_2_Pos                                                                       0U
#define AON_LOP_PON_PPU_VPON_PCSM_8_RESERVED_2_Msk                                                                       (0x3FFFUL << AON_LOP_PON_PPU_VPON_PCSM_8_RESERVED_2_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_8_RESERVED_1_Pos                                                                       14U
#define AON_LOP_PON_PPU_VPON_PCSM_8_RESERVED_1_Msk                                                                       (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_8_RESERVED_1_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOANA_PARKING_START_Pos                               15U
#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOANA_PARKING_START_Msk                               (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_LDO_POW_LDOANA_PARKING_START_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_8_RESERVED_Pos                                                                         16U
#define AON_LOP_PON_PPU_VPON_PCSM_8_RESERVED_Msk                                                                         (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_8_RESERVED_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_DVFS_HV_ACCEPT_DELAY_Pos                                       17U
#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_DVFS_HV_ACCEPT_DELAY_Msk                                       (0xFUL << AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_DVFS_HV_ACCEPT_DELAY_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_ENB_AUTO_PS_Pos                                                21U
#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_ENB_AUTO_PS_Msk                                                (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_ENB_AUTO_PS_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_SEL_SYNC2_Pos                                                  22U
#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_SEL_SYNC2_Msk                                                  (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_SEL_SYNC2_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_EN_SYNC2_Pos                                                   23U
#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_EN_SYNC2_Msk                                                   (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_EN_SYNC2_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B_Pos                                            24U
#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B_Msk                                            (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2_Pos                                         25U
#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2_Msk                                         (0x1FUL << AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_EN_VO3CMPHQ2_Pos                                               30U
#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_EN_VO3CMPHQ2_Msk                                               (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_EN_VO3CMPHQ2_Pos)

#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_EN_VO3HQ2BETA_Pos                                              31U
#define AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_EN_VO3HQ2BETA_Msk                                              (0x1UL << AON_LOP_PON_PPU_VPON_PCSM_8_LOP_PON_PPU_VPON_PCSM_EN_VO3HQ2BETA_Pos)

/* 0x9CC    0x4000_09cc
    1:0     R/W     RESERVED                                                    2'b00
    5:2     R/W     LOP_PON_PPU_VCORE1_PCSM_2_DELAY                             4'b0001
    9:6     R/W     LOP_PON_PLL1_PCSM_3_DELAY                                   4'b0110
    13:10   R/W     LOP_PON_PLL1_PCSM_2_DELAY                                   4'b0001
    17:14   R/W     LOP_PON_PLL1_PCSM_1_DELAY                                   4'b0011
    18      R/W     LOP_PON_PLL1_PCSM_PLL1_LDO_DIG_SW_LDO2PWRCUT                1'b0
    19      R/W     LOP_PON_PLL1_PCSM_PLL1_LDO_ANA_SW_LDO2PWRCUT                1'b0
    23:20   R/W     LOP_PON_OSC80_PCSM_1_DELAY                                  4'b0111
    31:24   R/W     LOP_PON_XTAL40_PCSM_2_DELAY                                 8'b00011100
 */
typedef union _AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 2;
        uint32_t LOP_PON_PPU_VCORE1_PCSM_2_DELAY: 4;
        uint32_t LOP_PON_PLL1_PCSM_3_DELAY: 4;
        uint32_t LOP_PON_PLL1_PCSM_2_DELAY: 4;
        uint32_t LOP_PON_PLL1_PCSM_1_DELAY: 4;
        uint32_t LOP_PON_PLL1_PCSM_PLL1_LDO_DIG_SW_LDO2PWRCUT: 1;
        uint32_t LOP_PON_PLL1_PCSM_PLL1_LDO_ANA_SW_LDO2PWRCUT: 1;
        uint32_t LOP_PON_OSC80_PCSM_1_DELAY: 4;
        uint32_t LOP_PON_XTAL40_PCSM_2_DELAY: 8;
    };
} AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_TYPE;

/*0x4000_09cc AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1*/
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_RESERVED_Pos                                                                  0U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_RESERVED_Msk                                                                  (0x3UL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_RESERVED_Pos)

