rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_2_DELAY_Pos                                           2U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_2_DELAY_Msk                                           (0xFUL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_2_DELAY_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_3_DELAY_Pos                                                 6U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_3_DELAY_Msk                                                 (0xFUL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_3_DELAY_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_2_DELAY_Pos                                                 10U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_2_DELAY_Msk                                                 (0xFUL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_2_DELAY_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_1_DELAY_Pos                                                 14U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_1_DELAY_Msk                                                 (0xFUL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_1_DELAY_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_PLL1_LDO_DIG_SW_LDO2PWRCUT_Pos                              18U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_PLL1_LDO_DIG_SW_LDO2PWRCUT_Msk                              (0x1UL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_PLL1_LDO_DIG_SW_LDO2PWRCUT_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_PLL1_LDO_ANA_SW_LDO2PWRCUT_Pos                              19U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_PLL1_LDO_ANA_SW_LDO2PWRCUT_Msk                              (0x1UL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_PLL1_PCSM_PLL1_LDO_ANA_SW_LDO2PWRCUT_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_OSC80_PCSM_1_DELAY_Pos                                                20U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_OSC80_PCSM_1_DELAY_Msk                                                (0xFUL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_OSC80_PCSM_1_DELAY_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_XTAL40_PCSM_2_DELAY_Pos                                               24U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_XTAL40_PCSM_2_DELAY_Msk                                               (0xFFUL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_1_LOP_PON_XTAL40_PCSM_2_DELAY_Pos)

/* 0x9D0    0x4000_09d0
    2:0     R/W     RESERVED_1                                                  3'b0
    5:3     R/W     RESERVED                                                    3'b0
    6       R/W     LOP_PON_VCORE_OP1_PADRV_PCUT_CTRL_SEL                       1'b1
    10:7    R/W     LOP_PON_VCORE_OP1_5_PCSM_DELAY                              4'b0000
    14:11   R/W     LOP_PON_VCORE_OP1_4_PCSM_DELAY                              4'b1111
    18:15   R/W     LOP_PON_VCORE_OP1_3_PCSM_DELAY                              4'b0001
    22:19   R/W     LOP_PON_VCORE_OP1_2_PCSM_DELAY                              4'b0001
    26:23   R/W     LOP_PON_VCORE_OP1_1_PCSM_DELAY                              4'b0001
    27      R/W     LOP_PON_VCORE_OP1_PCSM_SPIC_PDEX_CMD                        1'b0
    28      R/W     LOP_PON_VCORE_OP1_PCSM_SPIC_PDEX_REQ                        1'b1
    29      R/W     LOP_PON_VCORE_OP1_PCSM_SEL_EFLASH_HV18                      1'b0
    30      R/W     LOP_PON_VCORE_OP1_PCSM_SEL_EFLASH_HV25                      1'b1
    31      R/W     LOP_PON_PPU_VCORE1_PCSM_REG_ENLPM                           1'b0
 */
typedef union _AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_1: 3;
        uint32_t RESERVED: 3;
        uint32_t LOP_PON_VCORE_OP1_PADRV_PCUT_CTRL_SEL: 1;
        uint32_t LOP_PON_VCORE_OP1_5_PCSM_DELAY: 4;
        uint32_t LOP_PON_VCORE_OP1_4_PCSM_DELAY: 4;
        uint32_t LOP_PON_VCORE_OP1_3_PCSM_DELAY: 4;
        uint32_t LOP_PON_VCORE_OP1_2_PCSM_DELAY: 4;
        uint32_t LOP_PON_VCORE_OP1_1_PCSM_DELAY: 4;
        uint32_t LOP_PON_VCORE_OP1_PCSM_SPIC_PDEX_CMD: 1;
        uint32_t LOP_PON_VCORE_OP1_PCSM_SPIC_PDEX_REQ: 1;
        uint32_t LOP_PON_VCORE_OP1_PCSM_SEL_EFLASH_HV18: 1;
        uint32_t LOP_PON_VCORE_OP1_PCSM_SEL_EFLASH_HV25: 1;
        uint32_t LOP_PON_PPU_VCORE1_PCSM_REG_ENLPM: 1;
    };
} AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_TYPE;

/*0x4000_09d0 AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2*/
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_RESERVED_1_Pos                                                                0U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_RESERVED_1_Msk                                                                (0x7UL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_RESERVED_1_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_RESERVED_Pos                                                                  3U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_RESERVED_Msk                                                                  (0x7UL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_RESERVED_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PADRV_PCUT_CTRL_SEL_Pos                                     6U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PADRV_PCUT_CTRL_SEL_Msk                                     (0x1UL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PADRV_PCUT_CTRL_SEL_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_5_PCSM_DELAY_Pos                                            7U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_5_PCSM_DELAY_Msk                                            (0xFUL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_5_PCSM_DELAY_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_4_PCSM_DELAY_Pos                                            11U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_4_PCSM_DELAY_Msk                                            (0xFUL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_4_PCSM_DELAY_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_3_PCSM_DELAY_Pos                                            15U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_3_PCSM_DELAY_Msk                                            (0xFUL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_3_PCSM_DELAY_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_2_PCSM_DELAY_Pos                                            19U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_2_PCSM_DELAY_Msk                                            (0xFUL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_2_PCSM_DELAY_Pos)

