rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_1_PCSM_DELAY_Pos                                            23U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_1_PCSM_DELAY_Msk                                            (0xFUL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_1_PCSM_DELAY_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SPIC_PDEX_CMD_Pos                                      27U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SPIC_PDEX_CMD_Msk                                      (0x1UL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SPIC_PDEX_CMD_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SPIC_PDEX_REQ_Pos                                      28U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SPIC_PDEX_REQ_Msk                                      (0x1UL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SPIC_PDEX_REQ_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SEL_EFLASH_HV18_Pos                                    29U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SEL_EFLASH_HV18_Msk                                    (0x1UL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SEL_EFLASH_HV18_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SEL_EFLASH_HV25_Pos                                    30U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SEL_EFLASH_HV25_Msk                                    (0x1UL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_VCORE_OP1_PCSM_SEL_EFLASH_HV25_Pos)

#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_PPU_VCORE1_PCSM_REG_ENLPM_Pos                                         31U
#define AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_PPU_VCORE1_PCSM_REG_ENLPM_Msk                                         (0x1UL << AON_LOP_PON_OTHER_PCSM_SWAP_PCSM_2_LOP_PON_PPU_VCORE1_PCSM_REG_ENLPM_Pos)

/* 0xA30    0x4000_0a30
    7:0     R/W     RESERVED_3                                                  8'h0
    8       R/W     RESERVED_2                                                  1'b0
    9       R/W     RESERVED_1                                                  1'b0
    10      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA                  1'b1
    11      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA                  1'b0
    16:12   R/W     LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ                5'b01001
    24:17   R/W     LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDANA                       8'b01111010
    25      R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA                1'b1
    26      R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA                1'b0
    27      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA                 1'b0
    28      R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDANA_DET                    1'b1
    29      R/W     LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDANA                  1'b1
    30      R/W     RESERVED                                                    1'b0
    31      R/W     LOP_POF_OSC128K_PCSM_POW_32KOSC                             1'b1
 */
typedef union _AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_3: 8;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ: 5;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDANA: 8;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDANA_DET: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDANA: 1;
        uint32_t RESERVED: 1;
        uint32_t LOP_POF_OSC128K_PCSM_POW_32KOSC: 1;
    };
} AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_TYPE;

/*0x4000_0a30 AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1*/
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_3_Pos                                                         0U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_3_Msk                                                         (0xFFUL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_3_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_2_Pos                                                         8U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_2_Msk                                                         (0x1UL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_2_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_1_Pos                                                         9U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_1_Msk                                                         (0x1UL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_1_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Pos                         10U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Msk                         (0x1UL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Pos                         11U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Msk                         (0x1UL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Pos                       12U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Msk                       (0x1FUL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDANA_Pos                              17U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDANA_Msk                              (0xFFUL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDANA_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Pos                       25U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Msk                       (0x1UL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Pos                       26U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Msk                       (0x1UL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Pos                        27U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Msk                        (0x1UL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDANA_DET_Pos                           28U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDANA_DET_Msk                           (0x1UL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDANA_DET_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Pos                         29U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Msk                         (0x1UL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_Pos                                                           30U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_Msk                                                           (0x1UL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_RESERVED_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OSC128K_PCSM_POW_32KOSC_Pos                                    31U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OSC128K_PCSM_POW_32KOSC_Msk                                    (0x1UL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_1_LOP_POF_OSC128K_PCSM_POW_32KOSC_Pos)

/* 0xA34    0x4000_0a34
    7:0     R/W     RESERVED                                                    8'h0
    11:8    R/W     LOP_POF_OSC10_PON_PCSM_INACTIVE_DELAY                       4'b0000
    15:12   R/W     LOP_POF_OSC10_PCSM_VDDANA_2_DELAY                           4'b0000
    19:16   R/W     LOP_POF_OSC10_PCSM_VDDANA_3_DELAY                           4'b0000
    23:20   R/W     LOP_POF_OSC10_PCSM_VDDANA_4_DELAY                           4'b0000
    27:24   R/W     LOP_POF_OSC10_PCSM_PWR_DELAY                                4'b0000
    31:28   R/W     LOP_POF_OSC10_PCSM_INACTIVE_DELAY                           4'b0000
 */
typedef union _AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 8;
        uint32_t LOP_POF_OSC10_PON_PCSM_INACTIVE_DELAY: 4;
        uint32_t LOP_POF_OSC10_PCSM_VDDANA_2_DELAY: 4;
        uint32_t LOP_POF_OSC10_PCSM_VDDANA_3_DELAY: 4;
        uint32_t LOP_POF_OSC10_PCSM_VDDANA_4_DELAY: 4;
        uint32_t LOP_POF_OSC10_PCSM_PWR_DELAY: 4;
        uint32_t LOP_POF_OSC10_PCSM_INACTIVE_DELAY: 4;
    };
} AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_TYPE;

/*0x4000_0a34 AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2*/
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_RESERVED_Pos                                                           0U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_RESERVED_Msk                                                           (0xFFUL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_RESERVED_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PON_PCSM_INACTIVE_DELAY_Pos                              8U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PON_PCSM_INACTIVE_DELAY_Msk                              (0xFUL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PON_PCSM_INACTIVE_DELAY_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_VDDANA_2_DELAY_Pos                                  12U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_VDDANA_2_DELAY_Msk                                  (0xFUL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_VDDANA_2_DELAY_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_VDDANA_3_DELAY_Pos                                  16U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_VDDANA_3_DELAY_Msk                                  (0xFUL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_VDDANA_3_DELAY_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_VDDANA_4_DELAY_Pos                                  20U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_VDDANA_4_DELAY_Msk                                  (0xFUL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_VDDANA_4_DELAY_Pos)

#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_PWR_DELAY_Pos                                       24U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_PWR_DELAY_Msk                                       (0xFUL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_PWR_DELAY_Pos)

