rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_INACTIVE_DELAY_Pos                                  28U
#define AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_INACTIVE_DELAY_Msk                                  (0xFUL << AON_LOP_POF_CLK_CTRL_OSC128K_OSC10_PCSM_2_LOP_POF_OSC10_PCSM_INACTIVE_DELAY_Pos)

/* 0xA38    0x4000_0a38
    0       R/W     LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_DISCHG                   1'b0
    1       R/W     LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_PC2                      1'b1
    2       R/W     LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_PC1                      1'b1
    3       R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_SYNC                           1'b0
    4       R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDCORE               1'b0
    5       R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_HV18                  1'b0
    6       R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDCORE               1'b0
    7       R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDPA                 1'b0
    8       R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_HV18                  1'b0
    9       R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_HV25                  1'b0
    10      R/W     LOP_POF_OFF_PPU_VPON_PCSM_REG_ENHQ_REFCMP                   1'b0
    11      R/W     LOP_POF_OFF_PPU_VPON_PCSM_BYP_OPOR_LD                       1'b0
    12      R/W     LOP_POF_OFF_PPU_VPON_PCSM_REG_ENLPM                         1'b1
    13      R/W     LOP_POF_OFF_PPU_VPON_PCSM_REG_ENPCCM                        1'b0
    14      R/W     LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDCORE                 1'b0
    15      R/W     LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDPA                   1'b0
    16      R/W     LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_HV18                    1'b0
    17      R/W     LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_HV25                    1'b0
    19:18   R/W     LOP_POF_OFF_PPU_VPON_PCSM_ZCDLY_SET                         2'b10
    20      R/W     LOP_POF_OFF_PPU_VPON_PCSM_ENDLY_FOR_K                       1'b1
    21      R/W     LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_RSTB         1'b0
    22      R/W     LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_RSTB          1'b0
    23      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDCORE                1'b0
    24      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDPA                  1'b0
    25      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_HV18                   1'b0
    26      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_HV25                   1'b0
    27      R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDPA_DET                     1'b0
    28      R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_HV18_DET                      1'b0
    29      R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDCORE_DET                   1'b0
    30      R/W     LOP_POF_OFF_PPU_VPON_PCSM_POW_VANA_DET                      1'b0
    31      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_BIAS_10UA                      1'b0
 */
typedef union _AON_LOP_POF_OFF_PPU_VPON_PCSM_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_DISCHG: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_PC2: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_PC1: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_SYNC: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDCORE: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_HV18: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDCORE: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDPA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_HV18: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_HV25: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_REG_ENHQ_REFCMP: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_BYP_OPOR_LD: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_REG_ENLPM: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_REG_ENPCCM: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDCORE: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDPA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_HV18: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_ENCCM_OUT_HV25: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_ZCDLY_SET: 2;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_ENDLY_FOR_K: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_RSTB: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_RSTB: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDCORE: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDPA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_HV18: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_HV25: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDPA_DET: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_HV18_DET: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDCORE_DET: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_POW_VANA_DET: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_BIAS_10UA: 1;
    };
} AON_LOP_POF_OFF_PPU_VPON_PCSM_1_TYPE;

/*0x4000_0a38 AON_LOP_POF_OFF_PPU_VPON_PCSM_1*/
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_DISCHG_Pos                                    0U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_DISCHG_Msk                                    (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_DISCHG_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_PC2_Pos                                       1U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_PC2_Msk                                       (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_PC2_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_PC1_Pos                                       2U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_PC1_Msk                                       (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_VDDIO_EN_PC1_Pos)

