rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDPA_Pos                                   24U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDPA_Msk                                   (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDPA_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_HV18_Pos                                    25U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_HV18_Msk                                    (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_HV18_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_HV25_Pos                                    26U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_HV25_Msk                                    (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_DMYLOAD_HV25_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDPA_DET_Pos                                      27U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDPA_DET_Msk                                      (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDPA_DET_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_HV18_DET_Pos                                       28U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_HV18_DET_Msk                                       (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_HV18_DET_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDCORE_DET_Pos                                    29U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDCORE_DET_Msk                                    (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VDDCORE_DET_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VANA_DET_Pos                                       30U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VANA_DET_Msk                                       (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_POW_VANA_DET_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_BIAS_10UA_Pos                                       31U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_BIAS_10UA_Msk                                       (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_1_LOP_POF_OFF_PPU_VPON_PCSM_EN_BIAS_10UA_Pos)

/* 0xA3C    0x4000_0a3c
    0       R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_MCM_FLASH_PC2                  1'b0
    1       R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_MCM_FLASH_PC1                  1'b0
    2       R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH               1'b1
    3       R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_BIAS_1UA                       1'b0
    4       R/W     LOP_POF_OFF_PPU_VPON_PCSM_IO_RSTB33_EN                      1'b1
    5       R/W     LOP_POF_OFF_PPU_VPON_PCSM_IO_SHDN33_EN                      1'b1
    13:6    R/W     LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDPA                        8'b00100010
    19:14   R/W     LOP_POF_OFF_PPU_VPON_PCSM_TUNE_HV18                         6'b100000
    24:20   R/W     LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_HQ                  5'b01111
    25      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDCORE                 1'b0
    26      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_HV18                    1'b0
    27      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_HV25                    1'b1
    28      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDCORE                 1'b0
    29      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDPA                   1'b0
    30      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_HV18                    1'b0
    31      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_HV25                    1'b0
 */
typedef union _AON_LOP_POF_OFF_PPU_VPON_PCSM_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_MCM_FLASH_PC2: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_MCM_FLASH_PC1: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_BIAS_1UA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_IO_RSTB33_EN: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_IO_SHDN33_EN: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDPA: 8;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_TUNE_HV18: 6;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_HQ: 5;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDCORE: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_HV18: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_HV25: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDCORE: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDPA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_HV18: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_HV25: 1;
    };
} AON_LOP_POF_OFF_PPU_VPON_PCSM_2_TYPE;

/*0x4000_0a3c AON_LOP_POF_OFF_PPU_VPON_PCSM_2*/
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_MCM_FLASH_PC2_Pos                                   0U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_MCM_FLASH_PC2_Msk                                   (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_MCM_FLASH_PC2_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_MCM_FLASH_PC1_Pos                                   1U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_MCM_FLASH_PC1_Msk                                   (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_MCM_FLASH_PC1_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH_Pos                                2U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH_Msk                                (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH_Pos)

