rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_BIAS_1UA_Pos                                        3U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_BIAS_1UA_Msk                                        (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_BIAS_1UA_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_IO_RSTB33_EN_Pos                                       4U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_IO_RSTB33_EN_Msk                                       (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_IO_RSTB33_EN_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_IO_SHDN33_EN_Pos                                       5U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_IO_SHDN33_EN_Msk                                       (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_IO_SHDN33_EN_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDPA_Pos                                         6U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDPA_Msk                                         (0xFFUL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDPA_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_HV18_Pos                                          14U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_HV18_Msk                                          (0x3FUL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_HV18_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_HQ_Pos                                   20U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_HQ_Msk                                   (0x1FUL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_HQ_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDCORE_Pos                                  25U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDCORE_Msk                                  (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDCORE_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_HV18_Pos                                     26U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_HV18_Msk                                     (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_HV18_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_HV25_Pos                                     27U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_HV25_Msk                                     (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_LQ_HV25_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDCORE_Pos                                  28U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDCORE_Msk                                  (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDCORE_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDPA_Pos                                    29U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDPA_Msk                                    (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDPA_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_HV18_Pos                                     30U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_HV18_Msk                                     (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_HV18_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_HV25_Pos                                     31U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_HV25_Msk                                     (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_2_LOP_POF_OFF_PPU_VPON_PCSM_EN_CMP_HQ_HV25_Pos)

/* 0xA40    0x4000_0a40
    1:0     R/W     RESERVED                                                    2'h0
    2       R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_PA_POS_RSTB                   1'b0
    3       R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_ANA_POS_RSTB                  1'b0
    4       R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_BIAS_LDOPA                1'b0
    5       R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_BIAS_LDOANA               1'b0
    6       R/W     LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_EN_POS       1'b0
    7       R/W     LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_EN_POS        1'b0
    12:8    R/W     LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDCORE_LQ               5'b01110
    18:13   R/W     LOP_POF_OFF_PPU_VPON_PCSM_TUNE_LPM_HV18                     6'b100000
    23:19   R/W     LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_LQ                  5'b01111
    31:24   R/W     LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDCORE                      8'b01100010
 */
typedef union _AON_LOP_POF_OFF_PPU_VPON_PCSM_3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 2;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_PA_POS_RSTB: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_ANA_POS_RSTB: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_BIAS_LDOPA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_BIAS_LDOANA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_EN_POS: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_EN_POS: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDCORE_LQ: 5;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_TUNE_LPM_HV18: 6;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_LQ: 5;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDCORE: 8;
    };
} AON_LOP_POF_OFF_PPU_VPON_PCSM_3_TYPE;

/*0x4000_0a40 AON_LOP_POF_OFF_PPU_VPON_PCSM_3*/
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_RESERVED_Pos                                                                     0U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_RESERVED_Msk                                                                     (0x3UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_3_RESERVED_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_PA_POS_RSTB_Pos                                    2U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_PA_POS_RSTB_Msk                                    (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_PA_POS_RSTB_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_ANA_POS_RSTB_Pos                                   3U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_ANA_POS_RSTB_Msk                                   (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_ANA_POS_RSTB_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_BIAS_LDOPA_Pos                                 4U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_BIAS_LDOPA_Msk                                 (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_BIAS_LDOPA_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_BIAS_LDOANA_Pos                                5U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_BIAS_LDOANA_Msk                                (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_BIAS_LDOANA_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_EN_POS_Pos                        6U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_EN_POS_Msk                        (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_EN_POS_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_EN_POS_Pos                         7U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_EN_POS_Msk                         (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_EN_POS_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDCORE_LQ_Pos                                8U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDCORE_LQ_Msk                                (0x1FUL << AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDCORE_LQ_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_LPM_HV18_Pos                                      13U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_LPM_HV18_Msk                                      (0x3FUL << AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_LPM_HV18_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_LQ_Pos                                   19U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_LQ_Msk                                   (0x1FUL << AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_LQ_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDCORE_Pos                                       24U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDCORE_Msk                                       (0xFFUL << AON_LOP_POF_OFF_PPU_VPON_PCSM_3_LOP_POF_OFF_PPU_VPON_PCSM_TUNE_VDDCORE_Pos)

/* 0xA44    0x4000_0a44
    0       R/W     LOP_POF_OFF_PPU_VPON_PCSM_ENB_AUTO_PS                       1'b1
    1       R/W     LOP_POF_OFF_PPU_VPON_PCSM_SEL_SYNC2                         1'b1
    2       R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_SYNC2                          1'b0
    3       R/W     LOP_POF_OFF_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B                   1'b1
    8:4     R/W     LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2                5'b11000
    9       R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_VO3CMPHQ2                      1'b0
    10      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_VO3HQ2BETA                     1'b1
    11      R/W     LOP_POF_OFF_PPU_VPON_PCSM_PAD_AUTO_SW_PD_EN_RET             1'b1
    12      R/W     LOP_POF_OFF_PPU_VPON_PCSM_EN_FAST_TRNAS                     1'b1
    13      R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_PA_POS_EN_POS                 1'b0
    14      R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS                1'b0
    20:15   R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_TUNE_LDOPA                    6'b010000
    25:21   R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_TUNE_LDOANA                   5'b01111
    26      R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_ENPC_LDOPA                    1'b0
    27      R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_ENPC_LDOANA                   1'b0
    28      R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_LDOPA                     1'b0
    29      R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_LDOANA                    1'b0
    30      R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOPA           1'b1
    31      R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOANA          1'b1
 */
typedef union _AON_LOP_POF_OFF_PPU_VPON_PCSM_4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_ENB_AUTO_PS: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SEL_SYNC2: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_SYNC2: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2: 5;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_VO3CMPHQ2: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_VO3HQ2BETA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_PAD_AUTO_SW_PD_EN_RET: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_EN_FAST_TRNAS: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_PA_POS_EN_POS: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_TUNE_LDOPA: 6;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_TUNE_LDOANA: 5;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_ENPC_LDOPA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_ENPC_LDOANA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_LDOPA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_POW_LDOANA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOPA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOANA: 1;
    };
} AON_LOP_POF_OFF_PPU_VPON_PCSM_4_TYPE;

/*0x4000_0a44 AON_LOP_POF_OFF_PPU_VPON_PCSM_4*/
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_4_LOP_POF_OFF_PPU_VPON_PCSM_ENB_AUTO_PS_Pos                                        0U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_4_LOP_POF_OFF_PPU_VPON_PCSM_ENB_AUTO_PS_Msk                                        (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_4_LOP_POF_OFF_PPU_VPON_PCSM_ENB_AUTO_PS_Pos)

#define AON_LOP_POF_OFF_PPU_VPON_PCSM_4_LOP_POF_OFF_PPU_VPON_PCSM_SEL_SYNC2_Pos                                          1U
#define AON_LOP_POF_OFF_PPU_VPON_PCSM_4_LOP_POF_OFF_PPU_VPON_PCSM_SEL_SYNC2_Msk                                          (0x1UL << AON_LOP_POF_OFF_PPU_VPON_PCSM_4_LOP_POF_OFF_PPU_VPON_PCSM_SEL_SYNC2_Pos)

