rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_EN_POS_Pos                6U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_EN_POS_Msk                (0x1UL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_EN_POS_Pos)

#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_EN_POS_Pos                 7U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_EN_POS_Msk                 (0x1UL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_EN_POS_Pos)

#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDCORE_LQ_Pos                        8U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDCORE_LQ_Msk                        (0x1FUL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDCORE_LQ_Pos)

#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_TUNE_LPM_HV18_Pos                              13U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_TUNE_LPM_HV18_Msk                              (0x3FUL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_TUNE_LPM_HV18_Pos)

#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_LQ_Pos                           19U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_LQ_Msk                           (0x1FUL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_HV25_LQ_Pos)

#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_TUNE_VDDCORE_Pos                               24U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_TUNE_VDDCORE_Msk                               (0xFFUL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_3_LOP_POF_MEM_OFF_PPU_VPON_PCSM_TUNE_VDDCORE_Pos)

/* 0xA54    0x4000_0a54
    0       R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_ENB_AUTO_PS                   1'b1
    1       R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_SYNC2                     1'b1
    2       R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_SYNC2                      1'b0
    3       R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B               1'b1
    8:4     R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2            5'b11000
    9       R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_VO3CMPHQ2                  1'b0
    10      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_VO3HQ2BETA                 1'b1
    11      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_PAD_AUTO_SW_PD_EN_RET         1'b1
    12      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_FAST_TRNAS                 1'b1
    13      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_PA_POS_EN_POS             1'b0
    14      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS            1'b0
    20:15   R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_TUNE_LDOPA                6'b010000
    25:21   R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_TUNE_LDOANA               5'b01111
    26      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_ENPC_LDOPA                1'b0
    27      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_ENPC_LDOANA               1'b0
    28      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_POW_LDOPA                 1'b0
    29      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_POW_LDOANA                1'b0
    30      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOPA       1'b1
    31      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOANA      1'b1
 */
typedef union _AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_ENB_AUTO_PS: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_SYNC2: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_SYNC2: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2: 5;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_VO3CMPHQ2: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_VO3HQ2BETA: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_PAD_AUTO_SW_PD_EN_RET: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_FAST_TRNAS: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_PA_POS_EN_POS: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_TUNE_LDOPA: 6;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_TUNE_LDOANA: 5;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_ENPC_LDOPA: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_ENPC_LDOANA: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_POW_LDOPA: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_POW_LDOANA: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOPA: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOANA: 1;
    };
} AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_TYPE;

/*0x4000_0a54 AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4*/
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_ENB_AUTO_PS_Pos                                0U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_ENB_AUTO_PS_Msk                                (0x1UL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_ENB_AUTO_PS_Pos)

#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_SYNC2_Pos                                  1U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_SYNC2_Msk                                  (0x1UL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_SYNC2_Pos)

#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_SYNC2_Pos                                   2U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_SYNC2_Msk                                   (0x1UL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_SYNC2_Pos)

#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B_Pos                            3U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B_Msk                            (0x1UL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B_Pos)

#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2_Pos                         4U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2_Msk                         (0x1FUL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2_Pos)

#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_VO3CMPHQ2_Pos                               9U
#define AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_VO3CMPHQ2_Msk                               (0x1UL << AON_LOP_POF_MEM_OFF_PPU_VPON_PCSM_4_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_VO3CMPHQ2_Pos)

