rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH_Pos                      2U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH_Msk                      (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_DISCHG_MCM_FLASH_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_BIAS_1UA_Pos                              3U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_BIAS_1UA_Msk                              (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_BIAS_1UA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_IO_RSTB33_EN_Pos                             4U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_IO_RSTB33_EN_Msk                             (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_IO_RSTB33_EN_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_IO_SHDN33_EN_Pos                             5U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_IO_SHDN33_EN_Msk                             (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_IO_SHDN33_EN_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_VDDPA_Pos                               6U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_VDDPA_Msk                               (0xFFUL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_VDDPA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_HV18_Pos                                14U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_HV18_Msk                                (0x3FUL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_HV18_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_HV25_HQ_Pos                         20U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_HV25_HQ_Msk                         (0x1FUL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_HV25_HQ_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_VDDCORE_Pos                        25U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_VDDCORE_Msk                        (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_VDDCORE_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_HV18_Pos                           26U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_HV18_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_HV18_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_HV25_Pos                           27U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_HV25_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_HV25_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_VDDCORE_Pos                        28U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_VDDCORE_Msk                        (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_VDDCORE_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_VDDPA_Pos                          29U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_VDDPA_Msk                          (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_VDDPA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_HV18_Pos                           30U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_HV18_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_HV18_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_HV25_Pos                           31U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_HV25_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_2_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_HV25_Pos)

/* 0xA60    0x4000_0a60
    1:0     R/W     RESERVED                                                    2'h0
    2       R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_PA_POS_RSTB              1'b0
    3       R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ANA_POS_RSTB             1'b1
    4       R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_POW_BIAS_LDOPA           1'b0
    5       R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_POW_BIAS_LDOANA          1'b1
    6       R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_EN_POS  1'b0
    7       R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_EN_POS   1'b0
    12:8    R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_VDDCORE_LQ          5'b01110
    18:13   R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_LPM_HV18                6'b100000
    23:19   R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_HV25_LQ             5'b01111
    31:24   R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_VDDCORE                 8'b01100010
 */
typedef union _AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 2;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_PA_POS_RSTB: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ANA_POS_RSTB: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_POW_BIAS_LDOPA: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_POW_BIAS_LDOANA: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_BUCK_BOOST_VDDPA_POS_EN_POS: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_BUCK_BOOST_HV18_POS_EN_POS: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_VDDCORE_LQ: 5;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_LPM_HV18: 6;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_HV25_LQ: 5;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_VDDCORE: 8;
    };
} AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3_TYPE;

/*0x4000_0a60 AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3*/
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3_RESERVED_Pos                                                                0U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3_RESERVED_Msk                                                                (0x3UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3_RESERVED_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_PA_POS_RSTB_Pos                          2U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_PA_POS_RSTB_Msk                          (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_PA_POS_RSTB_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ANA_POS_RSTB_Pos                         3U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ANA_POS_RSTB_Msk                         (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_3_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ANA_POS_RSTB_Pos)

