rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_SYNC2_Pos                                1U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_SYNC2_Msk                                (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_SYNC2_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_SYNC2_Pos                                 2U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_SYNC2_Msk                                 (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_SYNC2_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B_Pos                          3U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B_Msk                          (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VO3CMPHQ2_B_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2_Pos                       4U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2_Msk                       (0x1FUL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_VDDPA_HQ2_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_VO3CMPHQ2_Pos                             9U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_VO3CMPHQ2_Msk                             (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_VO3CMPHQ2_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_VO3HQ2BETA_Pos                            10U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_VO3HQ2BETA_Msk                            (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_VO3HQ2BETA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_PAD_AUTO_SW_PD_EN_RET_Pos                    11U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_PAD_AUTO_SW_PD_EN_RET_Msk                    (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_PAD_AUTO_SW_PD_EN_RET_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_FAST_TRNAS_Pos                            12U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_FAST_TRNAS_Msk                            (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_FAST_TRNAS_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_PA_POS_EN_POS_Pos                        13U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_PA_POS_EN_POS_Msk                        (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_PA_POS_EN_POS_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS_Pos                       14U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS_Msk                       (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ANA_POS_EN_POS_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_TUNE_LDOPA_Pos                           15U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_TUNE_LDOPA_Msk                           (0x3FUL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_TUNE_LDOPA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_TUNE_LDOANA_Pos                          21U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_TUNE_LDOANA_Msk                          (0x1FUL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_TUNE_LDOANA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENPC_LDOPA_Pos                           26U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENPC_LDOPA_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENPC_LDOPA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENPC_LDOANA_Pos                          27U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENPC_LDOANA_Msk                          (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENPC_LDOANA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_POW_LDOPA_Pos                            28U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_POW_LDOPA_Msk                            (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_POW_LDOPA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_POW_LDOANA_Pos                           29U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_POW_LDOANA_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_POW_LDOANA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOPA_Pos                  30U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOPA_Msk                  (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOPA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOANA_Pos                 31U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOANA_Msk                 (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_4_LOP_POF_FUNC_RET_PPU_VPON_PCSM_LDO_ENB_DMYL_200U_LDOANA_Pos)

