rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0xA68    0x4000_0a68
    2:0     R/W     RESERVED_1                                                  3'b000
    3       R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA             1'b1
    4       R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA             1'b0
    9:5     R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ           5'b10011
    17:10   R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_VDDANA                  8'b01111010
    18      R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA           1'b1
    19      R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA           1'b0
    20      R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA            1'b0
    21      R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDDANA_DET               1'b1
    22      R/W     LOP_POF_FUNC_RET_PPU_VPON_PCSM_ENCCM_OUT_VDDANA             1'b1
    23      R/W     RESERVED                                                    1'b0
    27:24   R/W     LOP_POF_OFF_PPU_VPON_PCSM_2_DELAY                           4'b0000
    31:28   R/W     LOP_POF_OFF_PPU_VPON_PCSM_INACTIVE_DELAY                    4'b0000
 */
typedef union _AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_1: 3;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ: 5;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_VDDANA: 8;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDDANA_DET: 1;
        uint32_t LOP_POF_FUNC_RET_PPU_VPON_PCSM_ENCCM_OUT_VDDANA: 1;
        uint32_t RESERVED: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_2_DELAY: 4;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_INACTIVE_DELAY: 4;
    };
} AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_TYPE;

/*0x4000_0a68 AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5*/
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_RESERVED_1_Pos                                                              0U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_RESERVED_1_Msk                                                              (0x7UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_RESERVED_1_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Pos                         3U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Msk                         (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Pos                         4U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Msk                         (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Pos                       5U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Msk                       (0x1FUL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_VDDANA_Pos                              10U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_VDDANA_Msk                              (0xFFUL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_TUNE_VDDANA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Pos                       18U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Msk                       (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Pos                       19U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Msk                       (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Pos                        20U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Msk                        (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDDANA_DET_Pos                           21U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDDANA_DET_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_POW_VDDANA_DET_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Pos                         22U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Msk                         (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_FUNC_RET_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_RESERVED_Pos                                                                23U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_RESERVED_Msk                                                                (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_RESERVED_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_OFF_PPU_VPON_PCSM_2_DELAY_Pos                                       24U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_OFF_PPU_VPON_PCSM_2_DELAY_Msk                                       (0xFUL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_OFF_PPU_VPON_PCSM_2_DELAY_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_OFF_PPU_VPON_PCSM_INACTIVE_DELAY_Pos                                28U
#define AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_OFF_PPU_VPON_PCSM_INACTIVE_DELAY_Msk                                (0xFUL << AON_LOP_POF_FUNC_RET_PPU_VPON_PCSM_5_LOP_POF_OFF_PPU_VPON_PCSM_INACTIVE_DELAY_Pos)

