rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0xA6C    0x4000_0a6c
    3:0     R/W     RESERVED                                                    4'h0
    7:4     R/W     LOP_POF_OFF_PPU_VPON_PCSM_SWR2_DELAY                        4'b0000
    11:8    R/W     LOP_POF_OFF_PPU_VPON_PCSM_SWR3_DELAY                        4'b0000
    15:12   R/W     LOP_POF_OFF_PPU_VPON_PCSM_SWR4_DELAY                        4'b0000
    19:16   R/W     LOP_POF_OFF_PPU_VPON_PCSM_SWR5_DELAY                        4'b0000
    23:20   R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO1_DELAY                        4'b0000
    27:24   R/W     LOP_POF_OFF_PPU_VPON_PCSM_LDO2_DELAY                        4'b0001
    31:28   R/W     LOP_POF_OFF_PPU_VPON_PCSM_1_DELAY                           4'b0001
 */
typedef union _AON_LOP_POF_PPU_VPON_PCSM_DELAY_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 4;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SWR2_DELAY: 4;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SWR3_DELAY: 4;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SWR4_DELAY: 4;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SWR5_DELAY: 4;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO1_DELAY: 4;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_LDO2_DELAY: 4;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_1_DELAY: 4;
    };
} AON_LOP_POF_PPU_VPON_PCSM_DELAY_TYPE;

/*0x4000_0a6c AON_LOP_POF_PPU_VPON_PCSM_DELAY*/
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_RESERVED_Pos                                                                     0U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_RESERVED_Msk                                                                     (0xFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_RESERVED_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR2_DELAY_Pos                                         4U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR2_DELAY_Msk                                         (0xFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR2_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR3_DELAY_Pos                                         8U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR3_DELAY_Msk                                         (0xFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR3_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR4_DELAY_Pos                                         12U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR4_DELAY_Msk                                         (0xFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR4_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR5_DELAY_Pos                                         16U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR5_DELAY_Msk                                         (0xFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_SWR5_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_LDO1_DELAY_Pos                                         20U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_LDO1_DELAY_Msk                                         (0xFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_LDO1_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_LDO2_DELAY_Pos                                         24U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_LDO2_DELAY_Msk                                         (0xFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_LDO2_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_1_DELAY_Pos                                            28U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_1_DELAY_Msk                                            (0xFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_LOP_POF_OFF_PPU_VPON_PCSM_1_DELAY_Pos)

/* 0xA70    0x4000_0a70
    17:0    R/W     RESERVED                                                    18'h0
    19:18   R/W     LOP_POF_PPU_VPON_PCSM_SHIP_7_DELAY                          2'b00
    21:20   R/W     LOP_POF_PPU_VPON_PCSM_SHIP_6_DELAY                          2'b00
    23:22   R/W     LOP_POF_PPU_VPON_PCSM_SHIP_5_DELAY                          2'b00
    25:24   R/W     LOP_POF_PPU_VPON_PCSM_SHIP_4_DELAY                          2'b00
    27:26   R/W     LOP_POF_PPU_VPON_PCSM_SHIP_3_DELAY                          2'b00
    29:28   R/W     LOP_POF_PPU_VPON_PCSM_SHIP_2_DELAY                          2'b00
    31:30   R/W     LOP_POF_PPU_VPON_PCSM_SHIP_1_DELAY                          2'b00
 */
typedef union _AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED: 18;
        uint32_t LOP_POF_PPU_VPON_PCSM_SHIP_7_DELAY: 2;
        uint32_t LOP_POF_PPU_VPON_PCSM_SHIP_6_DELAY: 2;
        uint32_t LOP_POF_PPU_VPON_PCSM_SHIP_5_DELAY: 2;
        uint32_t LOP_POF_PPU_VPON_PCSM_SHIP_4_DELAY: 2;
        uint32_t LOP_POF_PPU_VPON_PCSM_SHIP_3_DELAY: 2;
        uint32_t LOP_POF_PPU_VPON_PCSM_SHIP_2_DELAY: 2;
        uint32_t LOP_POF_PPU_VPON_PCSM_SHIP_1_DELAY: 2;
    };
} AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_TYPE;

/*0x4000_0a70 AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY*/
#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_RESERVED_Pos                                                                0U
#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_RESERVED_Msk                                                                (0x3FFFFUL << AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_RESERVED_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_7_DELAY_Pos                                      18U
#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_7_DELAY_Msk                                      (0x3UL << AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_7_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_6_DELAY_Pos                                      20U
#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_6_DELAY_Msk                                      (0x3UL << AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_6_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_5_DELAY_Pos                                      22U
#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_5_DELAY_Msk                                      (0x3UL << AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_5_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_4_DELAY_Pos                                      24U
#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_4_DELAY_Msk                                      (0x3UL << AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_4_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_3_DELAY_Pos                                      26U
#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_3_DELAY_Msk                                      (0x3UL << AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_3_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_2_DELAY_Pos                                      28U
#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_2_DELAY_Msk                                      (0x3UL << AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_2_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_1_DELAY_Pos                                      30U
#define AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_1_DELAY_Msk                                      (0x3UL << AON_LOP_POF_PPU_VPON_PCSM_SHIP_DELAY_LOP_POF_PPU_VPON_PCSM_SHIP_1_DELAY_Pos)

/* 0xA74    0x4000_0a74
    0       R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA              1'b1
    1       R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA              1'b0
    6:2     R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ            5'b10011
    14:7    R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_TUNE_VDDANA                   8'b01111010
    15      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA            1'b1
    16      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA            1'b0
    17      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA             1'b0
    18      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDDANA_DET                1'b1
    19      R/W     LOP_POF_MEM_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDANA              1'b1
    23:20   R/W     LOP_POF_OFF_PPU_VPON_PCSM_SWR2_OFF2MEMOFF_DELAY             4'b0110
    27:24   R/W     LOP_POF_OFF_PPU_VPON_PCSM_SWR4_OFF2MEMOFF_DELAY             4'b0010
    31:28   R/W     LOP_POF_OFF_PPU_VPON_PCSM_1_OFF2MEMOFF_DELAY                4'b0000
 */
typedef union _AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ: 5;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_TUNE_VDDANA: 8;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDDANA_DET: 1;
        uint32_t LOP_POF_MEM_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDANA: 1;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SWR2_OFF2MEMOFF_DELAY: 4;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_SWR4_OFF2MEMOFF_DELAY: 4;
        uint32_t LOP_POF_OFF_PPU_VPON_PCSM_1_OFF2MEMOFF_DELAY: 4;
    };
} AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_TYPE;

/*0x4000_0a74 AON_LOP_POF_PPU_VPON_PCSM_DELAY_2*/
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Pos                             0U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Msk                             (0x1UL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_CMP_LQ_VDDANA_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Pos                             1U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Msk                             (0x1UL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_CMP_HQ_VDDANA_Pos)

