rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Pos                           2U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Msk                           (0x1FUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_SEL_VREF_VDDANA_LQ_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_TUNE_VDDANA_Pos                                  7U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_TUNE_VDDANA_Msk                                  (0xFFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_TUNE_VDDANA_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Pos                           15U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Msk                           (0x1UL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDIV_LQ_VDDANA_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Pos                           16U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Msk                           (0x1UL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDIV_HQ_VDDANA_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Pos                            17U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Msk                            (0x1UL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_EN_DMYLOAD_VDDANA_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDDANA_DET_Pos                               18U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDDANA_DET_Msk                               (0x1UL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_POW_VDDANA_DET_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Pos                             19U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Msk                             (0x1UL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_MEM_OFF_PPU_VPON_PCSM_ENCCM_OUT_VDDANA_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_OFF_PPU_VPON_PCSM_SWR2_OFF2MEMOFF_DELAY_Pos                            20U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_OFF_PPU_VPON_PCSM_SWR2_OFF2MEMOFF_DELAY_Msk                            (0xFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_OFF_PPU_VPON_PCSM_SWR2_OFF2MEMOFF_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_OFF_PPU_VPON_PCSM_SWR4_OFF2MEMOFF_DELAY_Pos                            24U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_OFF_PPU_VPON_PCSM_SWR4_OFF2MEMOFF_DELAY_Msk                            (0xFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_OFF_PPU_VPON_PCSM_SWR4_OFF2MEMOFF_DELAY_Pos)

#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_OFF_PPU_VPON_PCSM_1_OFF2MEMOFF_DELAY_Pos                               28U
#define AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_OFF_PPU_VPON_PCSM_1_OFF2MEMOFF_DELAY_Msk                               (0xFUL << AON_LOP_POF_PPU_VPON_PCSM_DELAY_2_LOP_POF_OFF_PPU_VPON_PCSM_1_OFF2MEMOFF_DELAY_Pos)

/* 0xA78    0x4000_0a78
    0       R/W     LOP_POF_FULL_RET_PPU_VCORE1_PCSM_R_PADMUX_ALL_PUPDSD_AS_EN  1'b1
    1       R/W     RESERVED_5                                                  1'b0
    5:2     R/W     RESERVED_4                                                  4'b0000
    9:6     R/W     RESERVED_3                                                  4'b0000
    13:10   R/W     RESERVED_2                                                  4'b0000
    17:14   R/W     RESERVED_1                                                  4'b0000
    21:18   R/W     RESERVED                                                    4'b0000
    25:22   R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_3_DELAY                         4'b0001
    26      R/W     LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_SW_LDO2PWRCUT                1'b0
    27      R/W     LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_LDO_VPULSE                   1'b0
    28      R/W     LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_IB_EN                        1'b0
    29      R/W     LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_SW_LDO2PWRCUT                1'b0
    30      R/W     LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_LDO_VPULSE                   1'b0
    31      R/W     LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_IB_EN                        1'b0
 */
typedef union _AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t LOP_POF_FULL_RET_PPU_VCORE1_PCSM_R_PADMUX_ALL_PUPDSD_AS_EN: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 4;
        uint32_t RESERVED_3: 4;
        uint32_t RESERVED_2: 4;
        uint32_t RESERVED_1: 4;
        uint32_t RESERVED: 4;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_3_DELAY: 4;
        uint32_t LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_SW_LDO2PWRCUT: 1;
        uint32_t LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_LDO_VPULSE: 1;
        uint32_t LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_IB_EN: 1;
        uint32_t LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_SW_LDO2PWRCUT: 1;
        uint32_t LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_LDO_VPULSE: 1;
        uint32_t LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_IB_EN: 1;
    };
} AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_TYPE;

/*0x4000_0a78 AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1*/
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_R_PADMUX_ALL_PUPDSD_AS_EN_Pos                0U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_R_PADMUX_ALL_PUPDSD_AS_EN_Msk                (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_R_PADMUX_ALL_PUPDSD_AS_EN_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_5_Pos                                                                1U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_5_Msk                                                                (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_5_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_4_Pos                                                                2U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_4_Msk                                                                (0xFUL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_4_Pos)

