rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_3_Pos                                                                6U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_3_Msk                                                                (0xFUL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_3_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_2_Pos                                                                10U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_2_Msk                                                                (0xFUL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_2_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_1_Pos                                                                14U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_1_Msk                                                                (0xFUL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_1_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_Pos                                                                  18U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_Msk                                                                  (0xFUL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_RESERVED_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_3_DELAY_Pos                                       22U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_3_DELAY_Msk                                       (0xFUL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_3_DELAY_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_SW_LDO2PWRCUT_Pos                              26U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_SW_LDO2PWRCUT_Msk                              (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_SW_LDO2PWRCUT_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_LDO_VPULSE_Pos                                 27U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_LDO_VPULSE_Msk                                 (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_LDO_VPULSE_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_IB_EN_Pos                                      28U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_IB_EN_Msk                                      (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_DIG_IB_EN_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_SW_LDO2PWRCUT_Pos                              29U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_SW_LDO2PWRCUT_Msk                              (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_SW_LDO2PWRCUT_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_LDO_VPULSE_Pos                                 30U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_LDO_VPULSE_Msk                                 (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_LDO_VPULSE_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_IB_EN_Pos                                      31U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_IB_EN_Msk                                      (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_1_LOP_POF_PLL1_PCSM_PLL1_LDO_ANA_IB_EN_Pos)

/* 0xA7C    0x4000_0a7c
    2:0     R/W     RESERVED_2                                                  3'b000
    6:3     R/W     RESERVED_1                                                  4'b0000
    9:7     R/W     RESERVED                                                    3'b000
    10      R/W     LOP_POF_VCORE_OP1_PADRV_PCUT_CTRL_SEL                       1'b1
    14:11   R/W     LOP_POF_VCORE_OP1_4_PCSM_DELAY                              4'b0101
    18:15   R/W     LOP_POF_VCORE_OP1_3_PCSM_DELAY                              4'b0001
    22:19   R/W     LOP_POF_VCORE_OP1_2_PCSM_DELAY                              4'b0001
    26:23   R/W     LOP_POF_VCORE_OP1_INACTIVE_PCSM_DELAY                       4'b0001
    27      R/W     LOP_POF_VCORE_OP1_PCSM_SPIC_PDEX_CMD                        1'b1
    28      R/W     LOP_POF_VCORE_OP1_PCSM_SPIC_PDEX_REQ                        1'b0
    29      R/W     LOP_POF_VCORE_OP1_PCSM_SEL_EFLASH_HV18                      1'b0
    30      R/W     LOP_POF_VCORE_OP1_PCSM_SEL_EFLASH_HV25                      1'b0
    31      R/W     LOP_POF_FULL_RET_PPU_VCORE1_PCSM_REG_ENLPM                  1'b1
 */
typedef union _AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_2: 3;
        uint32_t RESERVED_1: 4;
        uint32_t RESERVED: 3;
        uint32_t LOP_POF_VCORE_OP1_PADRV_PCUT_CTRL_SEL: 1;
        uint32_t LOP_POF_VCORE_OP1_4_PCSM_DELAY: 4;
        uint32_t LOP_POF_VCORE_OP1_3_PCSM_DELAY: 4;
        uint32_t LOP_POF_VCORE_OP1_2_PCSM_DELAY: 4;
        uint32_t LOP_POF_VCORE_OP1_INACTIVE_PCSM_DELAY: 4;
        uint32_t LOP_POF_VCORE_OP1_PCSM_SPIC_PDEX_CMD: 1;
        uint32_t LOP_POF_VCORE_OP1_PCSM_SPIC_PDEX_REQ: 1;
        uint32_t LOP_POF_VCORE_OP1_PCSM_SEL_EFLASH_HV18: 1;
        uint32_t LOP_POF_VCORE_OP1_PCSM_SEL_EFLASH_HV25: 1;
        uint32_t LOP_POF_FULL_RET_PPU_VCORE1_PCSM_REG_ENLPM: 1;
    };
} AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_TYPE;

/*0x4000_0a7c AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2*/
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_RESERVED_2_Pos                                                                0U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_RESERVED_2_Msk                                                                (0x7UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_RESERVED_2_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_RESERVED_1_Pos                                                                3U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_RESERVED_1_Msk                                                                (0xFUL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_RESERVED_1_Pos)

