rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_RESERVED_Pos                                                                  7U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_RESERVED_Msk                                                                  (0x7UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_RESERVED_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PADRV_PCUT_CTRL_SEL_Pos                                     10U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PADRV_PCUT_CTRL_SEL_Msk                                     (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PADRV_PCUT_CTRL_SEL_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_4_PCSM_DELAY_Pos                                            11U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_4_PCSM_DELAY_Msk                                            (0xFUL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_4_PCSM_DELAY_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_3_PCSM_DELAY_Pos                                            15U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_3_PCSM_DELAY_Msk                                            (0xFUL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_3_PCSM_DELAY_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_2_PCSM_DELAY_Pos                                            19U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_2_PCSM_DELAY_Msk                                            (0xFUL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_2_PCSM_DELAY_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_INACTIVE_PCSM_DELAY_Pos                                     23U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_INACTIVE_PCSM_DELAY_Msk                                     (0xFUL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_INACTIVE_PCSM_DELAY_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SPIC_PDEX_CMD_Pos                                      27U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SPIC_PDEX_CMD_Msk                                      (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SPIC_PDEX_CMD_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SPIC_PDEX_REQ_Pos                                      28U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SPIC_PDEX_REQ_Msk                                      (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SPIC_PDEX_REQ_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SEL_EFLASH_HV18_Pos                                    29U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SEL_EFLASH_HV18_Msk                                    (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SEL_EFLASH_HV18_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SEL_EFLASH_HV25_Pos                                    30U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SEL_EFLASH_HV25_Msk                                    (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_VCORE_OP1_PCSM_SEL_EFLASH_HV25_Pos)

#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_REG_ENLPM_Pos                                31U
#define AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_REG_ENLPM_Msk                                (0x1UL << AON_LOP_POF_OTHER_PCSM_SWAP_PCSM_2_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_REG_ENLPM_Pos)

/* 0xB18    0x4000_0b18
    0       R/W     RESERVED_16                                                 1'b0
    4:1     R/W     RESERVED_15                                                 4'b0000
    12:5    R/W     RESERVED_14                                                 8'b00000000
    16:13   R/W     RESERVED_13                                                 4'b0000
    17      R/W     RESERVED_12                                                 1'b0
    18      R/W     RESERVED_11                                                 1'b0
    19      R/W     RESERVED_10                                                 1'b0
    20      R/W     RESERVED_9                                                  1'b0
    21      R/W     RESERVED_8                                                  1'b0
    22      R/W     RESERVED_7                                                  1'b0
    23      R/W     RESERVED_6                                                  1'b0
    24      R/W     RESERVED_5                                                  1'b0
    25      R/W     RESERVED_4                                                  1'b0
    26      R/W     RESERVED_3                                                  1'b0
    27      R/W     RESERVED_2                                                  1'b0
    30:28   R/W     RESERVED_1                                                  3'b000
    31      R/W     RESERVED                                                    1'b0
 */
typedef union _AON_LOP_PON_VPON_40MXTAL_PCSM_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_16: 1;
        uint32_t RESERVED_15: 4;
        uint32_t RESERVED_14: 8;
        uint32_t RESERVED_13: 4;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 3;
        uint32_t RESERVED: 1;
    };
} AON_LOP_PON_VPON_40MXTAL_PCSM_TYPE;

/*0x4000_0b18 AON_LOP_PON_VPON_40MXTAL_PCSM*/
#define AON_LOP_PON_VPON_40MXTAL_PCSM_RESERVED_16_Pos                                                                    0U
#define AON_LOP_PON_VPON_40MXTAL_PCSM_RESERVED_16_Msk                                                                    (0x1UL << AON_LOP_PON_VPON_40MXTAL_PCSM_RESERVED_16_Pos)

#define AON_LOP_PON_VPON_40MXTAL_PCSM_RESERVED_15_Pos                                                                    1U
#define AON_LOP_PON_VPON_40MXTAL_PCSM_RESERVED_15_Msk                                                                    (0xFUL << AON_LOP_PON_VPON_40MXTAL_PCSM_RESERVED_15_Pos)

#define AON_LOP_PON_VPON_40MXTAL_PCSM_RESERVED_14_Pos                                                                    5U
#define AON_LOP_PON_VPON_40MXTAL_PCSM_RESERVED_14_Msk                                                                    (0xFFUL << AON_LOP_PON_VPON_40MXTAL_PCSM_RESERVED_14_Pos)

