rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_14_Pos                                                       14U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_14_Msk                                                       (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_14_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_13_Pos                                                       15U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_13_Msk                                                       (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_13_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_12_Pos                                                       16U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_12_Msk                                                       (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_12_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_11_Pos                                                       17U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_11_Msk                                                       (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_11_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_10_Pos                                                       18U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_10_Msk                                                       (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_10_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_9_Pos                                                        19U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_9_Msk                                                        (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_9_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_8_Pos                                                        20U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_8_Msk                                                        (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_8_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_7_Pos                                                        21U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_7_Msk                                                        (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_7_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_6_Pos                                                        22U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_6_Msk                                                        (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_6_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_5_Pos                                                        23U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_5_Msk                                                        (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_5_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_4_Pos                                                        24U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_4_Msk                                                        (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_4_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_3_Pos                                                        25U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_3_Msk                                                        (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_3_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_2_Pos                                                        26U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_2_Msk                                                        (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_2_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_1_Pos                                                        27U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_1_Msk                                                        (0xFUL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_1_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_Pos                                                          31U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_Msk                                                          (0x1UL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_Pos)

/* 0xB10    0x4000_0b10
    15:0    R/W     RESERVED_4                                                  16'h0
    19:16   R/W     RESERVED_3                                                  4'b0001
    23:20   R/W     RESERVED_2                                                  4'b0110
    27:24   R/W     RESERVED_1                                                  4'b0000
    31:28   R/W     RESERVED                                                    4'b0000
 */
typedef union _AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_4: 16;
        uint32_t RESERVED_3: 4;
        uint32_t RESERVED_2: 4;
        uint32_t RESERVED_1: 4;
        uint32_t RESERVED: 4;
    };
} AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_2_TYPE;

/*0x4000_0b10 AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_2*/
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_2_RESERVED_4_Pos                                                        0U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_2_RESERVED_4_Msk                                                        (0xFFFFUL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_2_RESERVED_4_Pos)

#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_2_RESERVED_3_Pos                                                        16U
#define AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_2_RESERVED_3_Msk                                                        (0xFUL << AON_LOP_PON_VPON_OSC80_OSC80CG_PLL1_PCSM_2_RESERVED_3_Pos)

