rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_AUDIO_Pos                                              22U
#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_AUDIO_Msk                                              (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_AUDIO_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_BTPHY_Pos                                              23U
#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_BTPHY_Msk                                              (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_BTPHY_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_CCMP_Pos                                               24U
#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_CCMP_Msk                                               (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_CCMP_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_SNPS_Pos                                               25U
#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_SNPS_Msk                                               (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_SNPS_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_ROM_0_Pos                                              26U
#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_ROM_0_Msk                                              (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_PGEN_ROM_0_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_1_RESERVED_2_Pos                                                                      27U
#define AON_LOP_PON_PPUVCORE1_PCSM_1_RESERVED_2_Msk                                                                      (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_1_RESERVED_2_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_1_RESERVED_1_Pos                                                                      28U
#define AON_LOP_PON_PPUVCORE1_PCSM_1_RESERVED_1_Msk                                                                      (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_1_RESERVED_1_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_1_RESERVED_Pos                                                                        29U
#define AON_LOP_PON_PPUVCORE1_PCSM_1_RESERVED_Msk                                                                        (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_1_RESERVED_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_VCORE_PC_VG2_Pos                                            30U
#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_VCORE_PC_VG2_Msk                                            (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_VCORE_PC_VG2_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_VCORE_PC_VG1_Pos                                            31U
#define AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_VCORE_PC_VG1_Msk                                            (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_1_LOP_PON_PPU_VCORE1_PCSM_VCORE_PC_VG1_Pos)

/* 0xB08    0x4000_0b08
    2:0     R/W     RESERVED_29                                                 3'h0
    3       R/W     RESERVED_28                                                 1'b0
    4       R/W     RESERVED_27                                                 1'b0
    5       R/W     RESERVED_26                                                 1'b0
    6       R/W     RESERVED_25                                                 1'b0
    7       R/W     RESERVED_24                                                 1'b0
    8       R/W     RESERVED_23                                                 1'b0
    9       R/W     RESERVED_22                                                 1'b0
    10      R/W     RESERVED_21                                                 1'b0
    11      R/W     RESERVED_20                                                 1'b0
    12      R/W     RESERVED_19                                                 1'b0
    13      R/W     RESERVED_18                                                 1'b0
    14      R/W     RESERVED_17                                                 1'b0
    15      R/W     RESERVED_16                                                 1'b0
    16      R/W     RESERVED_15                                                 1'b0
    17      R/W     RESERVED_14                                                 1'b0
    18      R/W     RESERVED_13                                                 1'b0
    19      R/W     RESERVED_12                                                 1'b0
    20      R/W     RESERVED_11                                                 1'b0
    21      R/W     RESERVED_10                                                 1'b0
    22      R/W     RESERVED_9                                                  1'b0
    23      R/W     RESERVED_8                                                  1'b0
    24      R/W     RESERVED_7                                                  1'b0
    25      R/W     RESERVED_6                                                  1'b0
    26      R/W     RESERVED_5                                                  1'b0
    27      R/W     RESERVED_4                                                  1'b0
    28      R/W     RESERVED_3                                                  1'b0
    29      R/W     RESERVED_2                                                  1'b0
    30      R/W     RESERVED_1                                                  1'b0
    31      R/W     RESERVED                                                    1'b1
 */
typedef union _AON_LOP_PON_PPUVCORE1_PCSM_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_29: 3;
        uint32_t RESERVED_28: 1;
        uint32_t RESERVED_27: 1;
        uint32_t RESERVED_26: 1;
        uint32_t RESERVED_25: 1;
        uint32_t RESERVED_24: 1;
        uint32_t RESERVED_23: 1;
        uint32_t RESERVED_22: 1;
        uint32_t RESERVED_21: 1;
        uint32_t RESERVED_20: 1;
        uint32_t RESERVED_19: 1;
        uint32_t RESERVED_18: 1;
        uint32_t RESERVED_17: 1;
        uint32_t RESERVED_16: 1;
        uint32_t RESERVED_15: 1;
        uint32_t RESERVED_14: 1;
        uint32_t RESERVED_13: 1;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
    };
} AON_LOP_PON_PPUVCORE1_PCSM_2_TYPE;

/*0x4000_0b08 AON_LOP_PON_PPUVCORE1_PCSM_2*/
#define AON_LOP_PON_PPUVCORE1_PCSM_2_RESERVED_29_Pos                                                                     0U
#define AON_LOP_PON_PPUVCORE1_PCSM_2_RESERVED_29_Msk                                                                     (0x7UL << AON_LOP_PON_PPUVCORE1_PCSM_2_RESERVED_29_Pos)

