rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_3_Pos                                                                      28U
#define AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_3_Msk                                                                      (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_3_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_2_Pos                                                                      29U
#define AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_2_Msk                                                                      (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_2_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_1_Pos                                                                      30U
#define AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_1_Msk                                                                      (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_1_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_Pos                                                                        31U
#define AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_Msk                                                                        (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_3_RESERVED_Pos)

/* 0xB00    0x4000_0b00
    26:0    R/W     RESERVED_4                                                  27'h0
    27      R/W     LOP_PON_PPU_VCORE1_PCSM_SRAM_SETTING_SEL                    1'b0
    28      R/W     RESERVED_3                                                  1'b0
    29      R/W     RESERVED_2                                                  1'b0
    30      R/W     RESERVED_1                                                  1'b0
    31      R/W     RESERVED                                                    1'b0
 */
typedef union _AON_LOP_PON_PPUVCORE1_PCSM_4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_4: 27;
        uint32_t LOP_PON_PPU_VCORE1_PCSM_SRAM_SETTING_SEL: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
    };
} AON_LOP_PON_PPUVCORE1_PCSM_4_TYPE;

/*0x4000_0b00 AON_LOP_PON_PPUVCORE1_PCSM_4*/
#define AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_4_Pos                                                                      0U
#define AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_4_Msk                                                                      (0x7FFFFFFUL << AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_4_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_4_LOP_PON_PPU_VCORE1_PCSM_SRAM_SETTING_SEL_Pos                                        27U
#define AON_LOP_PON_PPUVCORE1_PCSM_4_LOP_PON_PPU_VCORE1_PCSM_SRAM_SETTING_SEL_Msk                                        (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_4_LOP_PON_PPU_VCORE1_PCSM_SRAM_SETTING_SEL_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_3_Pos                                                                      28U
#define AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_3_Msk                                                                      (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_3_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_2_Pos                                                                      29U
#define AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_2_Msk                                                                      (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_2_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_1_Pos                                                                      30U
#define AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_1_Msk                                                                      (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_1_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_Pos                                                                        31U
#define AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_Msk                                                                        (0x1UL << AON_LOP_PON_PPUVCORE1_PCSM_4_RESERVED_Pos)

/* 0xAFC    0x4000_0afc
    3:0     R/W     RESERVED_7                                                  4'b0000
    7:4     R/W     RESERVED_6                                                  4'b0001
    11:8    R/W     RESERVED_5                                                  4'b0001
    15:12   R/W     RESERVED_4                                                  4'b0000
    19:16   R/W     RESERVED_3                                                  4'b0001
    23:20   R/W     RESERVED_2                                                  4'b0000
    27:24   R/W     RESERVED_1                                                  4'b0000
    31:28   R/W     RESERVED                                                    4'b0000
 */
typedef union _AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_7: 4;
        uint32_t RESERVED_6: 4;
        uint32_t RESERVED_5: 4;
        uint32_t RESERVED_4: 4;
        uint32_t RESERVED_3: 4;
        uint32_t RESERVED_2: 4;
        uint32_t RESERVED_1: 4;
        uint32_t RESERVED: 4;
    };
} AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_TYPE;

/*0x4000_0afc AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1*/
#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_7_Pos                                                                0U
#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_7_Msk                                                                (0xFUL << AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_7_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_6_Pos                                                                4U
#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_6_Msk                                                                (0xFUL << AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_6_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_5_Pos                                                                8U
#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_5_Msk                                                                (0xFUL << AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_5_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_4_Pos                                                                12U
#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_4_Msk                                                                (0xFUL << AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_4_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_3_Pos                                                                16U
#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_3_Msk                                                                (0xFUL << AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_3_Pos)

