rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_2_Pos                                                                20U
#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_2_Msk                                                                (0xFUL << AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_2_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_1_Pos                                                                24U
#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_1_Msk                                                                (0xFUL << AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_1_Pos)

#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_Pos                                                                  28U
#define AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_Msk                                                                  (0xFUL << AON_LOP_PON_PPUVCORE1_PCSM_DELAY_1_RESERVED_Pos)

/* 0xC08    0x4000_0c08
    4:0     R/W     RESERVED_16                                                 5'h0
    8:5     R/W     RESERVED_15                                                 4'b0000
    12:9    R/W     RESERVED_14                                                 4'b0000
    16:13   R/W     RESERVED_13                                                 4'b0000
    17      R/W     RESERVED_12                                                 1'b0
    18      R/W     RESERVED_11                                                 1'b0
    19      R/W     RESERVED_10                                                 1'b0
    20      R/W     RESERVED_9                                                  1'b0
    21      R/W     RESERVED_8                                                  1'b0
    22      R/W     RESERVED_7                                                  1'b0
    23      R/W     RESERVED_6                                                  1'b0
    24      R/W     RESERVED_5                                                  1'b0
    25      R/W     RESERVED_4                                                  1'b0
    26      R/W     RESERVED_3                                                  1'b0
    27      R/W     RESERVED_2                                                  1'b0
    30:28   R/W     RESERVED_1                                                  3'b000
    31      R/W     RESERVED                                                    1'b1
 */
typedef union _AON_LOP_POF_VPON_40MXTAL_PCSM_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_16: 5;
        uint32_t RESERVED_15: 4;
        uint32_t RESERVED_14: 4;
        uint32_t RESERVED_13: 4;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 3;
        uint32_t RESERVED: 1;
    };
} AON_LOP_POF_VPON_40MXTAL_PCSM_TYPE;

/*0x4000_0c08 AON_LOP_POF_VPON_40MXTAL_PCSM*/
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_16_Pos                                                                    0U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_16_Msk                                                                    (0x1FUL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_16_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_15_Pos                                                                    5U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_15_Msk                                                                    (0xFUL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_15_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_14_Pos                                                                    9U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_14_Msk                                                                    (0xFUL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_14_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_13_Pos                                                                    13U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_13_Msk                                                                    (0xFUL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_13_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_12_Pos                                                                    17U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_12_Msk                                                                    (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_12_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_11_Pos                                                                    18U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_11_Msk                                                                    (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_11_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_10_Pos                                                                    19U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_10_Msk                                                                    (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_10_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_9_Pos                                                                     20U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_9_Msk                                                                     (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_9_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_8_Pos                                                                     21U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_8_Msk                                                                     (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_8_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_7_Pos                                                                     22U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_7_Msk                                                                     (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_7_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_6_Pos                                                                     23U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_6_Msk                                                                     (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_6_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_5_Pos                                                                     24U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_5_Msk                                                                     (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_5_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_4_Pos                                                                     25U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_4_Msk                                                                     (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_4_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_3_Pos                                                                     26U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_3_Msk                                                                     (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_3_Pos)

