rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_2_Pos                                                                     27U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_2_Msk                                                                     (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_2_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_1_Pos                                                                     28U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_1_Msk                                                                     (0x7UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_1_Pos)

#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_Pos                                                                       31U
#define AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_Msk                                                                       (0x1UL << AON_LOP_POF_VPON_40MXTAL_PCSM_RESERVED_Pos)

/* 0xC04    0x4000_0c04
    9:0     R/W     RESERVED_19                                                 10'h0
    10      R/W     RESERVED_18                                                 1'b1
    11      R/W     RESERVED_17                                                 1'b1
    12      R/W     RESERVED_16                                                 1'b1
    13      R/W     RESERVED_15                                                 1'b1
    14      R/W     RESERVED_14                                                 1'b1
    15      R/W     RESERVED_13                                                 1'b0
    16      R/W     RESERVED_12                                                 1'b0
    17      R/W     RESERVED_11                                                 1'b0
    18      R/W     RESERVED_10                                                 1'b0
    19      R/W     RESERVED_9                                                  1'b0
    20      R/W     RESERVED_8                                                  1'b0
    21      R/W     RESERVED_7                                                  1'b0
    22      R/W     RESERVED_6                                                  1'b0
    23      R/W     RESERVED_5                                                  1'b0
    24      R/W     RESERVED_4                                                  1'b0
    25      R/W     RESERVED_3                                                  1'b0
    26      R/W     RESERVED_2                                                  1'b0
    30:27   R/W     RESERVED_1                                                  4'b0000
    31      R/W     RESERVED                                                    1'b0
 */
typedef union _AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_19: 10;
        uint32_t RESERVED_18: 1;
        uint32_t RESERVED_17: 1;
        uint32_t RESERVED_16: 1;
        uint32_t RESERVED_15: 1;
        uint32_t RESERVED_14: 1;
        uint32_t RESERVED_13: 1;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 4;
        uint32_t RESERVED: 1;
    };
} AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_TYPE;

/*0x4000_0c04 AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1*/
#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_19_Pos                                                       0U
#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_19_Msk                                                       (0x3FFUL << AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_19_Pos)

#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_18_Pos                                                       10U
#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_18_Msk                                                       (0x1UL << AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_18_Pos)

#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_17_Pos                                                       11U
#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_17_Msk                                                       (0x1UL << AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_17_Pos)

#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_16_Pos                                                       12U
#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_16_Msk                                                       (0x1UL << AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_16_Pos)

#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_15_Pos                                                       13U
#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_15_Msk                                                       (0x1UL << AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_15_Pos)

#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_14_Pos                                                       14U
#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_14_Msk                                                       (0x1UL << AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_14_Pos)

#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_13_Pos                                                       15U
#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_13_Msk                                                       (0x1UL << AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_13_Pos)

#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_12_Pos                                                       16U
#define AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_12_Msk                                                       (0x1UL << AON_LOP_POF_VPON_OSC80_OSC80CG_PLL1_PCSM_1_RESERVED_12_Pos)

