rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0xBFC    0x4000_0bfc
    0       R/W     RESERVED_4                                                  1'b0
    1       R/W     RESERVED_3                                                  1'b0
    2       R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CPU                       1'b1
    3       R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_USB                       1'b1
    4       R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CAN                       1'b1
    5       R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_LEBIS                     1'b1
    6       R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_AUDIO                     1'b1
    7       R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_BTPHY                     1'b1
    8       R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CCMP                      1'b1
    9       R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_SNPS                      1'b1
    10      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_CPU                       1'b1
    11      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_USB                       1'b1
    12      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_CAN                       1'b1
    13      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_LEBIS                     1'b1
    14      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_AUDIO                     1'b1
    15      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_BTPHY                     1'b1
    16      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_CCMP                      1'b1
    17      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_SNPS                      1'b1
    18      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_CPU                        1'b1
    19      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_USB                        1'b1
    20      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_CAN                        1'b1
    21      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_LEBIS                      1'b1
    22      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_AUDIO                      1'b1
    23      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_BTPHY                      1'b1
    24      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_CCMP                       1'b1
    25      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_SNPS                       1'b1
    26      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_ROM_0                      1'b1
    27      R/W     RESERVED_2                                                  1'b0
    28      R/W     RESERVED_1                                                  1'b0
    29      R/W     RESERVED                                                    1'b1
    30      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_VCORE_PC_VG2                    1'b1
    31      R/W     LOP_POF_OFF_PPU_VCORE1_PCSM_VCORE_PC_VG1                    1'b1
 */
typedef union _AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CPU: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_USB: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CAN: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_LEBIS: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_AUDIO: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_BTPHY: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CCMP: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_SNPS: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_CPU: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_USB: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_CAN: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_LEBIS: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_AUDIO: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_BTPHY: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_CCMP: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_RET1N_SNPS: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_CPU: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_USB: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_CAN: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_LEBIS: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_AUDIO: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_BTPHY: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_CCMP: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_SNPS: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_PGEN_ROM_0: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_VCORE_PC_VG2: 1;
        uint32_t LOP_POF_OFF_PPU_VCORE1_PCSM_VCORE_PC_VG1: 1;
    };
} AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_TYPE;

/*0x4000_0bfc AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1*/
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_RESERVED_4_Pos                                                                 0U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_RESERVED_4_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_RESERVED_4_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_RESERVED_3_Pos                                                                 1U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_RESERVED_3_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_RESERVED_3_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CPU_Pos                                      2U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CPU_Msk                                      (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CPU_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_USB_Pos                                      3U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_USB_Msk                                      (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_USB_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CAN_Pos                                      4U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CAN_Msk                                      (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_CAN_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_LEBIS_Pos                                    5U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_LEBIS_Msk                                    (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_LEBIS_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_AUDIO_Pos                                    6U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_AUDIO_Msk                                    (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_AUDIO_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_BTPHY_Pos                                    7U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_BTPHY_Msk                                    (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_1_LOP_POF_OFF_PPU_VCORE1_PCSM_RET2N_BTPHY_Pos)

