rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_20_Pos                                                                11U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_20_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_20_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_19_Pos                                                                12U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_19_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_19_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_18_Pos                                                                13U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_18_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_18_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_17_Pos                                                                14U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_17_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_17_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_16_Pos                                                                15U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_16_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_16_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_15_Pos                                                                16U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_15_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_15_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_14_Pos                                                                17U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_14_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_14_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_13_Pos                                                                18U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_13_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_13_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_12_Pos                                                                19U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_12_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_12_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_11_Pos                                                                20U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_11_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_11_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_10_Pos                                                                21U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_10_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_10_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_9_Pos                                                                 22U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_9_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_9_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_8_Pos                                                                 23U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_8_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_8_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_7_Pos                                                                 24U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_7_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_7_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_6_Pos                                                                 25U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_6_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_6_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_5_Pos                                                                 26U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_5_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_5_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_4_Pos                                                                 27U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_4_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_4_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_3_Pos                                                                 28U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_3_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_3_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_2_Pos                                                                 29U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_2_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_2_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_1_Pos                                                                 30U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_1_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_1_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_Pos                                                                   31U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_Msk                                                                   (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_2_RESERVED_Pos)

/* 0xBF4    0x4000_0bf4
    0       R/W     RESERVED_31                                                 1'b0
    1       R/W     RESERVED_30                                                 1'b1
    2       R/W     RESERVED_29                                                 1'b0
    3       R/W     RESERVED_28                                                 1'b1
    4       R/W     RESERVED_27                                                 1'b0
    5       R/W     RESERVED_26                                                 1'b1
    6       R/W     RESERVED_25                                                 1'b0
    7       R/W     RESERVED_24                                                 1'b1
    8       R/W     RESERVED_23                                                 1'b0
    9       R/W     RESERVED_22                                                 1'b1
    10      R/W     RESERVED_21                                                 1'b0
    11      R/W     RESERVED_20                                                 1'b1
    12      R/W     RESERVED_19                                                 1'b0
    13      R/W     RESERVED_18                                                 1'b1
    14      R/W     RESERVED_17                                                 1'b0
    15      R/W     RESERVED_16                                                 1'b1
    16      R/W     RESERVED_15                                                 1'b0
    17      R/W     RESERVED_14                                                 1'b1
    18      R/W     RESERVED_13                                                 1'b0
    19      R/W     RESERVED_12                                                 1'b1
    20      R/W     RESERVED_11                                                 1'b0
    21      R/W     RESERVED_10                                                 1'b1
    22      R/W     RESERVED_9                                                  1'b0
    23      R/W     RESERVED_8                                                  1'b1
    24      R/W     RESERVED_7                                                  1'b0
    25      R/W     RESERVED_6                                                  1'b1
    26      R/W     RESERVED_5                                                  1'b0
    27      R/W     RESERVED_4                                                  1'b1
    28      R/W     RESERVED_3                                                  1'b0
    29      R/W     RESERVED_2                                                  1'b1
    30      R/W     RESERVED_1                                                  1'b0
    31      R/W     RESERVED                                                    1'b1
 */
typedef union _AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_31: 1;
        uint32_t RESERVED_30: 1;
        uint32_t RESERVED_29: 1;
        uint32_t RESERVED_28: 1;
        uint32_t RESERVED_27: 1;
        uint32_t RESERVED_26: 1;
        uint32_t RESERVED_25: 1;
        uint32_t RESERVED_24: 1;
        uint32_t RESERVED_23: 1;
        uint32_t RESERVED_22: 1;
        uint32_t RESERVED_21: 1;
        uint32_t RESERVED_20: 1;
        uint32_t RESERVED_19: 1;
        uint32_t RESERVED_18: 1;
        uint32_t RESERVED_17: 1;
        uint32_t RESERVED_16: 1;
        uint32_t RESERVED_15: 1;
        uint32_t RESERVED_14: 1;
        uint32_t RESERVED_13: 1;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
    };
} AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_TYPE;

/*0x4000_0bf4 AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3*/
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_31_Pos                                                                0U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_31_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_31_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_30_Pos                                                                1U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_30_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_30_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_29_Pos                                                                2U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_29_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_29_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_28_Pos                                                                3U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_28_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_28_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_27_Pos                                                                4U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_27_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_27_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_26_Pos                                                                5U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_26_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_26_Pos)

