rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_25_Pos                                                                6U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_25_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_25_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_24_Pos                                                                7U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_24_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_24_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_23_Pos                                                                8U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_23_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_23_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_22_Pos                                                                9U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_22_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_22_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_21_Pos                                                                10U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_21_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_21_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_20_Pos                                                                11U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_20_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_20_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_19_Pos                                                                12U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_19_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_19_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_18_Pos                                                                13U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_18_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_18_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_17_Pos                                                                14U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_17_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_17_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_16_Pos                                                                15U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_16_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_16_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_15_Pos                                                                16U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_15_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_15_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_14_Pos                                                                17U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_14_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_14_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_13_Pos                                                                18U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_13_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_13_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_12_Pos                                                                19U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_12_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_12_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_11_Pos                                                                20U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_11_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_11_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_10_Pos                                                                21U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_10_Msk                                                                (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_10_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_9_Pos                                                                 22U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_9_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_9_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_8_Pos                                                                 23U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_8_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_8_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_7_Pos                                                                 24U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_7_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_7_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_6_Pos                                                                 25U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_6_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_6_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_5_Pos                                                                 26U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_5_Msk                                                                 (0x1UL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_3_RESERVED_5_Pos)

