rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_10_Pos                                                           21U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_10_Msk                                                           (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_10_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_9_Pos                                                            22U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_9_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_9_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_8_Pos                                                            23U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_8_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_8_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_7_Pos                                                            24U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_7_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_7_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_6_Pos                                                            25U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_6_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_6_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_5_Pos                                                            26U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_5_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_5_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_4_Pos                                                            27U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_4_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_4_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_3_Pos                                                            28U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_3_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_3_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_2_Pos                                                            29U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_2_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_2_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_1_Pos                                                            30U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_1_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_1_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_Pos                                                              31U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_Msk                                                              (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_3_RESERVED_Pos)

/* 0xBE0    0x4000_0be0
    25:0    R/W     RESERVED_4                                                  26'h0
    26      R/W     RESERVED_3                                                  1'b1
    27      R/W     RESERVED_2                                                  1'b1
    28      R/W     RESERVED_1                                                  1'b1
    29      R/W     RESERVED                                                    1'b1
    30      R/W     LOP_POF_FULL_RET_PPU_VCORE1_PCSM_SRAM_SETTING_SEL           1'b1
    31      R/W     LOP_POF_FULL_RET_PPU_VCORE1_PCSM_PAD_AUTO_SW_EN_RET         1'b1
 */
typedef union _AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_4: 26;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
        uint32_t LOP_POF_FULL_RET_PPU_VCORE1_PCSM_SRAM_SETTING_SEL: 1;
        uint32_t LOP_POF_FULL_RET_PPU_VCORE1_PCSM_PAD_AUTO_SW_EN_RET: 1;
    };
} AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_TYPE;

/*0x4000_0be0 AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4*/
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_4_Pos                                                            0U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_4_Msk                                                            (0x3FFFFFFUL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_4_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_3_Pos                                                            26U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_3_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_3_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_2_Pos                                                            27U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_2_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_2_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_1_Pos                                                            28U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_1_Msk                                                            (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_1_Pos)

#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_Pos                                                              29U
#define AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_Msk                                                              (0x1UL << AON_LOP_POF_FULL_RET_PPU_VCORE1_PCSM_4_RESERVED_Pos)

