rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_LEBIS_Pos                          5U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_LEBIS_Msk                          (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_LEBIS_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_AUDIO_Pos                          6U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_AUDIO_Msk                          (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_AUDIO_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_BTPHY_Pos                          7U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_BTPHY_Msk                          (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_BTPHY_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_CCMP_Pos                           8U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_CCMP_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_CCMP_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_SNPS_Pos                           9U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_SNPS_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET2N_SNPS_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_CPU_Pos                            10U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_CPU_Msk                            (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_CPU_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_USB_Pos                            11U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_USB_Msk                            (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_USB_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_CAN_Pos                            12U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_CAN_Msk                            (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_CAN_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_LEBIS_Pos                          13U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_LEBIS_Msk                          (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_LEBIS_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_AUDIO_Pos                          14U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_AUDIO_Msk                          (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_AUDIO_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_BTPHY_Pos                          15U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_BTPHY_Msk                          (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_BTPHY_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_CCMP_Pos                           16U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_CCMP_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_CCMP_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_SNPS_Pos                           17U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_SNPS_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_RET1N_SNPS_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_CPU_Pos                             18U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_CPU_Msk                             (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_CPU_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_USB_Pos                             19U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_USB_Msk                             (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_USB_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_CAN_Pos                             20U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_CAN_Msk                             (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_CAN_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_LEBIS_Pos                           21U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_LEBIS_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_LEBIS_Pos)

#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_AUDIO_Pos                           22U
#define AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_AUDIO_Msk                           (0x1UL << AON_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_1_LOP_POF_FUNC_RET_PPU_VCORE1_PCSM_PGEN_AUDIO_Pos)

