rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_DELAY_1_RESERVED_1_Pos                                                           24U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_DELAY_1_RESERVED_1_Msk                                                           (0xFUL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_DELAY_1_RESERVED_1_Pos)

#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_DELAY_1_RESERVED_Pos                                                             28U
#define AON_LOP_POF_OFF_PPU_VCORE1_PCSM_DELAY_1_RESERVED_Msk                                                             (0xFUL << AON_LOP_POF_OFF_PPU_VCORE1_PCSM_DELAY_1_RESERVED_Pos)

/* 0xC2C    0x4000_0c2c
    3:0     R/W     RESERVED_16                                                 4'b0000
    7:4     R/W     RESERVED_15                                                 4'b0000
    11:8    R/W     RESERVED_14                                                 4'b0000
    15:12   R/W     RESERVED_13                                                 4'b0000
    19:16   R/W     RESERVED_12                                                 4'b0000
    20      R/W     RESERVED_11                                                 1'b1
    21      R/W     RESERVED_10                                                 1'b1
    22      R/W     RESERVED_9                                                  1'b0
    23      R/W     RESERVED_8                                                  1'b1
    24      R/W     RESERVED_7                                                  1'b1
    25      R/W     RESERVED_6                                                  1'b0
    26      R/W     RESERVED_5                                                  1'b0
    27      R/W     RESERVED_4                                                  1'b1
    28      R/W     RESERVED_3                                                  1'b0
    29      R/W     RESERVED_2                                                  1'b0
    30      R/W     RESERVED_1                                                  1'b0
    31      R/W     RESERVED                                                    1'b0
 */
typedef union _AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_16: 4;
        uint32_t RESERVED_15: 4;
        uint32_t RESERVED_14: 4;
        uint32_t RESERVED_13: 4;
        uint32_t RESERVED_12: 4;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 1;
    };
} AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_TYPE;

/*0x4000_0c2c AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1*/
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_16_Pos                                                               0U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_16_Msk                                                               (0xFUL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_16_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_15_Pos                                                               4U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_15_Msk                                                               (0xFUL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_15_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_14_Pos                                                               8U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_14_Msk                                                               (0xFUL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_14_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_13_Pos                                                               12U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_13_Msk                                                               (0xFUL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_13_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_12_Pos                                                               16U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_12_Msk                                                               (0xFUL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_12_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_11_Pos                                                               20U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_11_Msk                                                               (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_11_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_10_Pos                                                               21U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_10_Msk                                                               (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_10_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_9_Pos                                                                22U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_9_Msk                                                                (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_9_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_8_Pos                                                                23U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_8_Msk                                                                (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_8_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_7_Pos                                                                24U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_7_Msk                                                                (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_7_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_6_Pos                                                                25U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_6_Msk                                                                (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_6_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_5_Pos                                                                26U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_5_Msk                                                                (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_5_Pos)

