rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_4_Pos                                                                27U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_4_Msk                                                                (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_4_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_3_Pos                                                                28U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_3_Msk                                                                (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_3_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_2_Pos                                                                29U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_2_Msk                                                                (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_2_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_1_Pos                                                                30U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_1_Msk                                                                (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_1_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_Pos                                                                  31U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_Msk                                                                  (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_1_RESERVED_Pos)

/* 0xC28    0x4000_0c28
    10:0    R/W     RESERVED_18                                                 11'h0
    11      R/W     RESERVED_17                                                 1'b1
    12      R/W     RESERVED_16                                                 1'b1
    13      R/W     RESERVED_15                                                 1'b1
    14      R/W     RESERVED_14                                                 1'b1
    15      R/W     RESERVED_13                                                 1'b1
    16      R/W     RESERVED_12                                                 1'b1
    17      R/W     RESERVED_11                                                 1'b1
    18      R/W     RESERVED_10                                                 1'b0
    19      R/W     RESERVED_9                                                  1'b1
    20      R/W     RESERVED_8                                                  1'b1
    21      R/W     RESERVED_7                                                  1'b1
    22      R/W     RESERVED_6                                                  1'b0
    23      R/W     RESERVED_5                                                  1'b1
    24      R/W     RESERVED_4                                                  1'b1
    25      R/W     RESERVED_3                                                  1'b1
    26      R/W     RESERVED_2                                                  1'b1
    30:27   R/W     RESERVED_1                                                  4'b0001
    31      R/W     RESERVED                                                    1'b1
 */
typedef union _AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_18: 11;
        uint32_t RESERVED_17: 1;
        uint32_t RESERVED_16: 1;
        uint32_t RESERVED_15: 1;
        uint32_t RESERVED_14: 1;
        uint32_t RESERVED_13: 1;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 4;
        uint32_t RESERVED: 1;
    };
} AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_TYPE;

/*0x4000_0c28 AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2*/
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_18_Pos                                                               0U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_18_Msk                                                               (0x7FFUL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_18_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_17_Pos                                                               11U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_17_Msk                                                               (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_17_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_16_Pos                                                               12U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_16_Msk                                                               (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_16_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_15_Pos                                                               13U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_15_Msk                                                               (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_15_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_14_Pos                                                               14U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_14_Msk                                                               (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_14_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_13_Pos                                                               15U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_13_Msk                                                               (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_13_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_12_Pos                                                               16U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_12_Msk                                                               (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_12_Pos)

#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_11_Pos                                                               17U
#define AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_11_Msk                                                               (0x1UL << AON_LOP_PON_VPON_VCORE1_OP1_PCSM_2_RESERVED_11_Pos)

