rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_17_Pos                                                               11U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_17_Msk                                                               (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_17_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_16_Pos                                                               12U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_16_Msk                                                               (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_16_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_15_Pos                                                               13U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_15_Msk                                                               (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_15_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_14_Pos                                                               14U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_14_Msk                                                               (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_14_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_13_Pos                                                               15U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_13_Msk                                                               (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_13_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_12_Pos                                                               16U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_12_Msk                                                               (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_12_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_11_Pos                                                               17U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_11_Msk                                                               (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_11_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_10_Pos                                                               18U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_10_Msk                                                               (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_10_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_9_Pos                                                                19U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_9_Msk                                                                (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_9_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_8_Pos                                                                20U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_8_Msk                                                                (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_8_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_7_Pos                                                                21U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_7_Msk                                                                (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_7_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_6_Pos                                                                22U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_6_Msk                                                                (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_6_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_5_Pos                                                                23U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_5_Msk                                                                (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_5_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_4_Pos                                                                24U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_4_Msk                                                                (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_4_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_3_Pos                                                                25U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_3_Msk                                                                (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_3_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_2_Pos                                                                26U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_2_Msk                                                                (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_2_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_1_Pos                                                                27U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_1_Msk                                                                (0xFUL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_1_Pos)

#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_Pos                                                                  31U
#define AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_Msk                                                                  (0x1UL << AON_LOP_POF_VPON_VCORE1_OP1_PCSM_2_RESERVED_Pos)

/* 0xC60    0x4000_0c60
    0       R/W     SCH_PLN_RST                                                 1'b0
    31:1    R       SCH_PLN_RSTB_RESERVED31_1                                   1'b0
 */
typedef union _AON_REG_SCH_PLN_RSTB_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SCH_PLN_RST: 1;
        uint32_t SCH_PLN_RSTB_RESERVED31_1: 31;
    };
} AON_REG_SCH_PLN_RSTB_TYPE;

/*0x4000_0c60 AON_REG_SCH_PLN_RSTB*/
#define AON_REG_SCH_PLN_RSTB_SCH_PLN_RST_Pos                                                                             0U
#define AON_REG_SCH_PLN_RSTB_SCH_PLN_RST_Msk                                                                             (0x1UL << AON_REG_SCH_PLN_RSTB_SCH_PLN_RST_Pos)

#define AON_REG_SCH_PLN_RSTB_SCH_PLN_RSTB_RESERVED31_1_Pos                                                               1U
#define AON_REG_SCH_PLN_RSTB_SCH_PLN_RSTB_RESERVED31_1_Msk                                                               (0x7FFFFFFFUL << AON_REG_SCH_PLN_RSTB_SCH_PLN_RSTB_RESERVED31_1_Pos)

/* 0xC64    0x4000_0c64
    31:0    R/W     TREE0_ROOT_ACT_TIME                                         32'b0
 */
typedef union _AON_REG_SCH_PLN_TREE0_ROOT_ACT_TIME_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TREE0_ROOT_ACT_TIME;
    };
} AON_REG_SCH_PLN_TREE0_ROOT_ACT_TIME_TYPE;

/*0x4000_0c64 AON_REG_SCH_PLN_TREE0_ROOT_ACT_TIME*/
#define AON_REG_SCH_PLN_TREE0_ROOT_ACT_TIME_TREE0_ROOT_ACT_TIME_Pos                                                      0U
#define AON_REG_SCH_PLN_TREE0_ROOT_ACT_TIME_TREE0_ROOT_ACT_TIME_Msk                                                      (0xFFFFFFFFUL << AON_REG_SCH_PLN_TREE0_ROOT_ACT_TIME_TREE0_ROOT_ACT_TIME_Pos)

/* 0xC68    0x4000_0c68
    31:0    R/W     TREE1_ROOT_ACT_TIME                                         32'b0
 */
typedef union _AON_REG_SCH_PLN_TREE1_ROOT_ACT_TIME_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TREE1_ROOT_ACT_TIME;
    };
} AON_REG_SCH_PLN_TREE1_ROOT_ACT_TIME_TYPE;

