rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0c68 AON_REG_SCH_PLN_TREE1_ROOT_ACT_TIME*/
#define AON_REG_SCH_PLN_TREE1_ROOT_ACT_TIME_TREE1_ROOT_ACT_TIME_Pos                                                      0U
#define AON_REG_SCH_PLN_TREE1_ROOT_ACT_TIME_TREE1_ROOT_ACT_TIME_Msk                                                      (0xFFFFFFFFUL << AON_REG_SCH_PLN_TREE1_ROOT_ACT_TIME_TREE1_ROOT_ACT_TIME_Pos)

/* 0xC6C    0x4000_0c6c
    0       R/WAC   TREE0_ACT_CLR                                               1'b0
    1       R/WAC   TREE1_ACT_CLR                                               1'b0
    31:2    R       SCH_PLN_TREE_ACTIVE_CLEAR_RESERVED31_2                      30'b0
 */
typedef union _AON_REG_SCH_PLN_TREE_ACT_CLEAR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TREE0_ACT_CLR: 1;
        uint32_t TREE1_ACT_CLR: 1;
        uint32_t SCH_PLN_TREE_ACTIVE_CLEAR_RESERVED31_2: 30;
    };
} AON_REG_SCH_PLN_TREE_ACT_CLEAR_TYPE;

/*0x4000_0c6c AON_REG_SCH_PLN_TREE_ACT_CLEAR*/
#define AON_REG_SCH_PLN_TREE_ACT_CLEAR_TREE0_ACT_CLR_Pos                                                                 0U
#define AON_REG_SCH_PLN_TREE_ACT_CLEAR_TREE0_ACT_CLR_Msk                                                                 (0x1UL << AON_REG_SCH_PLN_TREE_ACT_CLEAR_TREE0_ACT_CLR_Pos)

#define AON_REG_SCH_PLN_TREE_ACT_CLEAR_TREE1_ACT_CLR_Pos                                                                 1U
#define AON_REG_SCH_PLN_TREE_ACT_CLEAR_TREE1_ACT_CLR_Msk                                                                 (0x1UL << AON_REG_SCH_PLN_TREE_ACT_CLEAR_TREE1_ACT_CLR_Pos)

#define AON_REG_SCH_PLN_TREE_ACT_CLEAR_SCH_PLN_TREE_ACTIVE_CLEAR_RESERVED31_2_Pos                                        2U
#define AON_REG_SCH_PLN_TREE_ACT_CLEAR_SCH_PLN_TREE_ACTIVE_CLEAR_RESERVED31_2_Msk                                        (0x3FFFFFFFUL << AON_REG_SCH_PLN_TREE_ACT_CLEAR_SCH_PLN_TREE_ACTIVE_CLEAR_RESERVED31_2_Pos)

/* 0xC70    0x4000_0c70
    0       R/W     TREE0_MANUAL_TRIGGER                                        1'b0
    1       R/W     TREE1_MANUAL_TRIGGER                                        1'b0
    31:2    R       SCH_PLN_MANUAL_INTR_RESERVED31_2                            30'b0
 */
typedef union _AON_REG_SCH_PLN_MANUAL_TRIGGER_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TREE0_MANUAL_TRIGGER: 1;
        uint32_t TREE1_MANUAL_TRIGGER: 1;
        uint32_t SCH_PLN_MANUAL_INTR_RESERVED31_2: 30;
    };
} AON_REG_SCH_PLN_MANUAL_TRIGGER_TYPE;

/*0x4000_0c70 AON_REG_SCH_PLN_MANUAL_TRIGGER*/
#define AON_REG_SCH_PLN_MANUAL_TRIGGER_TREE0_MANUAL_TRIGGER_Pos                                                          0U
#define AON_REG_SCH_PLN_MANUAL_TRIGGER_TREE0_MANUAL_TRIGGER_Msk                                                          (0x1UL << AON_REG_SCH_PLN_MANUAL_TRIGGER_TREE0_MANUAL_TRIGGER_Pos)

#define AON_REG_SCH_PLN_MANUAL_TRIGGER_TREE1_MANUAL_TRIGGER_Pos                                                          1U
#define AON_REG_SCH_PLN_MANUAL_TRIGGER_TREE1_MANUAL_TRIGGER_Msk                                                          (0x1UL << AON_REG_SCH_PLN_MANUAL_TRIGGER_TREE1_MANUAL_TRIGGER_Pos)

#define AON_REG_SCH_PLN_MANUAL_TRIGGER_SCH_PLN_MANUAL_INTR_RESERVED31_2_Pos                                              2U
#define AON_REG_SCH_PLN_MANUAL_TRIGGER_SCH_PLN_MANUAL_INTR_RESERVED31_2_Msk                                              (0x3FFFFFFFUL << AON_REG_SCH_PLN_MANUAL_TRIGGER_SCH_PLN_MANUAL_INTR_RESERVED31_2_Pos)

/* 0xC74    0x4000_0c74
    0       R/W     TREE0_INTR_EN                                               1'b0
    1       R/W     TREE1_INTR_EN                                               1'b0
    2       R/W     TREE0_INTR_TYPE                                             1'b0
    3       R/W     TREE1_INTR_TYPE                                             1'b0
    31:4    R       SCH_PLN_INTR_CTRL_RESERVED31_4                              28'b0
 */
typedef union _AON_REG_SCH_PLN_INTR_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TREE0_INTR_EN: 1;
        uint32_t TREE1_INTR_EN: 1;
        uint32_t TREE0_INTR_TYPE: 1;
        uint32_t TREE1_INTR_TYPE: 1;
        uint32_t SCH_PLN_INTR_CTRL_RESERVED31_4: 28;
    };
} AON_REG_SCH_PLN_INTR_CTRL_TYPE;

/*0x4000_0c74 AON_REG_SCH_PLN_INTR_CTRL*/
#define AON_REG_SCH_PLN_INTR_CTRL_TREE0_INTR_EN_Pos                                                                      0U
#define AON_REG_SCH_PLN_INTR_CTRL_TREE0_INTR_EN_Msk                                                                      (0x1UL << AON_REG_SCH_PLN_INTR_CTRL_TREE0_INTR_EN_Pos)

#define AON_REG_SCH_PLN_INTR_CTRL_TREE1_INTR_EN_Pos                                                                      1U
#define AON_REG_SCH_PLN_INTR_CTRL_TREE1_INTR_EN_Msk                                                                      (0x1UL << AON_REG_SCH_PLN_INTR_CTRL_TREE1_INTR_EN_Pos)

#define AON_REG_SCH_PLN_INTR_CTRL_TREE0_INTR_TYPE_Pos                                                                    2U
#define AON_REG_SCH_PLN_INTR_CTRL_TREE0_INTR_TYPE_Msk                                                                    (0x1UL << AON_REG_SCH_PLN_INTR_CTRL_TREE0_INTR_TYPE_Pos)

#define AON_REG_SCH_PLN_INTR_CTRL_TREE1_INTR_TYPE_Pos                                                                    3U
#define AON_REG_SCH_PLN_INTR_CTRL_TREE1_INTR_TYPE_Msk                                                                    (0x1UL << AON_REG_SCH_PLN_INTR_CTRL_TREE1_INTR_TYPE_Pos)

#define AON_REG_SCH_PLN_INTR_CTRL_SCH_PLN_INTR_CTRL_RESERVED31_4_Pos                                                     4U
#define AON_REG_SCH_PLN_INTR_CTRL_SCH_PLN_INTR_CTRL_RESERVED31_4_Msk                                                     (0xFFFFFFFUL << AON_REG_SCH_PLN_INTR_CTRL_SCH_PLN_INTR_CTRL_RESERVED31_4_Pos)

/* 0xC78    0x4000_0c78
    0       R       TREE0_SCH_INTR_STS                                          1'b0
    1       R       TREE1_SCH_INTR_STS                                          1'b0
    31:2    R       SCH_PLN_INTR_STS_RESERVED31_2                               30'b0
 */
typedef union _AON_REG_SCH_PLN_INTR_STATUS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TREE0_SCH_INTR_STS: 1;
        uint32_t TREE1_SCH_INTR_STS: 1;
        uint32_t SCH_PLN_INTR_STS_RESERVED31_2: 30;
    };
} AON_REG_SCH_PLN_INTR_STATUS_TYPE;

/*0x4000_0c78 AON_REG_SCH_PLN_INTR_STATUS*/
#define AON_REG_SCH_PLN_INTR_STATUS_TREE0_SCH_INTR_STS_Pos                                                               0U
#define AON_REG_SCH_PLN_INTR_STATUS_TREE0_SCH_INTR_STS_Msk                                                               (0x1UL << AON_REG_SCH_PLN_INTR_STATUS_TREE0_SCH_INTR_STS_Pos)

#define AON_REG_SCH_PLN_INTR_STATUS_TREE1_SCH_INTR_STS_Pos                                                               1U
#define AON_REG_SCH_PLN_INTR_STATUS_TREE1_SCH_INTR_STS_Msk                                                               (0x1UL << AON_REG_SCH_PLN_INTR_STATUS_TREE1_SCH_INTR_STS_Pos)

#define AON_REG_SCH_PLN_INTR_STATUS_SCH_PLN_INTR_STS_RESERVED31_2_Pos                                                    2U
#define AON_REG_SCH_PLN_INTR_STATUS_SCH_PLN_INTR_STS_RESERVED31_2_Msk                                                    (0x3FFFFFFFUL << AON_REG_SCH_PLN_INTR_STATUS_SCH_PLN_INTR_STS_RESERVED31_2_Pos)

/* 0xC7C    0x4000_0c7c
    0       R/WAC   TREE0_SCH_INTR_CLR                                          1'b0
    1       R/WAC   TREE1_SCH_INTR_CLR                                          1'b0
    31:2    R       SCH_PLN_INTR_CLR_RESERVED31_2                               30'b0
 */
typedef union _AON_REG_SCH_PLN_INTR_CLEAR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TREE0_SCH_INTR_CLR: 1;
        uint32_t TREE1_SCH_INTR_CLR: 1;
        uint32_t SCH_PLN_INTR_CLR_RESERVED31_2: 30;
    };
} AON_REG_SCH_PLN_INTR_CLEAR_TYPE;

/*0x4000_0c7c AON_REG_SCH_PLN_INTR_CLEAR*/
#define AON_REG_SCH_PLN_INTR_CLEAR_TREE0_SCH_INTR_CLR_Pos                                                                0U
#define AON_REG_SCH_PLN_INTR_CLEAR_TREE0_SCH_INTR_CLR_Msk                                                                (0x1UL << AON_REG_SCH_PLN_INTR_CLEAR_TREE0_SCH_INTR_CLR_Pos)

#define AON_REG_SCH_PLN_INTR_CLEAR_TREE1_SCH_INTR_CLR_Pos                                                                1U
#define AON_REG_SCH_PLN_INTR_CLEAR_TREE1_SCH_INTR_CLR_Msk                                                                (0x1UL << AON_REG_SCH_PLN_INTR_CLEAR_TREE1_SCH_INTR_CLR_Pos)

#define AON_REG_SCH_PLN_INTR_CLEAR_SCH_PLN_INTR_CLR_RESERVED31_2_Pos                                                     2U
#define AON_REG_SCH_PLN_INTR_CLEAR_SCH_PLN_INTR_CLR_RESERVED31_2_Msk                                                     (0x3FFFFFFFUL << AON_REG_SCH_PLN_INTR_CLEAR_SCH_PLN_INTR_CLR_RESERVED31_2_Pos)

