rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_2_DISABLE_Pos                                                                17U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_2_DISABLE_Msk                                                                (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_2_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_3_DISABLE_Pos                                                                18U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_3_DISABLE_Msk                                                                (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_3_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_4_DISABLE_Pos                                                                19U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_4_DISABLE_Msk                                                                (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_4_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_5_DISABLE_Pos                                                                20U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_5_DISABLE_Msk                                                                (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_5_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_6_DISABLE_Pos                                                                21U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_6_DISABLE_Msk                                                                (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_6_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_7_DISABLE_Pos                                                                22U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_7_DISABLE_Msk                                                                (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_7_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_8_DISABLE_Pos                                                                23U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_8_DISABLE_Msk                                                                (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_8_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_9_DISABLE_Pos                                                                24U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_9_DISABLE_Msk                                                                (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_9_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_10_DISABLE_Pos                                                               25U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_10_DISABLE_Msk                                                               (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_10_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_11_DISABLE_Pos                                                               26U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_11_DISABLE_Msk                                                               (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_11_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_12_DISABLE_Pos                                                               27U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_12_DISABLE_Msk                                                               (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_12_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_13_DISABLE_Pos                                                               28U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_13_DISABLE_Msk                                                               (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_13_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_14_DISABLE_Pos                                                               29U
#define AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_14_DISABLE_Msk                                                               (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_NODE_1_14_DISABLE_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_SCH_PLN_NODE_DISABLE_RESERVED31_30_Pos                                              30U
#define AON_REG_SCH_PLN_NODE_DISABLE_SCH_PLN_NODE_DISABLE_RESERVED31_30_Msk                                              (0x3UL << AON_REG_SCH_PLN_NODE_DISABLE_SCH_PLN_NODE_DISABLE_RESERVED31_30_Pos)

/* 0xC84    0x4000_0c84
    0       R/W     NODE_0_1_DISABLE_AUTO_BYPASS                                1'b0
    1       R/W     NODE_0_2_DISABLE_AUTO_BYPASS                                1'b0
    2       R/W     NODE_0_3_DISABLE_AUTO_BYPASS                                1'b0
    3       R/W     NODE_0_4_DISABLE_AUTO_BYPASS                                1'b0
    4       R/W     NODE_0_5_DISABLE_AUTO_BYPASS                                1'b0
    5       R/W     NODE_0_6_DISABLE_AUTO_BYPASS                                1'b0
    6       R/W     NODE_0_7_DISABLE_AUTO_BYPASS                                1'b0
    7       R/W     NODE_0_8_DISABLE_AUTO_BYPASS                                1'b0
    8       R/W     NODE_0_9_DISABLE_AUTO_BYPASS                                1'b0
    9       R/W     NODE_0_10_DISABLE_AUTO_BYPASS                               1'b0
    15:10   R       SCH_PLN_NODE_DISABLE_AUTO_BYPASS_RESERVED15_10              6'b0
    16      R/W     NODE_1_1_DISABLE_AUTO_BYPASS                                1'b0
    17      R/W     NODE_1_2_DISABLE_AUTO_BYPASS                                1'b0
    18      R/W     NODE_1_3_DISABLE_AUTO_BYPASS                                1'b0
    19      R/W     NODE_1_4_DISABLE_AUTO_BYPASS                                1'b0
    20      R/W     NODE_1_5_DISABLE_AUTO_BYPASS                                1'b0
    21      R/W     NODE_1_6_DISABLE_AUTO_BYPASS                                1'b0
    22      R/W     NODE_1_7_DISABLE_AUTO_BYPASS                                1'b0
    23      R/W     NODE_1_8_DISABLE_AUTO_BYPASS                                1'b0
    24      R/W     NODE_1_9_DISABLE_AUTO_BYPASS                                1'b0
    25      R/W     NODE_1_10_DISABLE_AUTO_BYPASS                               1'b0
    26      R/W     NODE_1_11_DISABLE_AUTO_BYPASS                               1'b0
    27      R/W     NODE_1_12_DISABLE_AUTO_BYPASS                               1'b0
    28      R/W     NODE_1_13_DISABLE_AUTO_BYPASS                               1'b0
    29      R/W     NODE_1_14_DISABLE_AUTO_BYPASS                               1'b0
    31:30   R       SCH_PLN_NODE_DISABLE_AUTO_BYPASS_RESERVED31_30              2'b0
 */
typedef union _AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t NODE_0_1_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_0_2_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_0_3_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_0_4_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_0_5_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_0_6_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_0_7_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_0_8_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_0_9_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_0_10_DISABLE_AUTO_BYPASS: 1;
        uint32_t SCH_PLN_NODE_DISABLE_AUTO_BYPASS_RESERVED15_10: 6;
        uint32_t NODE_1_1_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_2_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_3_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_4_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_5_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_6_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_7_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_8_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_9_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_10_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_11_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_12_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_13_DISABLE_AUTO_BYPASS: 1;
        uint32_t NODE_1_14_DISABLE_AUTO_BYPASS: 1;
        uint32_t SCH_PLN_NODE_DISABLE_AUTO_BYPASS_RESERVED31_30: 2;
    };
} AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_TYPE;

/*0x4000_0c84 AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS*/
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_1_DISABLE_AUTO_BYPASS_Pos                                        0U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_1_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_1_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_2_DISABLE_AUTO_BYPASS_Pos                                        1U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_2_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_2_DISABLE_AUTO_BYPASS_Pos)

