rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_3_DISABLE_AUTO_BYPASS_Pos                                        2U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_3_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_3_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_4_DISABLE_AUTO_BYPASS_Pos                                        3U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_4_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_4_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_5_DISABLE_AUTO_BYPASS_Pos                                        4U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_5_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_5_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_6_DISABLE_AUTO_BYPASS_Pos                                        5U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_6_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_6_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_7_DISABLE_AUTO_BYPASS_Pos                                        6U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_7_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_7_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_8_DISABLE_AUTO_BYPASS_Pos                                        7U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_8_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_8_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_9_DISABLE_AUTO_BYPASS_Pos                                        8U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_9_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_9_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_10_DISABLE_AUTO_BYPASS_Pos                                       9U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_10_DISABLE_AUTO_BYPASS_Msk                                       (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_0_10_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_RESERVED15_10_Pos                      10U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_RESERVED15_10_Msk                      (0x3FUL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_RESERVED15_10_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_1_DISABLE_AUTO_BYPASS_Pos                                        16U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_1_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_1_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_2_DISABLE_AUTO_BYPASS_Pos                                        17U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_2_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_2_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_3_DISABLE_AUTO_BYPASS_Pos                                        18U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_3_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_3_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_4_DISABLE_AUTO_BYPASS_Pos                                        19U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_4_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_4_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_5_DISABLE_AUTO_BYPASS_Pos                                        20U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_5_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_5_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_6_DISABLE_AUTO_BYPASS_Pos                                        21U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_6_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_6_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_7_DISABLE_AUTO_BYPASS_Pos                                        22U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_7_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_7_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_8_DISABLE_AUTO_BYPASS_Pos                                        23U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_8_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_8_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_9_DISABLE_AUTO_BYPASS_Pos                                        24U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_9_DISABLE_AUTO_BYPASS_Msk                                        (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_9_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_10_DISABLE_AUTO_BYPASS_Pos                                       25U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_10_DISABLE_AUTO_BYPASS_Msk                                       (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_10_DISABLE_AUTO_BYPASS_Pos)

