rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_11_DISABLE_AUTO_BYPASS_Pos                                       26U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_11_DISABLE_AUTO_BYPASS_Msk                                       (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_11_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_12_DISABLE_AUTO_BYPASS_Pos                                       27U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_12_DISABLE_AUTO_BYPASS_Msk                                       (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_12_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_13_DISABLE_AUTO_BYPASS_Pos                                       28U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_13_DISABLE_AUTO_BYPASS_Msk                                       (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_13_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_14_DISABLE_AUTO_BYPASS_Pos                                       29U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_14_DISABLE_AUTO_BYPASS_Msk                                       (0x1UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_NODE_1_14_DISABLE_AUTO_BYPASS_Pos)

#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_RESERVED31_30_Pos                      30U
#define AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_RESERVED31_30_Msk                      (0x3UL << AON_REG_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_SCH_PLN_NODE_DISABLE_AUTO_BYPASS_RESERVED31_30_Pos)

/* 0xC88    0x4000_0c88
    31:0    R/W     CMPNT0_DELAY_PON                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT0_DELAY_PON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT0_DELAY_PON;
    };
} AON_REG_SCH_PLN_CMPNT0_DELAY_PON_TYPE;

/*0x4000_0c88 AON_REG_SCH_PLN_CMPNT0_DELAY_PON*/
#define AON_REG_SCH_PLN_CMPNT0_DELAY_PON_CMPNT0_DELAY_PON_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT0_DELAY_PON_CMPNT0_DELAY_PON_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT0_DELAY_PON_CMPNT0_DELAY_PON_Pos)

/* 0xC8C    0x4000_0c8c
    31:0    R/W     CMPNT0_DELAY_POF                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT0_DELAY_POF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT0_DELAY_POF;
    };
} AON_REG_SCH_PLN_CMPNT0_DELAY_POF_TYPE;

/*0x4000_0c8c AON_REG_SCH_PLN_CMPNT0_DELAY_POF*/
#define AON_REG_SCH_PLN_CMPNT0_DELAY_POF_CMPNT0_DELAY_POF_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT0_DELAY_POF_CMPNT0_DELAY_POF_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT0_DELAY_POF_CMPNT0_DELAY_POF_Pos)

/* 0xC90    0x4000_0c90
    31:0    R/W     CMPNT1_DELAY_PON                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT1_DELAY_PON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT1_DELAY_PON;
    };
} AON_REG_SCH_PLN_CMPNT1_DELAY_PON_TYPE;

/*0x4000_0c90 AON_REG_SCH_PLN_CMPNT1_DELAY_PON*/
#define AON_REG_SCH_PLN_CMPNT1_DELAY_PON_CMPNT1_DELAY_PON_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT1_DELAY_PON_CMPNT1_DELAY_PON_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT1_DELAY_PON_CMPNT1_DELAY_PON_Pos)

/* 0xC94    0x4000_0c94
    31:0    R/W     CMPNT1_DELAY_POF                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT1_DELAY_POF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT1_DELAY_POF;
    };
} AON_REG_SCH_PLN_CMPNT1_DELAY_POF_TYPE;

/*0x4000_0c94 AON_REG_SCH_PLN_CMPNT1_DELAY_POF*/
#define AON_REG_SCH_PLN_CMPNT1_DELAY_POF_CMPNT1_DELAY_POF_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT1_DELAY_POF_CMPNT1_DELAY_POF_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT1_DELAY_POF_CMPNT1_DELAY_POF_Pos)

/* 0xC98    0x4000_0c98
    31:0    R/W     CMPNT2_DELAY_PON                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT2_DELAY_PON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT2_DELAY_PON;
    };
} AON_REG_SCH_PLN_CMPNT2_DELAY_PON_TYPE;

/*0x4000_0c98 AON_REG_SCH_PLN_CMPNT2_DELAY_PON*/
#define AON_REG_SCH_PLN_CMPNT2_DELAY_PON_CMPNT2_DELAY_PON_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT2_DELAY_PON_CMPNT2_DELAY_PON_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT2_DELAY_PON_CMPNT2_DELAY_PON_Pos)

/* 0xC9C    0x4000_0c9c
    31:0    R/W     CMPNT2_DELAY_POF                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT2_DELAY_POF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT2_DELAY_POF;
    };
} AON_REG_SCH_PLN_CMPNT2_DELAY_POF_TYPE;

/*0x4000_0c9c AON_REG_SCH_PLN_CMPNT2_DELAY_POF*/
#define AON_REG_SCH_PLN_CMPNT2_DELAY_POF_CMPNT2_DELAY_POF_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT2_DELAY_POF_CMPNT2_DELAY_POF_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT2_DELAY_POF_CMPNT2_DELAY_POF_Pos)

/* 0xCA0    0x4000_0ca0
    31:0    R/W     CMPNT3_DELAY_PON                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT3_DELAY_PON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT3_DELAY_PON;
    };
} AON_REG_SCH_PLN_CMPNT3_DELAY_PON_TYPE;

/*0x4000_0ca0 AON_REG_SCH_PLN_CMPNT3_DELAY_PON*/
#define AON_REG_SCH_PLN_CMPNT3_DELAY_PON_CMPNT3_DELAY_PON_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT3_DELAY_PON_CMPNT3_DELAY_PON_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT3_DELAY_PON_CMPNT3_DELAY_PON_Pos)

/* 0xCA4    0x4000_0ca4
    31:0    R/W     CMPNT3_DELAY_POF                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT3_DELAY_POF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT3_DELAY_POF;
    };
} AON_REG_SCH_PLN_CMPNT3_DELAY_POF_TYPE;

/*0x4000_0ca4 AON_REG_SCH_PLN_CMPNT3_DELAY_POF*/
#define AON_REG_SCH_PLN_CMPNT3_DELAY_POF_CMPNT3_DELAY_POF_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT3_DELAY_POF_CMPNT3_DELAY_POF_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT3_DELAY_POF_CMPNT3_DELAY_POF_Pos)

/* 0xCA8    0x4000_0ca8
    31:0    R/W     CMPNT4_DELAY_PON                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT4_DELAY_PON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT4_DELAY_PON;
    };
} AON_REG_SCH_PLN_CMPNT4_DELAY_PON_TYPE;

