rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0ca8 AON_REG_SCH_PLN_CMPNT4_DELAY_PON*/
#define AON_REG_SCH_PLN_CMPNT4_DELAY_PON_CMPNT4_DELAY_PON_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT4_DELAY_PON_CMPNT4_DELAY_PON_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT4_DELAY_PON_CMPNT4_DELAY_PON_Pos)

/* 0xCAC    0x4000_0cac
    31:0    R/W     CMPNT4_DELAY_POF                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT4_DELAY_POF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT4_DELAY_POF;
    };
} AON_REG_SCH_PLN_CMPNT4_DELAY_POF_TYPE;

/*0x4000_0cac AON_REG_SCH_PLN_CMPNT4_DELAY_POF*/
#define AON_REG_SCH_PLN_CMPNT4_DELAY_POF_CMPNT4_DELAY_POF_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT4_DELAY_POF_CMPNT4_DELAY_POF_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT4_DELAY_POF_CMPNT4_DELAY_POF_Pos)

/* 0xCB0    0x4000_0cb0
    31:0    R/W     CMPNT5_DELAY_PON                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT5_DELAY_PON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT5_DELAY_PON;
    };
} AON_REG_SCH_PLN_CMPNT5_DELAY_PON_TYPE;

/*0x4000_0cb0 AON_REG_SCH_PLN_CMPNT5_DELAY_PON*/
#define AON_REG_SCH_PLN_CMPNT5_DELAY_PON_CMPNT5_DELAY_PON_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT5_DELAY_PON_CMPNT5_DELAY_PON_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT5_DELAY_PON_CMPNT5_DELAY_PON_Pos)

/* 0xCB4    0x4000_0cb4
    31:0    R/W     CMPNT5_DELAY_POF                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT5_DELAY_POF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT5_DELAY_POF;
    };
} AON_REG_SCH_PLN_CMPNT5_DELAY_POF_TYPE;

/*0x4000_0cb4 AON_REG_SCH_PLN_CMPNT5_DELAY_POF*/
#define AON_REG_SCH_PLN_CMPNT5_DELAY_POF_CMPNT5_DELAY_POF_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT5_DELAY_POF_CMPNT5_DELAY_POF_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT5_DELAY_POF_CMPNT5_DELAY_POF_Pos)

/* 0xCB8    0x4000_0cb8
    31:0    R/W     CMPNT6_DELAY_PON                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT6_DELAY_PON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT6_DELAY_PON;
    };
} AON_REG_SCH_PLN_CMPNT6_DELAY_PON_TYPE;

/*0x4000_0cb8 AON_REG_SCH_PLN_CMPNT6_DELAY_PON*/
#define AON_REG_SCH_PLN_CMPNT6_DELAY_PON_CMPNT6_DELAY_PON_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT6_DELAY_PON_CMPNT6_DELAY_PON_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT6_DELAY_PON_CMPNT6_DELAY_PON_Pos)

/* 0xCBC    0x4000_0cbc
    31:0    R/W     CMPNT6_DELAY_POF                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT6_DELAY_POF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT6_DELAY_POF;
    };
} AON_REG_SCH_PLN_CMPNT6_DELAY_POF_TYPE;

/*0x4000_0cbc AON_REG_SCH_PLN_CMPNT6_DELAY_POF*/
#define AON_REG_SCH_PLN_CMPNT6_DELAY_POF_CMPNT6_DELAY_POF_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT6_DELAY_POF_CMPNT6_DELAY_POF_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT6_DELAY_POF_CMPNT6_DELAY_POF_Pos)

/* 0xCC0    0x4000_0cc0
    31:0    R/W     CMPNT7_DELAY_PON                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT7_DELAY_PON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT7_DELAY_PON;
    };
} AON_REG_SCH_PLN_CMPNT7_DELAY_PON_TYPE;

/*0x4000_0cc0 AON_REG_SCH_PLN_CMPNT7_DELAY_PON*/
#define AON_REG_SCH_PLN_CMPNT7_DELAY_PON_CMPNT7_DELAY_PON_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT7_DELAY_PON_CMPNT7_DELAY_PON_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT7_DELAY_PON_CMPNT7_DELAY_PON_Pos)

/* 0xCC4    0x4000_0cc4
    31:0    R/W     CMPNT7_DELAY_POF                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT7_DELAY_POF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT7_DELAY_POF;
    };
} AON_REG_SCH_PLN_CMPNT7_DELAY_POF_TYPE;

/*0x4000_0cc4 AON_REG_SCH_PLN_CMPNT7_DELAY_POF*/
#define AON_REG_SCH_PLN_CMPNT7_DELAY_POF_CMPNT7_DELAY_POF_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT7_DELAY_POF_CMPNT7_DELAY_POF_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT7_DELAY_POF_CMPNT7_DELAY_POF_Pos)

/* 0xCC8    0x4000_0cc8
    31:0    R/W     CMPNT8_DELAY_PON                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT8_DELAY_PON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT8_DELAY_PON;
    };
} AON_REG_SCH_PLN_CMPNT8_DELAY_PON_TYPE;

/*0x4000_0cc8 AON_REG_SCH_PLN_CMPNT8_DELAY_PON*/
#define AON_REG_SCH_PLN_CMPNT8_DELAY_PON_CMPNT8_DELAY_PON_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT8_DELAY_PON_CMPNT8_DELAY_PON_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT8_DELAY_PON_CMPNT8_DELAY_PON_Pos)

/* 0xCCC    0x4000_0ccc
    31:0    R/W     CMPNT8_DELAY_POF                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT8_DELAY_POF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT8_DELAY_POF;
    };
} AON_REG_SCH_PLN_CMPNT8_DELAY_POF_TYPE;

/*0x4000_0ccc AON_REG_SCH_PLN_CMPNT8_DELAY_POF*/
#define AON_REG_SCH_PLN_CMPNT8_DELAY_POF_CMPNT8_DELAY_POF_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT8_DELAY_POF_CMPNT8_DELAY_POF_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT8_DELAY_POF_CMPNT8_DELAY_POF_Pos)

/* 0xCD0    0x4000_0cd0
    31:0    R/W     CMPNT9_DELAY_PON                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT9_DELAY_PON_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT9_DELAY_PON;
    };
} AON_REG_SCH_PLN_CMPNT9_DELAY_PON_TYPE;

