rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0cd0 AON_REG_SCH_PLN_CMPNT9_DELAY_PON*/
#define AON_REG_SCH_PLN_CMPNT9_DELAY_PON_CMPNT9_DELAY_PON_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT9_DELAY_PON_CMPNT9_DELAY_PON_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT9_DELAY_PON_CMPNT9_DELAY_PON_Pos)

/* 0xCD4    0x4000_0cd4
    31:0    R/W     CMPNT9_DELAY_POF                                            32'b0
 */
typedef union _AON_REG_SCH_PLN_CMPNT9_DELAY_POF_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CMPNT9_DELAY_POF;
    };
} AON_REG_SCH_PLN_CMPNT9_DELAY_POF_TYPE;

/*0x4000_0cd4 AON_REG_SCH_PLN_CMPNT9_DELAY_POF*/
#define AON_REG_SCH_PLN_CMPNT9_DELAY_POF_CMPNT9_DELAY_POF_Pos                                                            0U
#define AON_REG_SCH_PLN_CMPNT9_DELAY_POF_CMPNT9_DELAY_POF_Msk                                                            (0xFFFFFFFFUL << AON_REG_SCH_PLN_CMPNT9_DELAY_POF_CMPNT9_DELAY_POF_Pos)

/* 0xCD8    0x4000_0cd8
    0       R/W     SCH_PLN_QACT_CLK_MAN_DATA                                   1'h0
    1       R/W     SCH_PLN_QACT_CLK_MAN_EN                                     1'h0
    31:2    R       SCH_PLN_INTR_CLR_RESERVED31_2                               30'b0
 */
typedef union _AON_REG_SCH_PLN_QACTIVE_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SCH_PLN_QACT_CLK_MAN_DATA: 1;
        uint32_t SCH_PLN_QACT_CLK_MAN_EN: 1;
        uint32_t SCH_PLN_INTR_CLR_RESERVED31_2: 30;
    };
} AON_REG_SCH_PLN_QACTIVE_CTRL_TYPE;

/*0x4000_0cd8 AON_REG_SCH_PLN_QACTIVE_CTRL*/
#define AON_REG_SCH_PLN_QACTIVE_CTRL_SCH_PLN_QACT_CLK_MAN_DATA_Pos                                                       0U
#define AON_REG_SCH_PLN_QACTIVE_CTRL_SCH_PLN_QACT_CLK_MAN_DATA_Msk                                                       (0x1UL << AON_REG_SCH_PLN_QACTIVE_CTRL_SCH_PLN_QACT_CLK_MAN_DATA_Pos)

#define AON_REG_SCH_PLN_QACTIVE_CTRL_SCH_PLN_QACT_CLK_MAN_EN_Pos                                                         1U
#define AON_REG_SCH_PLN_QACTIVE_CTRL_SCH_PLN_QACT_CLK_MAN_EN_Msk                                                         (0x1UL << AON_REG_SCH_PLN_QACTIVE_CTRL_SCH_PLN_QACT_CLK_MAN_EN_Pos)

#define AON_REG_SCH_PLN_QACTIVE_CTRL_SCH_PLN_INTR_CLR_RESERVED31_2_Pos                                                   2U
#define AON_REG_SCH_PLN_QACTIVE_CTRL_SCH_PLN_INTR_CLR_RESERVED31_2_Msk                                                   (0x3FFFFFFFUL << AON_REG_SCH_PLN_QACTIVE_CTRL_SCH_PLN_INTR_CLR_RESERVED31_2_Pos)

/* 0xCDC    0x4000_0cdc
    31:0    R       SCH_PLN_VERSION                                             32'h20240827
 */
typedef union _AON_REG_SCH_PLN_VERSION_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t SCH_PLN_VERSION;
    };
} AON_REG_SCH_PLN_VERSION_TYPE;

/*0x4000_0cdc AON_REG_SCH_PLN_VERSION*/
#define AON_REG_SCH_PLN_VERSION_SCH_PLN_VERSION_Pos                                                                      0U
#define AON_REG_SCH_PLN_VERSION_SCH_PLN_VERSION_Msk                                                                      (0xFFFFFFFFUL << AON_REG_SCH_PLN_VERSION_SCH_PLN_VERSION_Pos)

/* 0xCE0    0x4000_0ce0
    31:0    R/W     TREE0_ROOT_CHECK_TIME                                       32'b0
 */
typedef union _AON_REG_SCH_PLN_TREE0_ROOT_CHECK_TIME_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TREE0_ROOT_CHECK_TIME;
    };
} AON_REG_SCH_PLN_TREE0_ROOT_CHECK_TIME_TYPE;

/*0x4000_0ce0 AON_REG_SCH_PLN_TREE0_ROOT_CHECK_TIME*/
#define AON_REG_SCH_PLN_TREE0_ROOT_CHECK_TIME_TREE0_ROOT_CHECK_TIME_Pos                                                  0U
#define AON_REG_SCH_PLN_TREE0_ROOT_CHECK_TIME_TREE0_ROOT_CHECK_TIME_Msk                                                  (0xFFFFFFFFUL << AON_REG_SCH_PLN_TREE0_ROOT_CHECK_TIME_TREE0_ROOT_CHECK_TIME_Pos)

/* 0xCE4    0x4000_0ce4
    31:0    R/W     TREE1_ROOT_CHECK_TIME                                       32'b0
 */
typedef union _AON_REG_SCH_PLN_TREE1_ROOT_CHECK_TIME_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TREE1_ROOT_CHECK_TIME;
    };
} AON_REG_SCH_PLN_TREE1_ROOT_CHECK_TIME_TYPE;

/*0x4000_0ce4 AON_REG_SCH_PLN_TREE1_ROOT_CHECK_TIME*/
#define AON_REG_SCH_PLN_TREE1_ROOT_CHECK_TIME_TREE1_ROOT_CHECK_TIME_Pos                                                  0U
#define AON_REG_SCH_PLN_TREE1_ROOT_CHECK_TIME_TREE1_ROOT_CHECK_TIME_Msk                                                  (0xFFFFFFFFUL << AON_REG_SCH_PLN_TREE1_ROOT_CHECK_TIME_TREE1_ROOT_CHECK_TIME_Pos)

/* 0xCF0    0x4000_0cf0
    0       R/W     GTC_CNT_START                                               1'b1
    1       R/WAC   GTC_CNT_RST                                                 1'b0
    30:2    R       GTC_CTRL_RESERVED29_2                                       29'h0
    31      R/W     GTC_RST                                                     1'b0
 */
typedef union _AON_REG_GTC_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GTC_CNT_START: 1;
        uint32_t GTC_CNT_RST: 1;
        uint32_t GTC_CTRL_RESERVED29_2: 29;
        uint32_t GTC_RST: 1;
    };
} AON_REG_GTC_CTRL_TYPE;

/*0x4000_0cf0 AON_REG_GTC_CTRL*/
#define AON_REG_GTC_CTRL_GTC_CNT_START_Pos                                                                               0U
#define AON_REG_GTC_CTRL_GTC_CNT_START_Msk                                                                               (0x1UL << AON_REG_GTC_CTRL_GTC_CNT_START_Pos)

#define AON_REG_GTC_CTRL_GTC_CNT_RST_Pos                                                                                 1U
#define AON_REG_GTC_CTRL_GTC_CNT_RST_Msk                                                                                 (0x1UL << AON_REG_GTC_CTRL_GTC_CNT_RST_Pos)

#define AON_REG_GTC_CTRL_GTC_CTRL_RESERVED29_2_Pos                                                                       2U
#define AON_REG_GTC_CTRL_GTC_CTRL_RESERVED29_2_Msk                                                                       (0x1FFFFFFFUL << AON_REG_GTC_CTRL_GTC_CTRL_RESERVED29_2_Pos)

#define AON_REG_GTC_CTRL_GTC_RST_Pos                                                                                     31U
#define AON_REG_GTC_CTRL_GTC_RST_Msk                                                                                     (0x1UL << AON_REG_GTC_CTRL_GTC_RST_Pos)

/* 0xCF4    0x4000_0cf4
    31:0    R       GLOBAL_TIME_COUNTER_VALUE                                   32'b0
 */
typedef union _AON_REG_GTC_CNT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GLOBAL_TIME_COUNTER_VALUE;
    };
} AON_REG_GTC_CNT_TYPE;

/*0x4000_0cf4 AON_REG_GTC_CNT*/
#define AON_REG_GTC_CNT_GLOBAL_TIME_COUNTER_VALUE_Pos                                                                    0U
#define AON_REG_GTC_CNT_GLOBAL_TIME_COUNTER_VALUE_Msk                                                                    (0xFFFFFFFFUL << AON_REG_GTC_CNT_GLOBAL_TIME_COUNTER_VALUE_Pos)

/* 0xCF8    0x4000_0cf8
    31:0    R       GTC_VERSION                                                 32'h20240930
 */
typedef union _AON_REG_GTC_VERSION_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GTC_VERSION;
    };
} AON_REG_GTC_VERSION_TYPE;

/*0x4000_0cf8 AON_REG_GTC_VERSION*/
#define AON_REG_GTC_VERSION_GTC_VERSION_Pos                                                                              0U
#define AON_REG_GTC_VERSION_GTC_VERSION_Msk                                                                              (0xFFFFFFFFUL << AON_REG_GTC_VERSION_GTC_VERSION_Pos)

/* 0xD04    0x4000_0d04
    30:0    R       GRTC_CTRL_RESERVED30_0                                      31'b0
    31      R/W     GRTC_RST                                                    1'b0
 */
typedef union _AON_REG_GRTC_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CTRL_RESERVED30_0: 31;
        uint32_t GRTC_RST: 1;
    };
} AON_REG_GRTC_CTRL_TYPE;

