rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0d04 AON_REG_GRTC_CTRL*/
#define AON_REG_GRTC_CTRL_GRTC_CTRL_RESERVED30_0_Pos                                                                     0U
#define AON_REG_GRTC_CTRL_GRTC_CTRL_RESERVED30_0_Msk                                                                     (0x7FFFFFFFUL << AON_REG_GRTC_CTRL_GRTC_CTRL_RESERVED30_0_Pos)

#define AON_REG_GRTC_CTRL_GRTC_RST_Pos                                                                                   31U
#define AON_REG_GRTC_CTRL_GRTC_RST_Msk                                                                                   (0x1UL << AON_REG_GRTC_CTRL_GRTC_RST_Pos)

/* 0xD08    0x4000_0d08
    0       R/W     GRTC_CMP0_NV_IE                                             1'b0
    1       R/W     GRTC_CMP1_NV_IE                                             1'b0
    2       R/W     GRTC_CMP2_NV_IE                                             1'b0
    3       R/W     GRTC_CMP3_NV_IE                                             1'b0
    4       R/W     GRTC_CMP4_NV_IE                                             1'b0
    5       R/W     GRTC_CMP5_NV_IE                                             1'b0
    6       R/W     GRTC_CMP6_NV_IE                                             1'b0
    7       R/W     GRTC_CMP7_NV_IE                                             1'b0
    31:8    R       GRTC_INTR_CTRL_RESERVED31_8                                 24'b0
 */
typedef union _AON_REG_GRTC_INTR_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP0_NV_IE: 1;
        uint32_t GRTC_CMP1_NV_IE: 1;
        uint32_t GRTC_CMP2_NV_IE: 1;
        uint32_t GRTC_CMP3_NV_IE: 1;
        uint32_t GRTC_CMP4_NV_IE: 1;
        uint32_t GRTC_CMP5_NV_IE: 1;
        uint32_t GRTC_CMP6_NV_IE: 1;
        uint32_t GRTC_CMP7_NV_IE: 1;
        uint32_t GRTC_INTR_CTRL_RESERVED31_8: 24;
    };
} AON_REG_GRTC_INTR_CTRL_TYPE;

/*0x4000_0d08 AON_REG_GRTC_INTR_CTRL*/
#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP0_NV_IE_Pos                                                                       0U
#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP0_NV_IE_Msk                                                                       (0x1UL << AON_REG_GRTC_INTR_CTRL_GRTC_CMP0_NV_IE_Pos)

#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP1_NV_IE_Pos                                                                       1U
#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP1_NV_IE_Msk                                                                       (0x1UL << AON_REG_GRTC_INTR_CTRL_GRTC_CMP1_NV_IE_Pos)

#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP2_NV_IE_Pos                                                                       2U
#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP2_NV_IE_Msk                                                                       (0x1UL << AON_REG_GRTC_INTR_CTRL_GRTC_CMP2_NV_IE_Pos)

#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP3_NV_IE_Pos                                                                       3U
#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP3_NV_IE_Msk                                                                       (0x1UL << AON_REG_GRTC_INTR_CTRL_GRTC_CMP3_NV_IE_Pos)

#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP4_NV_IE_Pos                                                                       4U
#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP4_NV_IE_Msk                                                                       (0x1UL << AON_REG_GRTC_INTR_CTRL_GRTC_CMP4_NV_IE_Pos)

#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP5_NV_IE_Pos                                                                       5U
#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP5_NV_IE_Msk                                                                       (0x1UL << AON_REG_GRTC_INTR_CTRL_GRTC_CMP5_NV_IE_Pos)

#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP6_NV_IE_Pos                                                                       6U
#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP6_NV_IE_Msk                                                                       (0x1UL << AON_REG_GRTC_INTR_CTRL_GRTC_CMP6_NV_IE_Pos)

#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP7_NV_IE_Pos                                                                       7U
#define AON_REG_GRTC_INTR_CTRL_GRTC_CMP7_NV_IE_Msk                                                                       (0x1UL << AON_REG_GRTC_INTR_CTRL_GRTC_CMP7_NV_IE_Pos)

#define AON_REG_GRTC_INTR_CTRL_GRTC_INTR_CTRL_RESERVED31_8_Pos                                                           8U
#define AON_REG_GRTC_INTR_CTRL_GRTC_INTR_CTRL_RESERVED31_8_Msk                                                           (0xFFFFFFUL << AON_REG_GRTC_INTR_CTRL_GRTC_INTR_CTRL_RESERVED31_8_Pos)

/* 0xD0C    0x4000_0d0c
    0       R       GRTC_CMP0_NV_SR                                             1'b0
    1       R       GRTC_CMP1_NV_SR                                             1'b0
    2       R       GRTC_CMP2_NV_SR                                             1'b0
    3       R       GRTC_CMP3_NV_SR                                             1'b0
    4       R       GRTC_CMP4_NV_SR                                             1'b0
    5       R       GRTC_CMP5_NV_SR                                             1'b0
    6       R       GRTC_CMP6_NV_SR                                             1'b0
    7       R       GRTC_CMP7_NV_SR                                             1'b0
    31:8    R       GRTC_COMP_INTR_SR_RESERVED31_8                              24'b0
 */
typedef union _AON_REG_GRTC_COMP_INTR_SR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP0_NV_SR: 1;
        uint32_t GRTC_CMP1_NV_SR: 1;
        uint32_t GRTC_CMP2_NV_SR: 1;
        uint32_t GRTC_CMP3_NV_SR: 1;
        uint32_t GRTC_CMP4_NV_SR: 1;
        uint32_t GRTC_CMP5_NV_SR: 1;
        uint32_t GRTC_CMP6_NV_SR: 1;
        uint32_t GRTC_CMP7_NV_SR: 1;
        uint32_t GRTC_COMP_INTR_SR_RESERVED31_8: 24;
    };
} AON_REG_GRTC_COMP_INTR_SR_TYPE;

/*0x4000_0d0c AON_REG_GRTC_COMP_INTR_SR*/
#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP0_NV_SR_Pos                                                                    0U
#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP0_NV_SR_Msk                                                                    (0x1UL << AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP0_NV_SR_Pos)

