rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP1_NV_SR_Pos                                                                    1U
#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP1_NV_SR_Msk                                                                    (0x1UL << AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP1_NV_SR_Pos)

#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP2_NV_SR_Pos                                                                    2U
#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP2_NV_SR_Msk                                                                    (0x1UL << AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP2_NV_SR_Pos)

#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP3_NV_SR_Pos                                                                    3U
#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP3_NV_SR_Msk                                                                    (0x1UL << AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP3_NV_SR_Pos)

#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP4_NV_SR_Pos                                                                    4U
#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP4_NV_SR_Msk                                                                    (0x1UL << AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP4_NV_SR_Pos)

#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP5_NV_SR_Pos                                                                    5U
#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP5_NV_SR_Msk                                                                    (0x1UL << AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP5_NV_SR_Pos)

#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP6_NV_SR_Pos                                                                    6U
#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP6_NV_SR_Msk                                                                    (0x1UL << AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP6_NV_SR_Pos)

#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP7_NV_SR_Pos                                                                    7U
#define AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP7_NV_SR_Msk                                                                    (0x1UL << AON_REG_GRTC_COMP_INTR_SR_GRTC_CMP7_NV_SR_Pos)

#define AON_REG_GRTC_COMP_INTR_SR_GRTC_COMP_INTR_SR_RESERVED31_8_Pos                                                     8U
#define AON_REG_GRTC_COMP_INTR_SR_GRTC_COMP_INTR_SR_RESERVED31_8_Msk                                                     (0xFFFFFFUL << AON_REG_GRTC_COMP_INTR_SR_GRTC_COMP_INTR_SR_RESERVED31_8_Pos)

/* 0xD10    0x4000_0d10
    0       R/WAC   GRTC_CMP0_NV_CLR                                            1'b0
    1       R/WAC   GRTC_CMP1_NV_CLR                                            1'b0
    2       R/WAC   GRTC_CMP2_NV_CLR                                            1'b0
    3       R/WAC   GRTC_CMP3_NV_CLR                                            1'b0
    4       R/WAC   GRTC_CMP4_NV_CLR                                            1'b0
    5       R/WAC   GRTC_CMP5_NV_CLR                                            1'b0
    6       R/WAC   GRTC_CMP6_NV_CLR                                            1'b0
    7       R/WAC   GRTC_CMP7_NV_CLR                                            1'b0
    31:8    R       GRTC_COMP_INTR_CLR_RESERVED31_8                             24'b0
 */
typedef union _AON_REG_GRTC_COMP_INT_CLR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP0_NV_CLR: 1;
        uint32_t GRTC_CMP1_NV_CLR: 1;
        uint32_t GRTC_CMP2_NV_CLR: 1;
        uint32_t GRTC_CMP3_NV_CLR: 1;
        uint32_t GRTC_CMP4_NV_CLR: 1;
        uint32_t GRTC_CMP5_NV_CLR: 1;
        uint32_t GRTC_CMP6_NV_CLR: 1;
        uint32_t GRTC_CMP7_NV_CLR: 1;
        uint32_t GRTC_COMP_INTR_CLR_RESERVED31_8: 24;
    };
} AON_REG_GRTC_COMP_INT_CLR_TYPE;

/*0x4000_0d10 AON_REG_GRTC_COMP_INT_CLR*/
#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP0_NV_CLR_Pos                                                                   0U
#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP0_NV_CLR_Msk                                                                   (0x1UL << AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP0_NV_CLR_Pos)

#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP1_NV_CLR_Pos                                                                   1U
#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP1_NV_CLR_Msk                                                                   (0x1UL << AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP1_NV_CLR_Pos)

#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP2_NV_CLR_Pos                                                                   2U
#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP2_NV_CLR_Msk                                                                   (0x1UL << AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP2_NV_CLR_Pos)

#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP3_NV_CLR_Pos                                                                   3U
#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP3_NV_CLR_Msk                                                                   (0x1UL << AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP3_NV_CLR_Pos)

#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP4_NV_CLR_Pos                                                                   4U
#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP4_NV_CLR_Msk                                                                   (0x1UL << AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP4_NV_CLR_Pos)

#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP5_NV_CLR_Pos                                                                   5U
#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP5_NV_CLR_Msk                                                                   (0x1UL << AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP5_NV_CLR_Pos)

#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP6_NV_CLR_Pos                                                                   6U
#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP6_NV_CLR_Msk                                                                   (0x1UL << AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP6_NV_CLR_Pos)

#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP7_NV_CLR_Pos                                                                   7U
#define AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP7_NV_CLR_Msk                                                                   (0x1UL << AON_REG_GRTC_COMP_INT_CLR_GRTC_CMP7_NV_CLR_Pos)

#define AON_REG_GRTC_COMP_INT_CLR_GRTC_COMP_INTR_CLR_RESERVED31_8_Pos                                                    8U
#define AON_REG_GRTC_COMP_INT_CLR_GRTC_COMP_INTR_CLR_RESERVED31_8_Msk                                                    (0xFFFFFFUL << AON_REG_GRTC_COMP_INT_CLR_GRTC_COMP_INTR_CLR_RESERVED31_8_Pos)

/* 0xD14    0x4000_0d14
    31:0    R/W     GRTC_CMP0                                                   32'b0
 */
typedef union _AON_REG_GRTC_COMP_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP0;
    };
} AON_REG_GRTC_COMP_0_TYPE;

/*0x4000_0d14 AON_REG_GRTC_COMP_0*/
#define AON_REG_GRTC_COMP_0_GRTC_CMP0_Pos                                                                                0U
#define AON_REG_GRTC_COMP_0_GRTC_CMP0_Msk                                                                                (0xFFFFFFFFUL << AON_REG_GRTC_COMP_0_GRTC_CMP0_Pos)

