rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/* 0xD18    0x4000_0d18
    31:0    R/W     GRTC_CMP1                                                   32'b0
 */
typedef union _AON_REG_GRTC_COMP_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP1;
    };
} AON_REG_GRTC_COMP_1_TYPE;

/*0x4000_0d18 AON_REG_GRTC_COMP_1*/
#define AON_REG_GRTC_COMP_1_GRTC_CMP1_Pos                                                                                0U
#define AON_REG_GRTC_COMP_1_GRTC_CMP1_Msk                                                                                (0xFFFFFFFFUL << AON_REG_GRTC_COMP_1_GRTC_CMP1_Pos)

/* 0xD1C    0x4000_0d1c
    31:0    R/W     GRTC_CMP2                                                   32'b0
 */
typedef union _AON_REG_GRTC_COMP_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP2;
    };
} AON_REG_GRTC_COMP_2_TYPE;

/*0x4000_0d1c AON_REG_GRTC_COMP_2*/
#define AON_REG_GRTC_COMP_2_GRTC_CMP2_Pos                                                                                0U
#define AON_REG_GRTC_COMP_2_GRTC_CMP2_Msk                                                                                (0xFFFFFFFFUL << AON_REG_GRTC_COMP_2_GRTC_CMP2_Pos)

/* 0xD20    0x4000_0d20
    31:0    R/W     GRTC_CMP3                                                   32'b0
 */
typedef union _AON_REG_GRTC_COMP_3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP3;
    };
} AON_REG_GRTC_COMP_3_TYPE;

/*0x4000_0d20 AON_REG_GRTC_COMP_3*/
#define AON_REG_GRTC_COMP_3_GRTC_CMP3_Pos                                                                                0U
#define AON_REG_GRTC_COMP_3_GRTC_CMP3_Msk                                                                                (0xFFFFFFFFUL << AON_REG_GRTC_COMP_3_GRTC_CMP3_Pos)

/* 0xD24    0x4000_0d24
    31:0    R/W     GRTC_CMP4                                                   32'b0
 */
typedef union _AON_REG_GRTC_COMP_4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP4;
    };
} AON_REG_GRTC_COMP_4_TYPE;

/*0x4000_0d24 AON_REG_GRTC_COMP_4*/
#define AON_REG_GRTC_COMP_4_GRTC_CMP4_Pos                                                                                0U
#define AON_REG_GRTC_COMP_4_GRTC_CMP4_Msk                                                                                (0xFFFFFFFFUL << AON_REG_GRTC_COMP_4_GRTC_CMP4_Pos)

/* 0xD28    0x4000_0d28
    31:0    R/W     GRTC_CMP5                                                   32'b0
 */
typedef union _AON_REG_GRTC_COMP_5_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP5;
    };
} AON_REG_GRTC_COMP_5_TYPE;

/*0x4000_0d28 AON_REG_GRTC_COMP_5*/
#define AON_REG_GRTC_COMP_5_GRTC_CMP5_Pos                                                                                0U
#define AON_REG_GRTC_COMP_5_GRTC_CMP5_Msk                                                                                (0xFFFFFFFFUL << AON_REG_GRTC_COMP_5_GRTC_CMP5_Pos)

/* 0xD2C    0x4000_0d2c
    31:0    R/W     GRTC_CMP6                                                   32'b0
 */
typedef union _AON_REG_GRTC_COMP_6_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP6;
    };
} AON_REG_GRTC_COMP_6_TYPE;

/*0x4000_0d2c AON_REG_GRTC_COMP_6*/
#define AON_REG_GRTC_COMP_6_GRTC_CMP6_Pos                                                                                0U
#define AON_REG_GRTC_COMP_6_GRTC_CMP6_Msk                                                                                (0xFFFFFFFFUL << AON_REG_GRTC_COMP_6_GRTC_CMP6_Pos)

/* 0xD30    0x4000_0d30
    31:0    R/W     GRTC_CMP7                                                   32'b0
 */
typedef union _AON_REG_GRTC_COMP_7_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP7;
    };
} AON_REG_GRTC_COMP_7_TYPE;

/*0x4000_0d30 AON_REG_GRTC_COMP_7*/
#define AON_REG_GRTC_COMP_7_GRTC_CMP7_Pos                                                                                0U
#define AON_REG_GRTC_COMP_7_GRTC_CMP7_Msk                                                                                (0xFFFFFFFFUL << AON_REG_GRTC_COMP_7_GRTC_CMP7_Pos)

/* 0xD34    0x4000_0d34
    0       R/W     GRTC_CMP0_RELOAD_EN                                         1'h0
    1       R/W     GRTC_CMP1_RELOAD_EN                                         1'b0
    2       R/W     GRTC_CMP2_RELOAD_EN                                         1'b0
    3       R/W     GRTC_CMP3_RELOAD_EN                                         1'b0
    4       R/W     GRTC_CMP4_RELOAD_EN                                         1'b0
    5       R/W     GRTC_CMP5_RELOAD_EN                                         1'b0
    6       R/W     GRTC_CMP6_RELOAD_EN                                         1'b0
    7       R/W     GRTC_CMP7_RELOAD_EN                                         1'b0
    31:8    R       GRTC_COMP_RELOAD_CTRL_RESERVED31_8                          24'b0
 */
typedef union _AON_REG_GRTC_RELOAD_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP0_RELOAD_EN: 1;
        uint32_t GRTC_CMP1_RELOAD_EN: 1;
        uint32_t GRTC_CMP2_RELOAD_EN: 1;
        uint32_t GRTC_CMP3_RELOAD_EN: 1;
        uint32_t GRTC_CMP4_RELOAD_EN: 1;
        uint32_t GRTC_CMP5_RELOAD_EN: 1;
        uint32_t GRTC_CMP6_RELOAD_EN: 1;
        uint32_t GRTC_CMP7_RELOAD_EN: 1;
        uint32_t GRTC_COMP_RELOAD_CTRL_RESERVED31_8: 24;
    };
} AON_REG_GRTC_RELOAD_CTRL_TYPE;

/*0x4000_0d34 AON_REG_GRTC_RELOAD_CTRL*/
#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP0_RELOAD_EN_Pos                                                                 0U
#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP0_RELOAD_EN_Msk                                                                 (0x1UL << AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP0_RELOAD_EN_Pos)

#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP1_RELOAD_EN_Pos                                                                 1U
#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP1_RELOAD_EN_Msk                                                                 (0x1UL << AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP1_RELOAD_EN_Pos)

#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP2_RELOAD_EN_Pos                                                                 2U
#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP2_RELOAD_EN_Msk                                                                 (0x1UL << AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP2_RELOAD_EN_Pos)

#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP3_RELOAD_EN_Pos                                                                 3U
#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP3_RELOAD_EN_Msk                                                                 (0x1UL << AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP3_RELOAD_EN_Pos)

