rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP4_RELOAD_EN_Pos                                                                 4U
#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP4_RELOAD_EN_Msk                                                                 (0x1UL << AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP4_RELOAD_EN_Pos)

#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP5_RELOAD_EN_Pos                                                                 5U
#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP5_RELOAD_EN_Msk                                                                 (0x1UL << AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP5_RELOAD_EN_Pos)

#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP6_RELOAD_EN_Pos                                                                 6U
#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP6_RELOAD_EN_Msk                                                                 (0x1UL << AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP6_RELOAD_EN_Pos)

#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP7_RELOAD_EN_Pos                                                                 7U
#define AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP7_RELOAD_EN_Msk                                                                 (0x1UL << AON_REG_GRTC_RELOAD_CTRL_GRTC_CMP7_RELOAD_EN_Pos)

#define AON_REG_GRTC_RELOAD_CTRL_GRTC_COMP_RELOAD_CTRL_RESERVED31_8_Pos                                                  8U
#define AON_REG_GRTC_RELOAD_CTRL_GRTC_COMP_RELOAD_CTRL_RESERVED31_8_Msk                                                  (0xFFFFFFUL << AON_REG_GRTC_RELOAD_CTRL_GRTC_COMP_RELOAD_CTRL_RESERVED31_8_Pos)

/* 0xD38    0x4000_0d38
    31:0    R/W     GRTC_CMP0_RELOAD                                            32'b0
 */
typedef union _AON_REG_GRTC_COMP_0_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP0_RELOAD;
    };
} AON_REG_GRTC_COMP_0_RELOAD_TYPE;

/*0x4000_0d38 AON_REG_GRTC_COMP_0_RELOAD*/
#define AON_REG_GRTC_COMP_0_RELOAD_GRTC_CMP0_RELOAD_Pos                                                                  0U
#define AON_REG_GRTC_COMP_0_RELOAD_GRTC_CMP0_RELOAD_Msk                                                                  (0xFFFFFFFFUL << AON_REG_GRTC_COMP_0_RELOAD_GRTC_CMP0_RELOAD_Pos)

/* 0xD3C    0x4000_0d3c
    31:0    R/W     GRTC_CMP1_RELOAD                                            32'b0
 */
typedef union _AON_REG_GRTC_COMP_1_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP1_RELOAD;
    };
} AON_REG_GRTC_COMP_1_RELOAD_TYPE;

/*0x4000_0d3c AON_REG_GRTC_COMP_1_RELOAD*/
#define AON_REG_GRTC_COMP_1_RELOAD_GRTC_CMP1_RELOAD_Pos                                                                  0U
#define AON_REG_GRTC_COMP_1_RELOAD_GRTC_CMP1_RELOAD_Msk                                                                  (0xFFFFFFFFUL << AON_REG_GRTC_COMP_1_RELOAD_GRTC_CMP1_RELOAD_Pos)

/* 0xD40    0x4000_0d40
    31:0    R/W     GRTC_CMP2_RELOAD                                            32'b0
 */
typedef union _AON_REG_GRTC_COMP_2_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP2_RELOAD;
    };
} AON_REG_GRTC_COMP_2_RELOAD_TYPE;

/*0x4000_0d40 AON_REG_GRTC_COMP_2_RELOAD*/
#define AON_REG_GRTC_COMP_2_RELOAD_GRTC_CMP2_RELOAD_Pos                                                                  0U
#define AON_REG_GRTC_COMP_2_RELOAD_GRTC_CMP2_RELOAD_Msk                                                                  (0xFFFFFFFFUL << AON_REG_GRTC_COMP_2_RELOAD_GRTC_CMP2_RELOAD_Pos)

/* 0xD44    0x4000_0d44
    31:0    R/W     GRTC_CMP3_RELOAD                                            32'b0
 */
typedef union _AON_REG_GRTC_COMP_3_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP3_RELOAD;
    };
} AON_REG_GRTC_COMP_3_RELOAD_TYPE;

/*0x4000_0d44 AON_REG_GRTC_COMP_3_RELOAD*/
#define AON_REG_GRTC_COMP_3_RELOAD_GRTC_CMP3_RELOAD_Pos                                                                  0U
#define AON_REG_GRTC_COMP_3_RELOAD_GRTC_CMP3_RELOAD_Msk                                                                  (0xFFFFFFFFUL << AON_REG_GRTC_COMP_3_RELOAD_GRTC_CMP3_RELOAD_Pos)

/* 0xD48    0x4000_0d48
    31:0    R/W     GRTC_CMP4_RELOAD                                            32'b0
 */
typedef union _AON_REG_GRTC_COMP_4_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP4_RELOAD;
    };
} AON_REG_GRTC_COMP_4_RELOAD_TYPE;

/*0x4000_0d48 AON_REG_GRTC_COMP_4_RELOAD*/
#define AON_REG_GRTC_COMP_4_RELOAD_GRTC_CMP4_RELOAD_Pos                                                                  0U
#define AON_REG_GRTC_COMP_4_RELOAD_GRTC_CMP4_RELOAD_Msk                                                                  (0xFFFFFFFFUL << AON_REG_GRTC_COMP_4_RELOAD_GRTC_CMP4_RELOAD_Pos)

/* 0xD4C    0x4000_0d4c
    31:0    R/W     GRTC_CMP5_RELOAD                                            32'b0
 */
typedef union _AON_REG_GRTC_COMP_5_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP5_RELOAD;
    };
} AON_REG_GRTC_COMP_5_RELOAD_TYPE;

/*0x4000_0d4c AON_REG_GRTC_COMP_5_RELOAD*/
#define AON_REG_GRTC_COMP_5_RELOAD_GRTC_CMP5_RELOAD_Pos                                                                  0U
#define AON_REG_GRTC_COMP_5_RELOAD_GRTC_CMP5_RELOAD_Msk                                                                  (0xFFFFFFFFUL << AON_REG_GRTC_COMP_5_RELOAD_GRTC_CMP5_RELOAD_Pos)

/* 0xD50    0x4000_0d50
    31:0    R/W     GRTC_CMP6_RELOAD                                            32'b0
 */
typedef union _AON_REG_GRTC_COMP_6_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP6_RELOAD;
    };
} AON_REG_GRTC_COMP_6_RELOAD_TYPE;

/*0x4000_0d50 AON_REG_GRTC_COMP_6_RELOAD*/
#define AON_REG_GRTC_COMP_6_RELOAD_GRTC_CMP6_RELOAD_Pos                                                                  0U
#define AON_REG_GRTC_COMP_6_RELOAD_GRTC_CMP6_RELOAD_Msk                                                                  (0xFFFFFFFFUL << AON_REG_GRTC_COMP_6_RELOAD_GRTC_CMP6_RELOAD_Pos)

/* 0xD54    0x4000_0d54
    31:0    R/W     GRTC_CMP7_RELOAD                                            32'b0
 */
typedef union _AON_REG_GRTC_COMP_7_RELOAD_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP7_RELOAD;
    };
} AON_REG_GRTC_COMP_7_RELOAD_TYPE;

