rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0d54 AON_REG_GRTC_COMP_7_RELOAD*/
#define AON_REG_GRTC_COMP_7_RELOAD_GRTC_CMP7_RELOAD_Pos                                                                  0U
#define AON_REG_GRTC_COMP_7_RELOAD_GRTC_CMP7_RELOAD_Msk                                                                  (0xFFFFFFFFUL << AON_REG_GRTC_COMP_7_RELOAD_GRTC_CMP7_RELOAD_Pos)

/* 0xD58    0x4000_0d58
    0       R/W     GRTC_CMP0_SLEEP_CTRL                                        1'h0
    1       R/W     GRTC_CMP1_SLEEP_CTRL                                        1'b0
    2       R/W     GRTC_CMP2_SLEEP_CTRL                                        1'b0
    3       R/W     GRTC_CMP3_SLEEP_CTRL                                        1'b0
    4       R/W     GRTC_CMP4_SLEEP_CTRL                                        1'b0
    5       R/W     GRTC_CMP5_SLEEP_CTRL                                        1'b0
    6       R/W     GRTC_CMP6_SLEEP_CTRL                                        1'b0
    7       R/W     GRTC_CMP7_SLEEP_CTRL                                        1'b0
    31:8    R       GRTC_SLEEP_CTRL_RESERVED31_8                                24'b0
 */
typedef union _AON_REG_GRTC_SLEEP_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP0_SLEEP_CTRL: 1;
        uint32_t GRTC_CMP1_SLEEP_CTRL: 1;
        uint32_t GRTC_CMP2_SLEEP_CTRL: 1;
        uint32_t GRTC_CMP3_SLEEP_CTRL: 1;
        uint32_t GRTC_CMP4_SLEEP_CTRL: 1;
        uint32_t GRTC_CMP5_SLEEP_CTRL: 1;
        uint32_t GRTC_CMP6_SLEEP_CTRL: 1;
        uint32_t GRTC_CMP7_SLEEP_CTRL: 1;
        uint32_t GRTC_SLEEP_CTRL_RESERVED31_8: 24;
    };
} AON_REG_GRTC_SLEEP_CTRL_TYPE;

/*0x4000_0d58 AON_REG_GRTC_SLEEP_CTRL*/
#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP0_SLEEP_CTRL_Pos                                                                 0U
#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP0_SLEEP_CTRL_Msk                                                                 (0x1UL << AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP0_SLEEP_CTRL_Pos)

#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP1_SLEEP_CTRL_Pos                                                                 1U
#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP1_SLEEP_CTRL_Msk                                                                 (0x1UL << AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP1_SLEEP_CTRL_Pos)

#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP2_SLEEP_CTRL_Pos                                                                 2U
#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP2_SLEEP_CTRL_Msk                                                                 (0x1UL << AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP2_SLEEP_CTRL_Pos)

#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP3_SLEEP_CTRL_Pos                                                                 3U
#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP3_SLEEP_CTRL_Msk                                                                 (0x1UL << AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP3_SLEEP_CTRL_Pos)

#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP4_SLEEP_CTRL_Pos                                                                 4U
#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP4_SLEEP_CTRL_Msk                                                                 (0x1UL << AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP4_SLEEP_CTRL_Pos)

#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP5_SLEEP_CTRL_Pos                                                                 5U
#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP5_SLEEP_CTRL_Msk                                                                 (0x1UL << AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP5_SLEEP_CTRL_Pos)

#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP6_SLEEP_CTRL_Pos                                                                 6U
#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP6_SLEEP_CTRL_Msk                                                                 (0x1UL << AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP6_SLEEP_CTRL_Pos)

#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP7_SLEEP_CTRL_Pos                                                                 7U
#define AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP7_SLEEP_CTRL_Msk                                                                 (0x1UL << AON_REG_GRTC_SLEEP_CTRL_GRTC_CMP7_SLEEP_CTRL_Pos)

#define AON_REG_GRTC_SLEEP_CTRL_GRTC_SLEEP_CTRL_RESERVED31_8_Pos                                                         8U
#define AON_REG_GRTC_SLEEP_CTRL_GRTC_SLEEP_CTRL_RESERVED31_8_Msk                                                         (0xFFFFFFUL << AON_REG_GRTC_SLEEP_CTRL_GRTC_SLEEP_CTRL_RESERVED31_8_Pos)

/* 0xD5C    0x4000_0d5c
    31:0    R       GRTC_CMP0_SLEEP_PENDING_CNT                                 32'b0
 */
typedef union _AON_REG_GRTC_COMP_0_SLEEP_PENDING_CNT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP0_SLEEP_PENDING_CNT;
    };
} AON_REG_GRTC_COMP_0_SLEEP_PENDING_CNT_TYPE;

/*0x4000_0d5c AON_REG_GRTC_COMP_0_SLEEP_PENDING_CNT*/
#define AON_REG_GRTC_COMP_0_SLEEP_PENDING_CNT_GRTC_CMP0_SLEEP_PENDING_CNT_Pos                                            0U
#define AON_REG_GRTC_COMP_0_SLEEP_PENDING_CNT_GRTC_CMP0_SLEEP_PENDING_CNT_Msk                                            (0xFFFFFFFFUL << AON_REG_GRTC_COMP_0_SLEEP_PENDING_CNT_GRTC_CMP0_SLEEP_PENDING_CNT_Pos)

/* 0xD60    0x4000_0d60
    31:0    R       GRTC_CMP1_SLEEP_PENDING_CNT                                 32'b0
 */
typedef union _AON_REG_GRTC_COMP_1_SLEEP_PENDING_CNT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP1_SLEEP_PENDING_CNT;
    };
} AON_REG_GRTC_COMP_1_SLEEP_PENDING_CNT_TYPE;

/*0x4000_0d60 AON_REG_GRTC_COMP_1_SLEEP_PENDING_CNT*/
#define AON_REG_GRTC_COMP_1_SLEEP_PENDING_CNT_GRTC_CMP1_SLEEP_PENDING_CNT_Pos                                            0U
#define AON_REG_GRTC_COMP_1_SLEEP_PENDING_CNT_GRTC_CMP1_SLEEP_PENDING_CNT_Msk                                            (0xFFFFFFFFUL << AON_REG_GRTC_COMP_1_SLEEP_PENDING_CNT_GRTC_CMP1_SLEEP_PENDING_CNT_Pos)

/* 0xD64    0x4000_0d64
    31:0    R       GRTC_CMP2_SLEEP_PENDING_CNT                                 32'b0
 */
typedef union _AON_REG_GRTC_COMP_2_SLEEP_PENDING_CNT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP2_SLEEP_PENDING_CNT;
    };
} AON_REG_GRTC_COMP_2_SLEEP_PENDING_CNT_TYPE;

