rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0d64 AON_REG_GRTC_COMP_2_SLEEP_PENDING_CNT*/
#define AON_REG_GRTC_COMP_2_SLEEP_PENDING_CNT_GRTC_CMP2_SLEEP_PENDING_CNT_Pos                                            0U
#define AON_REG_GRTC_COMP_2_SLEEP_PENDING_CNT_GRTC_CMP2_SLEEP_PENDING_CNT_Msk                                            (0xFFFFFFFFUL << AON_REG_GRTC_COMP_2_SLEEP_PENDING_CNT_GRTC_CMP2_SLEEP_PENDING_CNT_Pos)

/* 0xD68    0x4000_0d68
    31:0    R       GRTC_CMP3_SLEEP_PENDING_CNT                                 32'b0
 */
typedef union _AON_REG_GRTC_COMP_3_SLEEP_PENDING_CNT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP3_SLEEP_PENDING_CNT;
    };
} AON_REG_GRTC_COMP_3_SLEEP_PENDING_CNT_TYPE;

/*0x4000_0d68 AON_REG_GRTC_COMP_3_SLEEP_PENDING_CNT*/
#define AON_REG_GRTC_COMP_3_SLEEP_PENDING_CNT_GRTC_CMP3_SLEEP_PENDING_CNT_Pos                                            0U
#define AON_REG_GRTC_COMP_3_SLEEP_PENDING_CNT_GRTC_CMP3_SLEEP_PENDING_CNT_Msk                                            (0xFFFFFFFFUL << AON_REG_GRTC_COMP_3_SLEEP_PENDING_CNT_GRTC_CMP3_SLEEP_PENDING_CNT_Pos)

/* 0xD6C    0x4000_0d6c
    31:0    R       GRTC_CMP4_SLEEP_PENDING_CNT                                 32'b0
 */
typedef union _AON_REG_GRTC_COMP_4_SLEEP_PENDING_CNT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP4_SLEEP_PENDING_CNT;
    };
} AON_REG_GRTC_COMP_4_SLEEP_PENDING_CNT_TYPE;

/*0x4000_0d6c AON_REG_GRTC_COMP_4_SLEEP_PENDING_CNT*/
#define AON_REG_GRTC_COMP_4_SLEEP_PENDING_CNT_GRTC_CMP4_SLEEP_PENDING_CNT_Pos                                            0U
#define AON_REG_GRTC_COMP_4_SLEEP_PENDING_CNT_GRTC_CMP4_SLEEP_PENDING_CNT_Msk                                            (0xFFFFFFFFUL << AON_REG_GRTC_COMP_4_SLEEP_PENDING_CNT_GRTC_CMP4_SLEEP_PENDING_CNT_Pos)

/* 0xD70    0x4000_0d70
    31:0    R       GRTC_CMP5_SLEEP_PENDING_CNT                                 32'b0
 */
typedef union _AON_REG_GRTC_COMP_5_SLEEP_PENDING_CNT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP5_SLEEP_PENDING_CNT;
    };
} AON_REG_GRTC_COMP_5_SLEEP_PENDING_CNT_TYPE;

/*0x4000_0d70 AON_REG_GRTC_COMP_5_SLEEP_PENDING_CNT*/
#define AON_REG_GRTC_COMP_5_SLEEP_PENDING_CNT_GRTC_CMP5_SLEEP_PENDING_CNT_Pos                                            0U
#define AON_REG_GRTC_COMP_5_SLEEP_PENDING_CNT_GRTC_CMP5_SLEEP_PENDING_CNT_Msk                                            (0xFFFFFFFFUL << AON_REG_GRTC_COMP_5_SLEEP_PENDING_CNT_GRTC_CMP5_SLEEP_PENDING_CNT_Pos)

/* 0xD74    0x4000_0d74
    31:0    R       GRTC_CMP6_SLEEP_PENDING_CNT                                 32'b0
 */
typedef union _AON_REG_GRTC_COMP_6_SLEEP_PENDING_CNT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP6_SLEEP_PENDING_CNT;
    };
} AON_REG_GRTC_COMP_6_SLEEP_PENDING_CNT_TYPE;

/*0x4000_0d74 AON_REG_GRTC_COMP_6_SLEEP_PENDING_CNT*/
#define AON_REG_GRTC_COMP_6_SLEEP_PENDING_CNT_GRTC_CMP6_SLEEP_PENDING_CNT_Pos                                            0U
#define AON_REG_GRTC_COMP_6_SLEEP_PENDING_CNT_GRTC_CMP6_SLEEP_PENDING_CNT_Msk                                            (0xFFFFFFFFUL << AON_REG_GRTC_COMP_6_SLEEP_PENDING_CNT_GRTC_CMP6_SLEEP_PENDING_CNT_Pos)

/* 0xD78    0x4000_0d78
    31:0    R       GRTC_CMP7_SLEEP_PENDING_CNT                                 32'b0
 */
typedef union _AON_REG_GRTC_COMP_7_SLEEP_PENDING_CNT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP7_SLEEP_PENDING_CNT;
    };
} AON_REG_GRTC_COMP_7_SLEEP_PENDING_CNT_TYPE;

/*0x4000_0d78 AON_REG_GRTC_COMP_7_SLEEP_PENDING_CNT*/
#define AON_REG_GRTC_COMP_7_SLEEP_PENDING_CNT_GRTC_CMP7_SLEEP_PENDING_CNT_Pos                                            0U
#define AON_REG_GRTC_COMP_7_SLEEP_PENDING_CNT_GRTC_CMP7_SLEEP_PENDING_CNT_Msk                                            (0xFFFFFFFFUL << AON_REG_GRTC_COMP_7_SLEEP_PENDING_CNT_GRTC_CMP7_SLEEP_PENDING_CNT_Pos)

/* 0xD7C    0x4000_0d7c
    0       R/W     GRTC_CMP0_RAP_MODE                                          1'h0
    1       R/W     GRTC_CMP1_RAP_MODE                                          1'h0
    2       R/W     GRTC_CMP2_RAP_MODE                                          1'h0
    3       R/W     GRTC_CMP3_RAP_MODE                                          1'h0
    4       R/W     GRTC_CMP4_RAP_MODE                                          1'h0
    5       R/W     GRTC_CMP5_RAP_MODE                                          1'h0
    6       R/W     GRTC_CMP6_RAP_MODE                                          1'h0
    7       R/W     GRTC_CMP7_RAP_MODE                                          1'h0
    8       R/WAC   GRTC_FW_TASK_RELOAD_CMP0                                    1'h0
    9       R/WAC   GRTC_FW_TASK_RELOAD_CMP1                                    1'b0
    10      R/WAC   GRTC_FW_TASK_RELOAD_CMP2                                    1'b0
    11      R/WAC   GRTC_FW_TASK_RELOAD_CMP3                                    1'b0
    12      R/WAC   GRTC_FW_TASK_RELOAD_CMP4                                    1'b0
    13      R/WAC   GRTC_FW_TASK_RELOAD_CMP5                                    1'b0
    14      R/WAC   GRTC_FW_TASK_RELOAD_CMP6                                    1'b0
    15      R/WAC   GRTC_FW_TASK_RELOAD_CMP7                                    1'b0
    31:16   R       GRTC_TASK_CTRL_RESERVED31_16                                16'b0
 */
typedef union _AON_REG_GRTC_TASK_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP0_RAP_MODE: 1;
        uint32_t GRTC_CMP1_RAP_MODE: 1;
        uint32_t GRTC_CMP2_RAP_MODE: 1;
        uint32_t GRTC_CMP3_RAP_MODE: 1;
        uint32_t GRTC_CMP4_RAP_MODE: 1;
        uint32_t GRTC_CMP5_RAP_MODE: 1;
        uint32_t GRTC_CMP6_RAP_MODE: 1;
        uint32_t GRTC_CMP7_RAP_MODE: 1;
        uint32_t GRTC_FW_TASK_RELOAD_CMP0: 1;
        uint32_t GRTC_FW_TASK_RELOAD_CMP1: 1;
        uint32_t GRTC_FW_TASK_RELOAD_CMP2: 1;
        uint32_t GRTC_FW_TASK_RELOAD_CMP3: 1;
        uint32_t GRTC_FW_TASK_RELOAD_CMP4: 1;
        uint32_t GRTC_FW_TASK_RELOAD_CMP5: 1;
        uint32_t GRTC_FW_TASK_RELOAD_CMP6: 1;
        uint32_t GRTC_FW_TASK_RELOAD_CMP7: 1;
        uint32_t GRTC_TASK_CTRL_RESERVED31_16: 16;
    };
} AON_REG_GRTC_TASK_CTRL_TYPE;

