rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0d7c AON_REG_GRTC_TASK_CTRL*/
#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP0_RAP_MODE_Pos                                                                    0U
#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP0_RAP_MODE_Msk                                                                    (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_CMP0_RAP_MODE_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP1_RAP_MODE_Pos                                                                    1U
#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP1_RAP_MODE_Msk                                                                    (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_CMP1_RAP_MODE_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP2_RAP_MODE_Pos                                                                    2U
#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP2_RAP_MODE_Msk                                                                    (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_CMP2_RAP_MODE_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP3_RAP_MODE_Pos                                                                    3U
#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP3_RAP_MODE_Msk                                                                    (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_CMP3_RAP_MODE_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP4_RAP_MODE_Pos                                                                    4U
#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP4_RAP_MODE_Msk                                                                    (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_CMP4_RAP_MODE_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP5_RAP_MODE_Pos                                                                    5U
#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP5_RAP_MODE_Msk                                                                    (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_CMP5_RAP_MODE_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP6_RAP_MODE_Pos                                                                    6U
#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP6_RAP_MODE_Msk                                                                    (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_CMP6_RAP_MODE_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP7_RAP_MODE_Pos                                                                    7U
#define AON_REG_GRTC_TASK_CTRL_GRTC_CMP7_RAP_MODE_Msk                                                                    (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_CMP7_RAP_MODE_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP0_Pos                                                              8U
#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP0_Msk                                                              (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP0_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP1_Pos                                                              9U
#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP1_Msk                                                              (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP1_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP2_Pos                                                              10U
#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP2_Msk                                                              (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP2_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP3_Pos                                                              11U
#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP3_Msk                                                              (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP3_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP4_Pos                                                              12U
#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP4_Msk                                                              (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP4_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP5_Pos                                                              13U
#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP5_Msk                                                              (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP5_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP6_Pos                                                              14U
#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP6_Msk                                                              (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP6_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP7_Pos                                                              15U
#define AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP7_Msk                                                              (0x1UL << AON_REG_GRTC_TASK_CTRL_GRTC_FW_TASK_RELOAD_CMP7_Pos)

#define AON_REG_GRTC_TASK_CTRL_GRTC_TASK_CTRL_RESERVED31_16_Pos                                                          16U
#define AON_REG_GRTC_TASK_CTRL_GRTC_TASK_CTRL_RESERVED31_16_Msk                                                          (0xFFFFUL << AON_REG_GRTC_TASK_CTRL_GRTC_TASK_CTRL_RESERVED31_16_Pos)

/* 0xD80    0x4000_0d80
    0       R/W     GRTC_QACT_SCLK_MAN_DATA                                     1'h0
    1       R/W     GRTC_QACT_SCLK_MAN_EN                                       1'h0
    2       R/W     GRTC_QACT_PCLK_MAN_DATA                                     1'h0
    3       R/W     GRTC_QACT_PCLK_MAN_EN                                       1'h0
    7:4     R       GRTC_INTR_CLR_RESERVED7_4                                   4'b0
    8       R/W     GRTC_CMP0_FORCE_QACT_EN                                     1'h0
    9       R/W     GRTC_CMP1_FORCE_QACT_EN                                     1'h0
    10      R/W     GRTC_CMP2_FORCE_QACT_EN                                     1'h0
    11      R/W     GRTC_CMP3_FORCE_QACT_EN                                     1'h0
    12      R/W     GRTC_CMP4_FORCE_QACT_EN                                     1'h0
    13      R/W     GRTC_CMP5_FORCE_QACT_EN                                     1'h0
    14      R/W     GRTC_CMP6_FORCE_QACT_EN                                     1'h0
    15      R/W     GRTC_CMP7_FORCE_QACT_EN                                     1'h0
    31:16   R       GRTC_INTR_CLR_RESERVED31_16                                 16'b0
 */
typedef union _AON_REG_GRTC_QACTIVE_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_QACT_SCLK_MAN_DATA: 1;
        uint32_t GRTC_QACT_SCLK_MAN_EN: 1;
        uint32_t GRTC_QACT_PCLK_MAN_DATA: 1;
        uint32_t GRTC_QACT_PCLK_MAN_EN: 1;
        uint32_t GRTC_INTR_CLR_RESERVED7_4: 4;
        uint32_t GRTC_CMP0_FORCE_QACT_EN: 1;
        uint32_t GRTC_CMP1_FORCE_QACT_EN: 1;
        uint32_t GRTC_CMP2_FORCE_QACT_EN: 1;
        uint32_t GRTC_CMP3_FORCE_QACT_EN: 1;
        uint32_t GRTC_CMP4_FORCE_QACT_EN: 1;
        uint32_t GRTC_CMP5_FORCE_QACT_EN: 1;
        uint32_t GRTC_CMP6_FORCE_QACT_EN: 1;
        uint32_t GRTC_CMP7_FORCE_QACT_EN: 1;
        uint32_t GRTC_INTR_CLR_RESERVED31_16: 16;
    };
} AON_REG_GRTC_QACTIVE_CTRL_TYPE;

/*0x4000_0d80 AON_REG_GRTC_QACTIVE_CTRL*/
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_SCLK_MAN_DATA_Pos                                                            0U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_SCLK_MAN_DATA_Msk                                                            (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_SCLK_MAN_DATA_Pos)

