rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_SCLK_MAN_EN_Pos                                                              1U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_SCLK_MAN_EN_Msk                                                              (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_SCLK_MAN_EN_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_PCLK_MAN_DATA_Pos                                                            2U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_PCLK_MAN_DATA_Msk                                                            (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_PCLK_MAN_DATA_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_PCLK_MAN_EN_Pos                                                              3U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_PCLK_MAN_EN_Msk                                                              (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_QACT_PCLK_MAN_EN_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_INTR_CLR_RESERVED7_4_Pos                                                          4U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_INTR_CLR_RESERVED7_4_Msk                                                          (0xFUL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_INTR_CLR_RESERVED7_4_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP0_FORCE_QACT_EN_Pos                                                            8U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP0_FORCE_QACT_EN_Msk                                                            (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP0_FORCE_QACT_EN_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP1_FORCE_QACT_EN_Pos                                                            9U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP1_FORCE_QACT_EN_Msk                                                            (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP1_FORCE_QACT_EN_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP2_FORCE_QACT_EN_Pos                                                            10U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP2_FORCE_QACT_EN_Msk                                                            (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP2_FORCE_QACT_EN_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP3_FORCE_QACT_EN_Pos                                                            11U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP3_FORCE_QACT_EN_Msk                                                            (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP3_FORCE_QACT_EN_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP4_FORCE_QACT_EN_Pos                                                            12U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP4_FORCE_QACT_EN_Msk                                                            (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP4_FORCE_QACT_EN_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP5_FORCE_QACT_EN_Pos                                                            13U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP5_FORCE_QACT_EN_Msk                                                            (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP5_FORCE_QACT_EN_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP6_FORCE_QACT_EN_Pos                                                            14U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP6_FORCE_QACT_EN_Msk                                                            (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP6_FORCE_QACT_EN_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP7_FORCE_QACT_EN_Pos                                                            15U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP7_FORCE_QACT_EN_Msk                                                            (0x1UL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_CMP7_FORCE_QACT_EN_Pos)

#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_INTR_CLR_RESERVED31_16_Pos                                                        16U
#define AON_REG_GRTC_QACTIVE_CTRL_GRTC_INTR_CLR_RESERVED31_16_Msk                                                        (0xFFFFUL << AON_REG_GRTC_QACTIVE_CTRL_GRTC_INTR_CLR_RESERVED31_16_Pos)

/* 0xD84    0x4000_0d84
    31:0    R       GRTC_RTL_VERSION                                            32'h20240930
 */
typedef union _AON_REG_GRTC_RTL_VERSION_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_RTL_VERSION;
    };
} AON_REG_GRTC_RTL_VERSION_TYPE;

/*0x4000_0d84 AON_REG_GRTC_RTL_VERSION*/
#define AON_REG_GRTC_RTL_VERSION_GRTC_RTL_VERSION_Pos                                                                    0U
#define AON_REG_GRTC_RTL_VERSION_GRTC_RTL_VERSION_Msk                                                                    (0xFFFFFFFFUL << AON_REG_GRTC_RTL_VERSION_GRTC_RTL_VERSION_Pos)

/* 0xD88    0x4000_0d88
    0       R       GRTC_CMP0_TIMEOUT_OV_ERR_SR                                 1'b0
    1       R       GRTC_CMP1_TIMEOUT_OV_ERR_SR                                 1'b0
    2       R       GRTC_CMP2_TIMEOUT_OV_ERR_SR                                 1'b0
    3       R       GRTC_CMP3_TIMEOUT_OV_ERR_SR                                 1'b0
    4       R       GRTC_CMP4_TIMEOUT_OV_ERR_SR                                 1'b0
    5       R       GRTC_CMP5_TIMEOUT_OV_ERR_SR                                 1'b0
    6       R       GRTC_CMP6_TIMEOUT_OV_ERR_SR                                 1'b0
    7       R       GRTC_CMP7_TIMEOUT_OV_ERR_SR                                 1'b0
    31:8    R       GRTC_COMP_TIMEOUT_OV_ERR_SR_RESERVED31_8                    24'b0
 */
typedef union _AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP0_TIMEOUT_OV_ERR_SR: 1;
        uint32_t GRTC_CMP1_TIMEOUT_OV_ERR_SR: 1;
        uint32_t GRTC_CMP2_TIMEOUT_OV_ERR_SR: 1;
        uint32_t GRTC_CMP3_TIMEOUT_OV_ERR_SR: 1;
        uint32_t GRTC_CMP4_TIMEOUT_OV_ERR_SR: 1;
        uint32_t GRTC_CMP5_TIMEOUT_OV_ERR_SR: 1;
        uint32_t GRTC_CMP6_TIMEOUT_OV_ERR_SR: 1;
        uint32_t GRTC_CMP7_TIMEOUT_OV_ERR_SR: 1;
        uint32_t GRTC_COMP_TIMEOUT_OV_ERR_SR_RESERVED31_8: 24;
    };
} AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_TYPE;

