rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
/*0x4000_0d88 AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR*/
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP0_TIMEOUT_OV_ERR_SR_Pos                                              0U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP0_TIMEOUT_OV_ERR_SR_Msk                                              (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP0_TIMEOUT_OV_ERR_SR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP1_TIMEOUT_OV_ERR_SR_Pos                                              1U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP1_TIMEOUT_OV_ERR_SR_Msk                                              (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP1_TIMEOUT_OV_ERR_SR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP2_TIMEOUT_OV_ERR_SR_Pos                                              2U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP2_TIMEOUT_OV_ERR_SR_Msk                                              (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP2_TIMEOUT_OV_ERR_SR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP3_TIMEOUT_OV_ERR_SR_Pos                                              3U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP3_TIMEOUT_OV_ERR_SR_Msk                                              (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP3_TIMEOUT_OV_ERR_SR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP4_TIMEOUT_OV_ERR_SR_Pos                                              4U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP4_TIMEOUT_OV_ERR_SR_Msk                                              (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP4_TIMEOUT_OV_ERR_SR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP5_TIMEOUT_OV_ERR_SR_Pos                                              5U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP5_TIMEOUT_OV_ERR_SR_Msk                                              (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP5_TIMEOUT_OV_ERR_SR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP6_TIMEOUT_OV_ERR_SR_Pos                                              6U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP6_TIMEOUT_OV_ERR_SR_Msk                                              (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP6_TIMEOUT_OV_ERR_SR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP7_TIMEOUT_OV_ERR_SR_Pos                                              7U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP7_TIMEOUT_OV_ERR_SR_Msk                                              (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_CMP7_TIMEOUT_OV_ERR_SR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_COMP_TIMEOUT_OV_ERR_SR_RESERVED31_8_Pos                                 8U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_COMP_TIMEOUT_OV_ERR_SR_RESERVED31_8_Msk                                 (0xFFFFFFUL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_SR_GRTC_COMP_TIMEOUT_OV_ERR_SR_RESERVED31_8_Pos)

/* 0xD8C    0x4000_0d8c
    0       R/WAC   GRTC_CMP0_TIMEOUT_OV_ERR_CLR                                1'b0
    1       R/WAC   GRTC_CMP1_TIMEOUT_OV_ERR_CLR                                1'b0
    2       R/WAC   GRTC_CMP2_TIMEOUT_OV_ERR_CLR                                1'b0
    3       R/WAC   GRTC_CMP3_TIMEOUT_OV_ERR_CLR                                1'b0
    4       R/WAC   GRTC_CMP4_TIMEOUT_OV_ERR_CLR                                1'b0
    5       R/WAC   GRTC_CMP5_TIMEOUT_OV_ERR_CLR                                1'b0
    6       R/WAC   GRTC_CMP6_TIMEOUT_OV_ERR_CLR                                1'b0
    7       R/WAC   GRTC_CMP7_TIMEOUT_OV_ERR_CLR                                1'b0
    31:8    R       GRTC_COMP_TIMEOUT_OV_ERR_CLR_RESERVED31_8                   24'b0
 */
typedef union _AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t GRTC_CMP0_TIMEOUT_OV_ERR_CLR: 1;
        uint32_t GRTC_CMP1_TIMEOUT_OV_ERR_CLR: 1;
        uint32_t GRTC_CMP2_TIMEOUT_OV_ERR_CLR: 1;
        uint32_t GRTC_CMP3_TIMEOUT_OV_ERR_CLR: 1;
        uint32_t GRTC_CMP4_TIMEOUT_OV_ERR_CLR: 1;
        uint32_t GRTC_CMP5_TIMEOUT_OV_ERR_CLR: 1;
        uint32_t GRTC_CMP6_TIMEOUT_OV_ERR_CLR: 1;
        uint32_t GRTC_CMP7_TIMEOUT_OV_ERR_CLR: 1;
        uint32_t GRTC_COMP_TIMEOUT_OV_ERR_CLR_RESERVED31_8: 24;
    };
} AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_TYPE;

/*0x4000_0d8c AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR*/
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP0_TIMEOUT_OV_ERR_CLR_Pos                                            0U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP0_TIMEOUT_OV_ERR_CLR_Msk                                            (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP0_TIMEOUT_OV_ERR_CLR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP1_TIMEOUT_OV_ERR_CLR_Pos                                            1U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP1_TIMEOUT_OV_ERR_CLR_Msk                                            (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP1_TIMEOUT_OV_ERR_CLR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP2_TIMEOUT_OV_ERR_CLR_Pos                                            2U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP2_TIMEOUT_OV_ERR_CLR_Msk                                            (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP2_TIMEOUT_OV_ERR_CLR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP3_TIMEOUT_OV_ERR_CLR_Pos                                            3U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP3_TIMEOUT_OV_ERR_CLR_Msk                                            (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP3_TIMEOUT_OV_ERR_CLR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP4_TIMEOUT_OV_ERR_CLR_Pos                                            4U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP4_TIMEOUT_OV_ERR_CLR_Msk                                            (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP4_TIMEOUT_OV_ERR_CLR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP5_TIMEOUT_OV_ERR_CLR_Pos                                            5U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP5_TIMEOUT_OV_ERR_CLR_Msk                                            (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP5_TIMEOUT_OV_ERR_CLR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP6_TIMEOUT_OV_ERR_CLR_Pos                                            6U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP6_TIMEOUT_OV_ERR_CLR_Msk                                            (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP6_TIMEOUT_OV_ERR_CLR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP7_TIMEOUT_OV_ERR_CLR_Pos                                            7U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP7_TIMEOUT_OV_ERR_CLR_Msk                                            (0x1UL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_CMP7_TIMEOUT_OV_ERR_CLR_Pos)

#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_COMP_TIMEOUT_OV_ERR_CLR_RESERVED31_8_Pos                               8U
#define AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_COMP_TIMEOUT_OV_ERR_CLR_RESERVED31_8_Msk                               (0xFFFFFFUL << AON_REG_GRTC_COMP_TIMEOUT_OV_ERR_CLR_GRTC_COMP_TIMEOUT_OV_ERR_CLR_RESERVED31_8_Pos)

/* 0xDB4    0x4000_0db4
    0       R/W     OSC80M_CAL_RESET_N                                          1'b1
    1       R/W     OSC80M_CAL_SW_LIN_CAL_EN                                    1'b0
    2       R/W     OSC80M_CAL_REG0X_DUMMY1                                     1'b0
    3       R/W     OSC80M_CAL_TMETER_MODE                                      1'b0
    4       R/W     OSC80M_CAL_REG0X_DUMMY0                                     1'b0
    6:5     R/W     OSC80M_CAL_DBG_SEL                                          2'b00
    31:7    R       RSVD                                                        25'b0
 */
typedef union _AON_REG0X_OSC80M_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC80M_CAL_RESET_N: 1;
        uint32_t OSC80M_CAL_SW_LIN_CAL_EN: 1;
        uint32_t OSC80M_CAL_REG0X_DUMMY1: 1;
        uint32_t OSC80M_CAL_TMETER_MODE: 1;
        uint32_t OSC80M_CAL_REG0X_DUMMY0: 1;
        uint32_t OSC80M_CAL_DBG_SEL: 2;
        uint32_t RSVD: 25;
    };
} AON_REG0X_OSC80M_CAL_TYPE;

