rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG4X_OSC80M_CAL_OSC80M_CAL_LIN_K_CNT_CYC_Pos                                                                18U
#define AON_REG4X_OSC80M_CAL_OSC80M_CAL_LIN_K_CNT_CYC_Msk                                                                (0x1FUL << AON_REG4X_OSC80M_CAL_OSC80M_CAL_LIN_K_CNT_CYC_Pos)

#define AON_REG4X_OSC80M_CAL_RSVD_Pos                                                                                    23U
#define AON_REG4X_OSC80M_CAL_RSVD_Msk                                                                                    (0x1FFUL << AON_REG4X_OSC80M_CAL_RSVD_Pos)

/* 0xDC0    0x4000_0dc0
    6:0     R/W     OSC80M_CAL_CRITER0                                          7'd4
    22:7    R       RSVD                                                        16'b0
    30:23   R/W     OSC80M_CAL_RCAL_INIT                                        8'd13
    31      R/W     OSC80M_CAL_TEST_MODE                                        1'h0
 */
typedef union _AON_REG6X_OSC80M_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC80M_CAL_CRITER0: 7;
        uint32_t RSVD: 16;
        uint32_t OSC80M_CAL_RCAL_INIT: 8;
        uint32_t OSC80M_CAL_TEST_MODE: 1;
    };
} AON_REG6X_OSC80M_CAL_TYPE;

/*0x4000_0dc0 AON_REG6X_OSC80M_CAL*/
#define AON_REG6X_OSC80M_CAL_OSC80M_CAL_CRITER0_Pos                                                                      0U
#define AON_REG6X_OSC80M_CAL_OSC80M_CAL_CRITER0_Msk                                                                      (0x7FUL << AON_REG6X_OSC80M_CAL_OSC80M_CAL_CRITER0_Pos)

#define AON_REG6X_OSC80M_CAL_RSVD_Pos                                                                                    7U
#define AON_REG6X_OSC80M_CAL_RSVD_Msk                                                                                    (0xFFFFUL << AON_REG6X_OSC80M_CAL_RSVD_Pos)

#define AON_REG6X_OSC80M_CAL_OSC80M_CAL_RCAL_INIT_Pos                                                                    23U
#define AON_REG6X_OSC80M_CAL_OSC80M_CAL_RCAL_INIT_Msk                                                                    (0xFFUL << AON_REG6X_OSC80M_CAL_OSC80M_CAL_RCAL_INIT_Pos)

#define AON_REG6X_OSC80M_CAL_OSC80M_CAL_TEST_MODE_Pos                                                                    31U
#define AON_REG6X_OSC80M_CAL_OSC80M_CAL_TEST_MODE_Msk                                                                    (0x1UL << AON_REG6X_OSC80M_CAL_OSC80M_CAL_TEST_MODE_Pos)

/* 0xDC4    0x4000_0dc4
    14:0    R       OSC80M_CAL_RCAL_O                                           15'h80
    15      R       RSVD_1                                                      1'h0
    21:16   R       OSC80M_CAL_KT_CNT                                           6'h0
    23:22   R       OSC80M_CAL_LOCK                                             2'h0
    31:24   R       RSVD                                                        8'h0
 */
typedef union _AON_REG8X_OSC80M_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC80M_CAL_RCAL_O: 15;
        uint32_t RSVD_1: 1;
        uint32_t OSC80M_CAL_KT_CNT: 6;
        uint32_t OSC80M_CAL_LOCK: 2;
        uint32_t RSVD: 8;
    };
} AON_REG8X_OSC80M_CAL_TYPE;

/*0x4000_0dc4 AON_REG8X_OSC80M_CAL*/
#define AON_REG8X_OSC80M_CAL_OSC80M_CAL_RCAL_O_Pos                                                                       0U
#define AON_REG8X_OSC80M_CAL_OSC80M_CAL_RCAL_O_Msk                                                                       (0x7FFFUL << AON_REG8X_OSC80M_CAL_OSC80M_CAL_RCAL_O_Pos)

#define AON_REG8X_OSC80M_CAL_RSVD_1_Pos                                                                                  15U
#define AON_REG8X_OSC80M_CAL_RSVD_1_Msk                                                                                  (0x1UL << AON_REG8X_OSC80M_CAL_RSVD_1_Pos)

#define AON_REG8X_OSC80M_CAL_OSC80M_CAL_KT_CNT_Pos                                                                       16U
#define AON_REG8X_OSC80M_CAL_OSC80M_CAL_KT_CNT_Msk                                                                       (0x3FUL << AON_REG8X_OSC80M_CAL_OSC80M_CAL_KT_CNT_Pos)

#define AON_REG8X_OSC80M_CAL_OSC80M_CAL_LOCK_Pos                                                                         22U
#define AON_REG8X_OSC80M_CAL_OSC80M_CAL_LOCK_Msk                                                                         (0x3UL << AON_REG8X_OSC80M_CAL_OSC80M_CAL_LOCK_Pos)

#define AON_REG8X_OSC80M_CAL_RSVD_Pos                                                                                    24U
#define AON_REG8X_OSC80M_CAL_RSVD_Msk                                                                                    (0xFFUL << AON_REG8X_OSC80M_CAL_RSVD_Pos)

/* 0xDC8    0x4000_0dc8
    12:0    R       OSC80M_CAL_LIN_CNT_FREF_REP_1                               13'h0
    25:13   R       OSC80M_CAL_LIN_CNT_FREF_REP_0                               13'h0
    31:26   R       RSVD                                                        6'h0
 */
typedef union _AON_REG10X_OSC80M_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC80M_CAL_LIN_CNT_FREF_REP_1: 13;
        uint32_t OSC80M_CAL_LIN_CNT_FREF_REP_0: 13;
        uint32_t RSVD: 6;
    };
} AON_REG10X_OSC80M_CAL_TYPE;

/*0x4000_0dc8 AON_REG10X_OSC80M_CAL*/
#define AON_REG10X_OSC80M_CAL_OSC80M_CAL_LIN_CNT_FREF_REP_1_Pos                                                          0U
#define AON_REG10X_OSC80M_CAL_OSC80M_CAL_LIN_CNT_FREF_REP_1_Msk                                                          (0x1FFFUL << AON_REG10X_OSC80M_CAL_OSC80M_CAL_LIN_CNT_FREF_REP_1_Pos)

#define AON_REG10X_OSC80M_CAL_OSC80M_CAL_LIN_CNT_FREF_REP_0_Pos                                                          13U
#define AON_REG10X_OSC80M_CAL_OSC80M_CAL_LIN_CNT_FREF_REP_0_Msk                                                          (0x1FFFUL << AON_REG10X_OSC80M_CAL_OSC80M_CAL_LIN_CNT_FREF_REP_0_Pos)

#define AON_REG10X_OSC80M_CAL_RSVD_Pos                                                                                   26U
#define AON_REG10X_OSC80M_CAL_RSVD_Msk                                                                                   (0x3FUL << AON_REG10X_OSC80M_CAL_RSVD_Pos)

/* 0xDCC    0x4000_0dcc
    0       R/W     OSC80M_CAL_RAP_MODE                                         1'h0
    31:1    R       RSVD                                                        31'b0
 */
typedef union _AON_REG_OSC80M_CAL_RAP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC80M_CAL_RAP_MODE: 1;
        uint32_t RSVD: 31;
    };
} AON_REG_OSC80M_CAL_RAP_TYPE;

/*0x4000_0dcc AON_REG_OSC80M_CAL_RAP*/
#define AON_REG_OSC80M_CAL_RAP_OSC80M_CAL_RAP_MODE_Pos                                                                   0U
#define AON_REG_OSC80M_CAL_RAP_OSC80M_CAL_RAP_MODE_Msk                                                                   (0x1UL << AON_REG_OSC80M_CAL_RAP_OSC80M_CAL_RAP_MODE_Pos)

