rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_OSC80M_CAL_RAP_RSVD_Pos                                                                                  1U
#define AON_REG_OSC80M_CAL_RAP_RSVD_Msk                                                                                  (0x7FFFFFFFUL << AON_REG_OSC80M_CAL_RAP_RSVD_Pos)

/* 0xDD0    0x4000_0dd0
    0       R/W     OSC80M_CAL_CLK_QACTIVE_MAN_DATA                             1'h0
    1       R/W     OSC80M_CAL_CLK_QACTIVE_MAN_EN                               1'h0
    31:2    R       RSVD                                                        30'b0
 */
typedef union _AON_REG_OSC80M_CAL_QCH_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC80M_CAL_CLK_QACTIVE_MAN_DATA: 1;
        uint32_t OSC80M_CAL_CLK_QACTIVE_MAN_EN: 1;
        uint32_t RSVD: 30;
    };
} AON_REG_OSC80M_CAL_QCH_TYPE;

/*0x4000_0dd0 AON_REG_OSC80M_CAL_QCH*/
#define AON_REG_OSC80M_CAL_QCH_OSC80M_CAL_CLK_QACTIVE_MAN_DATA_Pos                                                       0U
#define AON_REG_OSC80M_CAL_QCH_OSC80M_CAL_CLK_QACTIVE_MAN_DATA_Msk                                                       (0x1UL << AON_REG_OSC80M_CAL_QCH_OSC80M_CAL_CLK_QACTIVE_MAN_DATA_Pos)

#define AON_REG_OSC80M_CAL_QCH_OSC80M_CAL_CLK_QACTIVE_MAN_EN_Pos                                                         1U
#define AON_REG_OSC80M_CAL_QCH_OSC80M_CAL_CLK_QACTIVE_MAN_EN_Msk                                                         (0x1UL << AON_REG_OSC80M_CAL_QCH_OSC80M_CAL_CLK_QACTIVE_MAN_EN_Pos)

#define AON_REG_OSC80M_CAL_QCH_RSVD_Pos                                                                                  2U
#define AON_REG_OSC80M_CAL_QCH_RSVD_Msk                                                                                  (0x3FFFFFFFUL << AON_REG_OSC80M_CAL_QCH_RSVD_Pos)

/* 0xDF0    0x4000_0df0
    0       R/W     OSC10M_CAL_RESET_N                                          1'b1
    1       R/W     OSC10M_CAL_SW_LIN_CAL_EN                                    1'b0
    2       R/W     OSC10M_CAL_REG0X_DUMMY1                                     1'b0
    3       R/W     OSC10M_CAL_TMETER_MODE                                      1'b0
    4       R/W     OSC10M_CAL_REG0X_DUMMY0                                     1'b0
    6:5     R/W     OSC10M_CAL_DBG_SEL                                          2'b00
    31:7    R       RSVD                                                        25'b0
 */
typedef union _AON_REG0X_OSC10M_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC10M_CAL_RESET_N: 1;
        uint32_t OSC10M_CAL_SW_LIN_CAL_EN: 1;
        uint32_t OSC10M_CAL_REG0X_DUMMY1: 1;
        uint32_t OSC10M_CAL_TMETER_MODE: 1;
        uint32_t OSC10M_CAL_REG0X_DUMMY0: 1;
        uint32_t OSC10M_CAL_DBG_SEL: 2;
        uint32_t RSVD: 25;
    };
} AON_REG0X_OSC10M_CAL_TYPE;

/*0x4000_0df0 AON_REG0X_OSC10M_CAL*/
#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_RESET_N_Pos                                                                      0U
#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_RESET_N_Msk                                                                      (0x1UL << AON_REG0X_OSC10M_CAL_OSC10M_CAL_RESET_N_Pos)

#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_SW_LIN_CAL_EN_Pos                                                                1U
#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_SW_LIN_CAL_EN_Msk                                                                (0x1UL << AON_REG0X_OSC10M_CAL_OSC10M_CAL_SW_LIN_CAL_EN_Pos)

#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_REG0X_DUMMY1_Pos                                                                 2U
#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_REG0X_DUMMY1_Msk                                                                 (0x1UL << AON_REG0X_OSC10M_CAL_OSC10M_CAL_REG0X_DUMMY1_Pos)

#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_TMETER_MODE_Pos                                                                  3U
#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_TMETER_MODE_Msk                                                                  (0x1UL << AON_REG0X_OSC10M_CAL_OSC10M_CAL_TMETER_MODE_Pos)

#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_REG0X_DUMMY0_Pos                                                                 4U
#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_REG0X_DUMMY0_Msk                                                                 (0x1UL << AON_REG0X_OSC10M_CAL_OSC10M_CAL_REG0X_DUMMY0_Pos)

#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_DBG_SEL_Pos                                                                      5U
#define AON_REG0X_OSC10M_CAL_OSC10M_CAL_DBG_SEL_Msk                                                                      (0x3UL << AON_REG0X_OSC10M_CAL_OSC10M_CAL_DBG_SEL_Pos)

#define AON_REG0X_OSC10M_CAL_RSVD_Pos                                                                                    7U
#define AON_REG0X_OSC10M_CAL_RSVD_Msk                                                                                    (0x1FFFFFFUL << AON_REG0X_OSC10M_CAL_RSVD_Pos)

/* 0xDF4    0x4000_0df4
    3:0     R/W     OSC10M_CAL_RCAL_H                                           4'h7
    7:4     R/W     OSC10M_CAL_RCAL_SETTLE_CYC                                  4'h2
    8       R       RSVD_1                                                      1'b0
    12:9    R/W     OSC10M_CAL_INC_STEP                                         4'h4
    18:13   R/W     OSC10M_CAL_KT_LIM                                           6'h30
    22:19   R/W     OSC10M_CAL_DELTA_RCAL_H                                     4'd8
    31:23   R       RSVD                                                        9'b0
 */
typedef union _AON_REG2X_OSC10M_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC10M_CAL_RCAL_H: 4;
        uint32_t OSC10M_CAL_RCAL_SETTLE_CYC: 4;
        uint32_t RSVD_1: 1;
        uint32_t OSC10M_CAL_INC_STEP: 4;
        uint32_t OSC10M_CAL_KT_LIM: 6;
        uint32_t OSC10M_CAL_DELTA_RCAL_H: 4;
        uint32_t RSVD: 9;
    };
} AON_REG2X_OSC10M_CAL_TYPE;

/*0x4000_0df4 AON_REG2X_OSC10M_CAL*/
#define AON_REG2X_OSC10M_CAL_OSC10M_CAL_RCAL_H_Pos                                                                       0U
#define AON_REG2X_OSC10M_CAL_OSC10M_CAL_RCAL_H_Msk                                                                       (0xFUL << AON_REG2X_OSC10M_CAL_OSC10M_CAL_RCAL_H_Pos)

#define AON_REG2X_OSC10M_CAL_OSC10M_CAL_RCAL_SETTLE_CYC_Pos                                                              4U
#define AON_REG2X_OSC10M_CAL_OSC10M_CAL_RCAL_SETTLE_CYC_Msk                                                              (0xFUL << AON_REG2X_OSC10M_CAL_OSC10M_CAL_RCAL_SETTLE_CYC_Pos)

#define AON_REG2X_OSC10M_CAL_RSVD_1_Pos                                                                                  8U
#define AON_REG2X_OSC10M_CAL_RSVD_1_Msk                                                                                  (0x1UL << AON_REG2X_OSC10M_CAL_RSVD_1_Pos)

#define AON_REG2X_OSC10M_CAL_OSC10M_CAL_INC_STEP_Pos                                                                     9U
#define AON_REG2X_OSC10M_CAL_OSC10M_CAL_INC_STEP_Msk                                                                     (0xFUL << AON_REG2X_OSC10M_CAL_OSC10M_CAL_INC_STEP_Pos)

#define AON_REG2X_OSC10M_CAL_OSC10M_CAL_KT_LIM_Pos                                                                       13U
#define AON_REG2X_OSC10M_CAL_OSC10M_CAL_KT_LIM_Msk                                                                       (0x3FUL << AON_REG2X_OSC10M_CAL_OSC10M_CAL_KT_LIM_Pos)

#define AON_REG2X_OSC10M_CAL_OSC10M_CAL_DELTA_RCAL_H_Pos                                                                 19U
#define AON_REG2X_OSC10M_CAL_OSC10M_CAL_DELTA_RCAL_H_Msk                                                                 (0xFUL << AON_REG2X_OSC10M_CAL_OSC10M_CAL_DELTA_RCAL_H_Pos)

#define AON_REG2X_OSC10M_CAL_RSVD_Pos                                                                                    23U
#define AON_REG2X_OSC10M_CAL_RSVD_Msk                                                                                    (0x1FFUL << AON_REG2X_OSC10M_CAL_RSVD_Pos)

/* 0xDF8    0x4000_0df8
    10:0    R/W     OSC10M_CAL_CENTER_CNT_FREF                                  11'd128
    17:11   R       RSVD_1                                                      7'b0
    22:18   R/W     OSC10M_CAL_LIN_K_CNT_CYC                                    5'h3
    31:23   R/W     RSVD                                                        9'h0
 */
typedef union _AON_REG4X_OSC10M_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC10M_CAL_CENTER_CNT_FREF: 11;
        uint32_t RSVD_1: 7;
        uint32_t OSC10M_CAL_LIN_K_CNT_CYC: 5;
        uint32_t RSVD: 9;
    };
} AON_REG4X_OSC10M_CAL_TYPE;

/*0x4000_0df8 AON_REG4X_OSC10M_CAL*/
#define AON_REG4X_OSC10M_CAL_OSC10M_CAL_CENTER_CNT_FREF_Pos                                                              0U
#define AON_REG4X_OSC10M_CAL_OSC10M_CAL_CENTER_CNT_FREF_Msk                                                              (0x7FFUL << AON_REG4X_OSC10M_CAL_OSC10M_CAL_CENTER_CNT_FREF_Pos)

#define AON_REG4X_OSC10M_CAL_RSVD_1_Pos                                                                                  11U
#define AON_REG4X_OSC10M_CAL_RSVD_1_Msk                                                                                  (0x7FUL << AON_REG4X_OSC10M_CAL_RSVD_1_Pos)

#define AON_REG4X_OSC10M_CAL_OSC10M_CAL_LIN_K_CNT_CYC_Pos                                                                18U
#define AON_REG4X_OSC10M_CAL_OSC10M_CAL_LIN_K_CNT_CYC_Msk                                                                (0x1FUL << AON_REG4X_OSC10M_CAL_OSC10M_CAL_LIN_K_CNT_CYC_Pos)

#define AON_REG4X_OSC10M_CAL_RSVD_Pos                                                                                    23U
#define AON_REG4X_OSC10M_CAL_RSVD_Msk                                                                                    (0x1FFUL << AON_REG4X_OSC10M_CAL_RSVD_Pos)

/* 0xDFC    0x4000_0dfc
    6:0     R/W     OSC10M_CAL_CRITER0                                          7'd6
    22:7    R       RSVD                                                        16'b0
    30:23   R/W     OSC10M_CAL_RCAL_INIT                                        8'd24
    31      R/W     OSC10M_CAL_TEST_MODE                                        1'h0
 */
typedef union _AON_REG6X_OSC10M_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC10M_CAL_CRITER0: 7;
        uint32_t RSVD: 16;
        uint32_t OSC10M_CAL_RCAL_INIT: 8;
        uint32_t OSC10M_CAL_TEST_MODE: 1;
    };
} AON_REG6X_OSC10M_CAL_TYPE;

/*0x4000_0dfc AON_REG6X_OSC10M_CAL*/
#define AON_REG6X_OSC10M_CAL_OSC10M_CAL_CRITER0_Pos                                                                      0U
#define AON_REG6X_OSC10M_CAL_OSC10M_CAL_CRITER0_Msk                                                                      (0x7FUL << AON_REG6X_OSC10M_CAL_OSC10M_CAL_CRITER0_Pos)

