rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG6X_OSC10M_CAL_RSVD_Pos                                                                                    7U
#define AON_REG6X_OSC10M_CAL_RSVD_Msk                                                                                    (0xFFFFUL << AON_REG6X_OSC10M_CAL_RSVD_Pos)

#define AON_REG6X_OSC10M_CAL_OSC10M_CAL_RCAL_INIT_Pos                                                                    23U
#define AON_REG6X_OSC10M_CAL_OSC10M_CAL_RCAL_INIT_Msk                                                                    (0xFFUL << AON_REG6X_OSC10M_CAL_OSC10M_CAL_RCAL_INIT_Pos)

#define AON_REG6X_OSC10M_CAL_OSC10M_CAL_TEST_MODE_Pos                                                                    31U
#define AON_REG6X_OSC10M_CAL_OSC10M_CAL_TEST_MODE_Msk                                                                    (0x1UL << AON_REG6X_OSC10M_CAL_OSC10M_CAL_TEST_MODE_Pos)

/* 0xE00    0x4000_0e00
    14:0    R       OSC10M_CAL_RCAL_O                                           15'h80
    15      R       RSVD_1                                                      1'h0
    21:16   R       OSC10M_CAL_KT_CNT                                           6'h0
    23:22   R       OSC10M_CAL_LOCK                                             2'h0
    31:24   R       RSVD                                                        8'h0
 */
typedef union _AON_REG8X_OSC10M_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC10M_CAL_RCAL_O: 15;
        uint32_t RSVD_1: 1;
        uint32_t OSC10M_CAL_KT_CNT: 6;
        uint32_t OSC10M_CAL_LOCK: 2;
        uint32_t RSVD: 8;
    };
} AON_REG8X_OSC10M_CAL_TYPE;

/*0x4000_0e00 AON_REG8X_OSC10M_CAL*/
#define AON_REG8X_OSC10M_CAL_OSC10M_CAL_RCAL_O_Pos                                                                       0U
#define AON_REG8X_OSC10M_CAL_OSC10M_CAL_RCAL_O_Msk                                                                       (0x7FFFUL << AON_REG8X_OSC10M_CAL_OSC10M_CAL_RCAL_O_Pos)

#define AON_REG8X_OSC10M_CAL_RSVD_1_Pos                                                                                  15U
#define AON_REG8X_OSC10M_CAL_RSVD_1_Msk                                                                                  (0x1UL << AON_REG8X_OSC10M_CAL_RSVD_1_Pos)

#define AON_REG8X_OSC10M_CAL_OSC10M_CAL_KT_CNT_Pos                                                                       16U
#define AON_REG8X_OSC10M_CAL_OSC10M_CAL_KT_CNT_Msk                                                                       (0x3FUL << AON_REG8X_OSC10M_CAL_OSC10M_CAL_KT_CNT_Pos)

#define AON_REG8X_OSC10M_CAL_OSC10M_CAL_LOCK_Pos                                                                         22U
#define AON_REG8X_OSC10M_CAL_OSC10M_CAL_LOCK_Msk                                                                         (0x3UL << AON_REG8X_OSC10M_CAL_OSC10M_CAL_LOCK_Pos)

#define AON_REG8X_OSC10M_CAL_RSVD_Pos                                                                                    24U
#define AON_REG8X_OSC10M_CAL_RSVD_Msk                                                                                    (0xFFUL << AON_REG8X_OSC10M_CAL_RSVD_Pos)

/* 0xE04    0x4000_0e04
    12:0    R       OSC10M_CAL_LIN_CNT_FREF_REP_1                               13'h0
    25:13   R       OSC10M_CAL_LIN_CNT_FREF_REP_0                               13'h0
    31:26   R       RSVD                                                        6'h0
 */
typedef union _AON_REG10X_OSC10M_CAL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC10M_CAL_LIN_CNT_FREF_REP_1: 13;
        uint32_t OSC10M_CAL_LIN_CNT_FREF_REP_0: 13;
        uint32_t RSVD: 6;
    };
} AON_REG10X_OSC10M_CAL_TYPE;

/*0x4000_0e04 AON_REG10X_OSC10M_CAL*/
#define AON_REG10X_OSC10M_CAL_OSC10M_CAL_LIN_CNT_FREF_REP_1_Pos                                                          0U
#define AON_REG10X_OSC10M_CAL_OSC10M_CAL_LIN_CNT_FREF_REP_1_Msk                                                          (0x1FFFUL << AON_REG10X_OSC10M_CAL_OSC10M_CAL_LIN_CNT_FREF_REP_1_Pos)

#define AON_REG10X_OSC10M_CAL_OSC10M_CAL_LIN_CNT_FREF_REP_0_Pos                                                          13U
#define AON_REG10X_OSC10M_CAL_OSC10M_CAL_LIN_CNT_FREF_REP_0_Msk                                                          (0x1FFFUL << AON_REG10X_OSC10M_CAL_OSC10M_CAL_LIN_CNT_FREF_REP_0_Pos)

#define AON_REG10X_OSC10M_CAL_RSVD_Pos                                                                                   26U
#define AON_REG10X_OSC10M_CAL_RSVD_Msk                                                                                   (0x3FUL << AON_REG10X_OSC10M_CAL_RSVD_Pos)

/* 0xE08    0x4000_0e08
    0       R/W     OSC10M_CAL_RAP_MODE                                         1'h0
    31:1    R       RSVD                                                        31'b0
 */
typedef union _AON_REG_OSC10M_CAL_RAP_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC10M_CAL_RAP_MODE: 1;
        uint32_t RSVD: 31;
    };
} AON_REG_OSC10M_CAL_RAP_TYPE;

/*0x4000_0e08 AON_REG_OSC10M_CAL_RAP*/
#define AON_REG_OSC10M_CAL_RAP_OSC10M_CAL_RAP_MODE_Pos                                                                   0U
#define AON_REG_OSC10M_CAL_RAP_OSC10M_CAL_RAP_MODE_Msk                                                                   (0x1UL << AON_REG_OSC10M_CAL_RAP_OSC10M_CAL_RAP_MODE_Pos)

#define AON_REG_OSC10M_CAL_RAP_RSVD_Pos                                                                                  1U
#define AON_REG_OSC10M_CAL_RAP_RSVD_Msk                                                                                  (0x7FFFFFFFUL << AON_REG_OSC10M_CAL_RAP_RSVD_Pos)

/* 0xE0C    0x4000_0e0c
    0       R/W     OSC10M_CAL_CLK_QACTIVE_MAN_DATA                             1'h0
    1       R/W     OSC10M_CAL_CLK_QACTIVE_MAN_EN                               1'h0
    31:2    R       RSVD                                                        30'b0
 */
typedef union _AON_REG_OSC10M_CAL_QCH_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OSC10M_CAL_CLK_QACTIVE_MAN_DATA: 1;
        uint32_t OSC10M_CAL_CLK_QACTIVE_MAN_EN: 1;
        uint32_t RSVD: 30;
    };
} AON_REG_OSC10M_CAL_QCH_TYPE;

/*0x4000_0e0c AON_REG_OSC10M_CAL_QCH*/
#define AON_REG_OSC10M_CAL_QCH_OSC10M_CAL_CLK_QACTIVE_MAN_DATA_Pos                                                       0U
#define AON_REG_OSC10M_CAL_QCH_OSC10M_CAL_CLK_QACTIVE_MAN_DATA_Msk                                                       (0x1UL << AON_REG_OSC10M_CAL_QCH_OSC10M_CAL_CLK_QACTIVE_MAN_DATA_Pos)

#define AON_REG_OSC10M_CAL_QCH_OSC10M_CAL_CLK_QACTIVE_MAN_EN_Pos                                                         1U
#define AON_REG_OSC10M_CAL_QCH_OSC10M_CAL_CLK_QACTIVE_MAN_EN_Msk                                                         (0x1UL << AON_REG_OSC10M_CAL_QCH_OSC10M_CAL_CLK_QACTIVE_MAN_EN_Pos)

#define AON_REG_OSC10M_CAL_QCH_RSVD_Pos                                                                                  2U
#define AON_REG_OSC10M_CAL_QCH_RSVD_Msk                                                                                  (0x3FFFFFFFUL << AON_REG_OSC10M_CAL_QCH_RSVD_Pos)

/* 0xE2C    0x4000_0e2c
    5:0     R/W     DEB_MUX_SEL0                                                6'h3f
    7:6     R       RESERVED10                                                  2'b0
    13:8    R/W     DEB_MUX_SEL1                                                6'h3f
    15:14   R       RESERVED8                                                   2'b0
    21:16   R/W     DEB_MUX_SEL2                                                6'h3f
    23:22   R       RESERVED6                                                   2'b0
    29:24   R/W     DEB_MUX_SEL3                                                6'h3f
    31:30   R       RESERVED4                                                   2'b0
 */
typedef union _AON_REG_DEB_MUX_SEL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEB_MUX_SEL0: 6;
        uint32_t RESERVED10: 2;
        uint32_t DEB_MUX_SEL1: 6;
        uint32_t RESERVED8: 2;
        uint32_t DEB_MUX_SEL2: 6;
        uint32_t RESERVED6: 2;
        uint32_t DEB_MUX_SEL3: 6;
        uint32_t RESERVED4: 2;
    };
} AON_REG_DEB_MUX_SEL_TYPE;

/*0x4000_0e2c AON_REG_DEB_MUX_SEL*/
#define AON_REG_DEB_MUX_SEL_DEB_MUX_SEL0_Pos                                                                             0U
#define AON_REG_DEB_MUX_SEL_DEB_MUX_SEL0_Msk                                                                             (0x3FUL << AON_REG_DEB_MUX_SEL_DEB_MUX_SEL0_Pos)

#define AON_REG_DEB_MUX_SEL_RESERVED10_Pos                                                                               6U
#define AON_REG_DEB_MUX_SEL_RESERVED10_Msk                                                                               (0x3UL << AON_REG_DEB_MUX_SEL_RESERVED10_Pos)

#define AON_REG_DEB_MUX_SEL_DEB_MUX_SEL1_Pos                                                                             8U
#define AON_REG_DEB_MUX_SEL_DEB_MUX_SEL1_Msk                                                                             (0x3FUL << AON_REG_DEB_MUX_SEL_DEB_MUX_SEL1_Pos)

#define AON_REG_DEB_MUX_SEL_RESERVED8_Pos                                                                                14U
#define AON_REG_DEB_MUX_SEL_RESERVED8_Msk                                                                                (0x3UL << AON_REG_DEB_MUX_SEL_RESERVED8_Pos)

