rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_DEB_MUX_SEL_DEB_MUX_SEL2_Pos                                                                             16U
#define AON_REG_DEB_MUX_SEL_DEB_MUX_SEL2_Msk                                                                             (0x3FUL << AON_REG_DEB_MUX_SEL_DEB_MUX_SEL2_Pos)

#define AON_REG_DEB_MUX_SEL_RESERVED6_Pos                                                                                22U
#define AON_REG_DEB_MUX_SEL_RESERVED6_Msk                                                                                (0x3UL << AON_REG_DEB_MUX_SEL_RESERVED6_Pos)

#define AON_REG_DEB_MUX_SEL_DEB_MUX_SEL3_Pos                                                                             24U
#define AON_REG_DEB_MUX_SEL_DEB_MUX_SEL3_Msk                                                                             (0x3FUL << AON_REG_DEB_MUX_SEL_DEB_MUX_SEL3_Pos)

#define AON_REG_DEB_MUX_SEL_RESERVED4_Pos                                                                                30U
#define AON_REG_DEB_MUX_SEL_RESERVED4_Msk                                                                                (0x3UL << AON_REG_DEB_MUX_SEL_RESERVED4_Pos)

/* 0xE30    0x4000_0e30
    3:0     R       RESERVED20                                                  4'h0
    11:4    R/W     DEB_CNT_0_CNT_LIMIT                                         8'h0
    14:12   R/W     DEB_CNT_0_CLK_DIV                                           3'h0
    15      R/W     DEB_CNT_0_EN                                                1'b0
    19:16   R       RESERVED16                                                  4'h0
    27:20   R/W     DEB_CNT_1_CNT_LIMIT                                         8'h0
    30:28   R/W     DEB_CNT_1_CLK_DIV                                           3'h0
    31      R/W     DEB_CNT_1_EN                                                1'b0
 */
typedef union _AON_REG_DEB_CNT_1_0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED20: 4;
        uint32_t DEB_CNT_0_CNT_LIMIT: 8;
        uint32_t DEB_CNT_0_CLK_DIV: 3;
        uint32_t DEB_CNT_0_EN: 1;
        uint32_t RESERVED16: 4;
        uint32_t DEB_CNT_1_CNT_LIMIT: 8;
        uint32_t DEB_CNT_1_CLK_DIV: 3;
        uint32_t DEB_CNT_1_EN: 1;
    };
} AON_REG_DEB_CNT_1_0_TYPE;

/*0x4000_0e30 AON_REG_DEB_CNT_1_0*/
#define AON_REG_DEB_CNT_1_0_RESERVED20_Pos                                                                               0U
#define AON_REG_DEB_CNT_1_0_RESERVED20_Msk                                                                               (0xFUL << AON_REG_DEB_CNT_1_0_RESERVED20_Pos)

#define AON_REG_DEB_CNT_1_0_DEB_CNT_0_CNT_LIMIT_Pos                                                                      4U
#define AON_REG_DEB_CNT_1_0_DEB_CNT_0_CNT_LIMIT_Msk                                                                      (0xFFUL << AON_REG_DEB_CNT_1_0_DEB_CNT_0_CNT_LIMIT_Pos)

#define AON_REG_DEB_CNT_1_0_DEB_CNT_0_CLK_DIV_Pos                                                                        12U
#define AON_REG_DEB_CNT_1_0_DEB_CNT_0_CLK_DIV_Msk                                                                        (0x7UL << AON_REG_DEB_CNT_1_0_DEB_CNT_0_CLK_DIV_Pos)

#define AON_REG_DEB_CNT_1_0_DEB_CNT_0_EN_Pos                                                                             15U
#define AON_REG_DEB_CNT_1_0_DEB_CNT_0_EN_Msk                                                                             (0x1UL << AON_REG_DEB_CNT_1_0_DEB_CNT_0_EN_Pos)

#define AON_REG_DEB_CNT_1_0_RESERVED16_Pos                                                                               16U
#define AON_REG_DEB_CNT_1_0_RESERVED16_Msk                                                                               (0xFUL << AON_REG_DEB_CNT_1_0_RESERVED16_Pos)

#define AON_REG_DEB_CNT_1_0_DEB_CNT_1_CNT_LIMIT_Pos                                                                      20U
#define AON_REG_DEB_CNT_1_0_DEB_CNT_1_CNT_LIMIT_Msk                                                                      (0xFFUL << AON_REG_DEB_CNT_1_0_DEB_CNT_1_CNT_LIMIT_Pos)

#define AON_REG_DEB_CNT_1_0_DEB_CNT_1_CLK_DIV_Pos                                                                        28U
#define AON_REG_DEB_CNT_1_0_DEB_CNT_1_CLK_DIV_Msk                                                                        (0x7UL << AON_REG_DEB_CNT_1_0_DEB_CNT_1_CLK_DIV_Pos)

#define AON_REG_DEB_CNT_1_0_DEB_CNT_1_EN_Pos                                                                             31U
#define AON_REG_DEB_CNT_1_0_DEB_CNT_1_EN_Msk                                                                             (0x1UL << AON_REG_DEB_CNT_1_0_DEB_CNT_1_EN_Pos)

/* 0xE34    0x4000_0e34
    3:0     R       RESERVED29                                                  4'h0
    11:4    R/W     DEB_CNT_2_CNT_LIMIT                                         8'h0
    14:12   R/W     DEB_CNT_2_CLK_DIV                                           3'h0
    15      R/W     DEB_CNT_2_EN                                                1'b0
    19:16   R       RESERVED25                                                  4'h0
    27:20   R/W     DEB_CNT_3_CNT_LIMIT                                         8'h0
    30:28   R/W     DEB_CNT_3_CLK_DIV                                           3'h0
    31      R/W     DEB_CNT_3_EN                                                1'b0
 */
typedef union _AON_REG_DEB_CNT_3_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED29: 4;
        uint32_t DEB_CNT_2_CNT_LIMIT: 8;
        uint32_t DEB_CNT_2_CLK_DIV: 3;
        uint32_t DEB_CNT_2_EN: 1;
        uint32_t RESERVED25: 4;
        uint32_t DEB_CNT_3_CNT_LIMIT: 8;
        uint32_t DEB_CNT_3_CLK_DIV: 3;
        uint32_t DEB_CNT_3_EN: 1;
    };
} AON_REG_DEB_CNT_3_2_TYPE;

/*0x4000_0e34 AON_REG_DEB_CNT_3_2*/
#define AON_REG_DEB_CNT_3_2_RESERVED29_Pos                                                                               0U
#define AON_REG_DEB_CNT_3_2_RESERVED29_Msk                                                                               (0xFUL << AON_REG_DEB_CNT_3_2_RESERVED29_Pos)

#define AON_REG_DEB_CNT_3_2_DEB_CNT_2_CNT_LIMIT_Pos                                                                      4U
#define AON_REG_DEB_CNT_3_2_DEB_CNT_2_CNT_LIMIT_Msk                                                                      (0xFFUL << AON_REG_DEB_CNT_3_2_DEB_CNT_2_CNT_LIMIT_Pos)

#define AON_REG_DEB_CNT_3_2_DEB_CNT_2_CLK_DIV_Pos                                                                        12U
#define AON_REG_DEB_CNT_3_2_DEB_CNT_2_CLK_DIV_Msk                                                                        (0x7UL << AON_REG_DEB_CNT_3_2_DEB_CNT_2_CLK_DIV_Pos)

#define AON_REG_DEB_CNT_3_2_DEB_CNT_2_EN_Pos                                                                             15U
#define AON_REG_DEB_CNT_3_2_DEB_CNT_2_EN_Msk                                                                             (0x1UL << AON_REG_DEB_CNT_3_2_DEB_CNT_2_EN_Pos)

