rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_DEB_CNT_3_2_RESERVED25_Pos                                                                               16U
#define AON_REG_DEB_CNT_3_2_RESERVED25_Msk                                                                               (0xFUL << AON_REG_DEB_CNT_3_2_RESERVED25_Pos)

#define AON_REG_DEB_CNT_3_2_DEB_CNT_3_CNT_LIMIT_Pos                                                                      20U
#define AON_REG_DEB_CNT_3_2_DEB_CNT_3_CNT_LIMIT_Msk                                                                      (0xFFUL << AON_REG_DEB_CNT_3_2_DEB_CNT_3_CNT_LIMIT_Pos)

#define AON_REG_DEB_CNT_3_2_DEB_CNT_3_CLK_DIV_Pos                                                                        28U
#define AON_REG_DEB_CNT_3_2_DEB_CNT_3_CLK_DIV_Msk                                                                        (0x7UL << AON_REG_DEB_CNT_3_2_DEB_CNT_3_CLK_DIV_Pos)

#define AON_REG_DEB_CNT_3_2_DEB_CNT_3_EN_Pos                                                                             31U
#define AON_REG_DEB_CNT_3_2_DEB_CNT_3_EN_Msk                                                                             (0x1UL << AON_REG_DEB_CNT_3_2_DEB_CNT_3_EN_Pos)

/* 0xE38    0x4000_0e38
    3:0     R       RESERVED35                                                  4'h0
    11:4    R/W     DEB_CNT_4_CNT_LIMIT                                         8'h0
    14:12   R/W     DEB_CNT_4_CLK_DIV                                           3'h0
    15      R/W     DEB_CNT_4_EN                                                1'b0
    31:16   R       RESERVED31                                                  16'b0
 */
typedef union _AON_REG_DEB_CNT_4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED35: 4;
        uint32_t DEB_CNT_4_CNT_LIMIT: 8;
        uint32_t DEB_CNT_4_CLK_DIV: 3;
        uint32_t DEB_CNT_4_EN: 1;
        uint32_t RESERVED31: 16;
    };
} AON_REG_DEB_CNT_4_TYPE;

/*0x4000_0e38 AON_REG_DEB_CNT_4*/
#define AON_REG_DEB_CNT_4_RESERVED35_Pos                                                                                 0U
#define AON_REG_DEB_CNT_4_RESERVED35_Msk                                                                                 (0xFUL << AON_REG_DEB_CNT_4_RESERVED35_Pos)

#define AON_REG_DEB_CNT_4_DEB_CNT_4_CNT_LIMIT_Pos                                                                        4U
#define AON_REG_DEB_CNT_4_DEB_CNT_4_CNT_LIMIT_Msk                                                                        (0xFFUL << AON_REG_DEB_CNT_4_DEB_CNT_4_CNT_LIMIT_Pos)

#define AON_REG_DEB_CNT_4_DEB_CNT_4_CLK_DIV_Pos                                                                          12U
#define AON_REG_DEB_CNT_4_DEB_CNT_4_CLK_DIV_Msk                                                                          (0x7UL << AON_REG_DEB_CNT_4_DEB_CNT_4_CLK_DIV_Pos)

#define AON_REG_DEB_CNT_4_DEB_CNT_4_EN_Pos                                                                               15U
#define AON_REG_DEB_CNT_4_DEB_CNT_4_EN_Msk                                                                               (0x1UL << AON_REG_DEB_CNT_4_DEB_CNT_4_EN_Pos)

#define AON_REG_DEB_CNT_4_RESERVED31_Pos                                                                                 16U
#define AON_REG_DEB_CNT_4_RESERVED31_Msk                                                                                 (0xFFFFUL << AON_REG_DEB_CNT_4_RESERVED31_Pos)

/* 0xE3C    0x4000_0e3c
    0       R/W1C   DEB_CNT_0_STS                                               1'b1
    1       R/W1C   DEB_CNT_1_STS                                               1'b1
    2       R/W1C   DEB_CNT_2_STS                                               1'b1
    3       R/W1C   DEB_CNT_3_STS                                               1'b1
    4       R/W1C   DEB_CNT_4_STS                                               1'b1
    31:5    R       RESERVED37                                                  27'h0
 */
typedef union _AON_REG_DEB_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DEB_CNT_0_STS: 1;
        uint32_t DEB_CNT_1_STS: 1;
        uint32_t DEB_CNT_2_STS: 1;
        uint32_t DEB_CNT_3_STS: 1;
        uint32_t DEB_CNT_4_STS: 1;
        uint32_t RESERVED37: 27;
    };
} AON_REG_DEB_STS_TYPE;

/*0x4000_0e3c AON_REG_DEB_STS*/
#define AON_REG_DEB_STS_DEB_CNT_0_STS_Pos                                                                                0U
#define AON_REG_DEB_STS_DEB_CNT_0_STS_Msk                                                                                (0x1UL << AON_REG_DEB_STS_DEB_CNT_0_STS_Pos)

#define AON_REG_DEB_STS_DEB_CNT_1_STS_Pos                                                                                1U
#define AON_REG_DEB_STS_DEB_CNT_1_STS_Msk                                                                                (0x1UL << AON_REG_DEB_STS_DEB_CNT_1_STS_Pos)

#define AON_REG_DEB_STS_DEB_CNT_2_STS_Pos                                                                                2U
#define AON_REG_DEB_STS_DEB_CNT_2_STS_Msk                                                                                (0x1UL << AON_REG_DEB_STS_DEB_CNT_2_STS_Pos)

#define AON_REG_DEB_STS_DEB_CNT_3_STS_Pos                                                                                3U
#define AON_REG_DEB_STS_DEB_CNT_3_STS_Msk                                                                                (0x1UL << AON_REG_DEB_STS_DEB_CNT_3_STS_Pos)

#define AON_REG_DEB_STS_DEB_CNT_4_STS_Pos                                                                                4U
#define AON_REG_DEB_STS_DEB_CNT_4_STS_Msk                                                                                (0x1UL << AON_REG_DEB_STS_DEB_CNT_4_STS_Pos)

#define AON_REG_DEB_STS_RESERVED37_Pos                                                                                   5U
#define AON_REG_DEB_STS_RESERVED37_Msk                                                                                   (0x7FFFFFFUL << AON_REG_DEB_STS_RESERVED37_Pos)

/* 0xE90    0x4000_0e90
    0       R/W     RESERVED_11                                                 1'b0
    1       R/W     R_PADMUX_P0_PD_VAON_2                                       1'b0
    2       R/W     R_PADMUX_P0_PU_EN_VAON_2                                    1'b0
    3       R/W     RESERVED_10                                                 1'b0
    6:4     R/W     RESERVED_9                                                  3'd0
    7       R/W     R_PADMUX_P0_PUPDSD_AS_EN_2                                  1'b0
    8       R/W     RESERVED_8                                                  1'b0
    9       R/W     R_PADMUX_P0_PD_VAON_4                                       1'b0
    10      R/W     R_PADMUX_P0_PU_EN_VAON_4                                    1'b0
    11      R/W     RESERVED_7                                                  1'b0
    14:12   R/W     RESERVED_6                                                  3'd0
    15      R/W     R_PADMUX_P0_PUPDSD_AS_EN_4                                  1'b0
    16      R/W     RESERVED_5                                                  1'b0
    17      R/W     R_PADMUX_P0_PD_VAON_0                                       1'b0
    18      R/W     R_PADMUX_P0_PU_EN_VAON_0                                    1'b0
    19      R/W     RESERVED_4                                                  1'b0
    22:20   R/W     RESERVED_3                                                  3'd0
    23      R/W     R_PADMUX_P0_PUPDSD_AS_EN_0                                  1'b0
    24      R/W     RESERVED_2                                                  1'b0
    25      R/W     R_PADMUX_P0_PD_VAON_1                                       1'b0
    26      R/W     R_PADMUX_P0_PU_EN_VAON_1                                    1'b0
    27      R/W     RESERVED_1                                                  1'b0
    30:28   R/W     RESERVED                                                    3'd0
    31      R/W     R_PADMUX_P0_PUPDSD_AS_EN_1                                  1'b0
 */
typedef union _AON_REG_PAD_AUTO_SW_AON_REG0X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_11: 1;
        uint32_t R_PADMUX_P0_PD_VAON_2: 1;
        uint32_t R_PADMUX_P0_PU_EN_VAON_2: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 3;
        uint32_t R_PADMUX_P0_PUPDSD_AS_EN_2: 1;
        uint32_t RESERVED_8: 1;
        uint32_t R_PADMUX_P0_PD_VAON_4: 1;
        uint32_t R_PADMUX_P0_PU_EN_VAON_4: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 3;
        uint32_t R_PADMUX_P0_PUPDSD_AS_EN_4: 1;
        uint32_t RESERVED_5: 1;
        uint32_t R_PADMUX_P0_PD_VAON_0: 1;
        uint32_t R_PADMUX_P0_PU_EN_VAON_0: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 3;
        uint32_t R_PADMUX_P0_PUPDSD_AS_EN_0: 1;
        uint32_t RESERVED_2: 1;
        uint32_t R_PADMUX_P0_PD_VAON_1: 1;
        uint32_t R_PADMUX_P0_PU_EN_VAON_1: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 3;
        uint32_t R_PADMUX_P0_PUPDSD_AS_EN_1: 1;
    };
} AON_REG_PAD_AUTO_SW_AON_REG0X_TYPE;

