rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_AUTO_SW_AON_REG0X_R_PADMUX_P0_PU_EN_VAON_1_Pos                                                       26U
#define AON_REG_PAD_AUTO_SW_AON_REG0X_R_PADMUX_P0_PU_EN_VAON_1_Msk                                                       (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG0X_R_PADMUX_P0_PU_EN_VAON_1_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG0X_RESERVED_1_Pos                                                                     27U
#define AON_REG_PAD_AUTO_SW_AON_REG0X_RESERVED_1_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG0X_RESERVED_1_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG0X_RESERVED_Pos                                                                       28U
#define AON_REG_PAD_AUTO_SW_AON_REG0X_RESERVED_Msk                                                                       (0x7UL << AON_REG_PAD_AUTO_SW_AON_REG0X_RESERVED_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG0X_R_PADMUX_P0_PUPDSD_AS_EN_1_Pos                                                     31U
#define AON_REG_PAD_AUTO_SW_AON_REG0X_R_PADMUX_P0_PUPDSD_AS_EN_1_Msk                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG0X_R_PADMUX_P0_PUPDSD_AS_EN_1_Pos)

/* 0xE94    0x4000_0e94
    0       R/W     RESERVED_11                                                 1'b0
    1       R/W     R_PADMUX_P1_PD_VAON_0                                       1'b0
    2       R/W     R_PADMUX_P1_PU_EN_VAON_0                                    1'b0
    3       R/W     RESERVED_10                                                 1'b0
    6:4     R/W     RESERVED_9                                                  3'd0
    7       R/W     R_PADMUX_P1_PUPDSD_AS_EN_0                                  1'b0
    8       R/W     RESERVED_8                                                  1'b0
    9       R/W     R_PADMUX_P1_PD_VAON_1                                       1'b0
    10      R/W     R_PADMUX_P1_PU_EN_VAON_1                                    1'b0
    11      R/W     RESERVED_7                                                  1'b0
    14:12   R/W     RESERVED_6                                                  3'd0
    15      R/W     R_PADMUX_P1_PUPDSD_AS_EN_1                                  1'b0
    16      R/W     RESERVED_5                                                  1'b0
    17      R/W     R_PADMUX_P0_PD_VAON_5                                       1'b0
    18      R/W     R_PADMUX_P0_PU_EN_VAON_5                                    1'b0
    19      R/W     RESERVED_4                                                  1'b0
    22:20   R/W     RESERVED_3                                                  3'd0
    23      R/W     R_PADMUX_P0_PUPDSD_AS_EN_5                                  1'b0
    24      R/W     RESERVED_2                                                  1'b0
    25      R/W     R_PADMUX_P0_PD_VAON_6                                       1'b0
    26      R/W     R_PADMUX_P0_PU_EN_VAON_6                                    1'b0
    27      R/W     RESERVED_1                                                  1'b0
    30:28   R/W     RESERVED                                                    3'd0
    31      R/W     R_PADMUX_P0_PUPDSD_AS_EN_6                                  1'b0
 */
typedef union _AON_REG_PAD_AUTO_SW_AON_REG1X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_11: 1;
        uint32_t R_PADMUX_P1_PD_VAON_0: 1;
        uint32_t R_PADMUX_P1_PU_EN_VAON_0: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 3;
        uint32_t R_PADMUX_P1_PUPDSD_AS_EN_0: 1;
        uint32_t RESERVED_8: 1;
        uint32_t R_PADMUX_P1_PD_VAON_1: 1;
        uint32_t R_PADMUX_P1_PU_EN_VAON_1: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 3;
        uint32_t R_PADMUX_P1_PUPDSD_AS_EN_1: 1;
        uint32_t RESERVED_5: 1;
        uint32_t R_PADMUX_P0_PD_VAON_5: 1;
        uint32_t R_PADMUX_P0_PU_EN_VAON_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 3;
        uint32_t R_PADMUX_P0_PUPDSD_AS_EN_5: 1;
        uint32_t RESERVED_2: 1;
        uint32_t R_PADMUX_P0_PD_VAON_6: 1;
        uint32_t R_PADMUX_P0_PU_EN_VAON_6: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 3;
        uint32_t R_PADMUX_P0_PUPDSD_AS_EN_6: 1;
    };
} AON_REG_PAD_AUTO_SW_AON_REG1X_TYPE;

/*0x4000_0e94 AON_REG_PAD_AUTO_SW_AON_REG1X*/
#define AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_11_Pos                                                                    0U
#define AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_11_Msk                                                                    (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_11_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG1X_R_PADMUX_P1_PD_VAON_0_Pos                                                          1U
#define AON_REG_PAD_AUTO_SW_AON_REG1X_R_PADMUX_P1_PD_VAON_0_Msk                                                          (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG1X_R_PADMUX_P1_PD_VAON_0_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG1X_R_PADMUX_P1_PU_EN_VAON_0_Pos                                                       2U
#define AON_REG_PAD_AUTO_SW_AON_REG1X_R_PADMUX_P1_PU_EN_VAON_0_Msk                                                       (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG1X_R_PADMUX_P1_PU_EN_VAON_0_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_10_Pos                                                                    3U
#define AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_10_Msk                                                                    (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_10_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_9_Pos                                                                     4U
#define AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_9_Msk                                                                     (0x7UL << AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_9_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG1X_R_PADMUX_P1_PUPDSD_AS_EN_0_Pos                                                     7U
#define AON_REG_PAD_AUTO_SW_AON_REG1X_R_PADMUX_P1_PUPDSD_AS_EN_0_Msk                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG1X_R_PADMUX_P1_PUPDSD_AS_EN_0_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_8_Pos                                                                     8U
#define AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_8_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG1X_RESERVED_8_Pos)

