rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_10_Pos                                                                    3U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_10_Msk                                                                    (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_10_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_9_Pos                                                                     4U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_9_Msk                                                                     (0x7UL << AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_9_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_2_Pos                                                     7U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_2_Msk                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_2_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_8_Pos                                                                     8U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_8_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_8_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PD_VAON_3_Pos                                                          9U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PD_VAON_3_Msk                                                          (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PD_VAON_3_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PU_EN_VAON_3_Pos                                                       10U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PU_EN_VAON_3_Msk                                                       (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PU_EN_VAON_3_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_7_Pos                                                                     11U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_7_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_7_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_6_Pos                                                                     12U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_6_Msk                                                                     (0x7UL << AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_6_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_3_Pos                                                     15U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_3_Msk                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_3_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_5_Pos                                                                     16U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_5_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_5_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PD_VAON_0_Pos                                                          17U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PD_VAON_0_Msk                                                          (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PD_VAON_0_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PU_EN_VAON_0_Pos                                                       18U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PU_EN_VAON_0_Msk                                                       (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PU_EN_VAON_0_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_4_Pos                                                                     19U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_4_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_4_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_3_Pos                                                                     20U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_3_Msk                                                                     (0x7UL << AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_3_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_0_Pos                                                     23U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_0_Msk                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_0_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_2_Pos                                                                     24U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_2_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_2_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PD_VAON_1_Pos                                                          25U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PD_VAON_1_Msk                                                          (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PD_VAON_1_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PU_EN_VAON_1_Pos                                                       26U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PU_EN_VAON_1_Msk                                                       (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PU_EN_VAON_1_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_1_Pos                                                                     27U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_1_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_1_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_Pos                                                                       28U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_Msk                                                                       (0x7UL << AON_REG_PAD_AUTO_SW_AON_REG2X_RESERVED_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_1_Pos                                                     31U
#define AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_1_Msk                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG2X_R_PADMUX_P2_PUPDSD_AS_EN_1_Pos)

