rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_AUTO_SW_AON_REG7X_R_PADMUX_SPIC_SIO2_PUPDSD_AS_EN_Pos                                                31U
#define AON_REG_PAD_AUTO_SW_AON_REG7X_R_PADMUX_SPIC_SIO2_PUPDSD_AS_EN_Msk                                                (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG7X_R_PADMUX_SPIC_SIO2_PUPDSD_AS_EN_Pos)

/* 0xEB0    0x4000_0eb0
    0       R/W     R_PADMUX_P0_AON_AS_EN_0                                     1'b0
    1       R/W     R_PADMUX_P0_AON_AS_EN_1                                     1'b0
    2       R/W     R_PADMUX_P0_AON_AS_EN_2                                     1'b0
    3       R/W     R_PADMUX_P0_AON_AS_EN_3                                     1'b0
    4       R/W     R_PADMUX_P0_AON_AS_EN_4                                     1'b0
    5       R/W     R_PADMUX_P0_AON_AS_EN_5                                     1'b0
    6       R/W     R_PADMUX_P0_AON_AS_EN_6                                     1'b0
    7       R/W     R_PADMUX_P0_AON_AS_EN_7                                     1'b0
    8       R/W     R_PADMUX_P1_AON_AS_EN_0                                     1'b0
    9       R/W     R_PADMUX_P1_AON_AS_EN_1                                     1'b0
    10      R/W     R_PADMUX_P1_AON_AS_EN_6                                     1'b0
    11      R/W     R_PADMUX_P1_AON_AS_EN_7                                     1'b0
    12      R/W     R_PADMUX_P2_AON_AS_EN_0                                     1'b0
    13      R/W     R_PADMUX_P2_AON_AS_EN_1                                     1'b0
    14      R/W     R_PADMUX_P2_AON_AS_EN_2                                     1'b0
    15      R/W     R_PADMUX_P2_AON_AS_EN_3                                     1'b0
    16      R/W     R_PADMUX_P2_AON_AS_EN_4                                     1'b0
    17      R/W     R_PADMUX_P2_AON_AS_EN_5                                     1'b0
    18      R/W     R_PADMUX_P2_AON_AS_EN_6                                     1'b0
    19      R/W     R_PADMUX_P2_AON_AS_EN_7                                     1'b0
    20      R/W     R_PADMUX_P3_AON_AS_EN_0                                     1'b0
    21      R/W     R_PADMUX_P3_AON_AS_EN_1                                     1'b0
    22      R/W     R_PADMUX_P3_AON_AS_EN_2                                     1'b0
    23      R/W     R_PADMUX_P3_AON_AS_EN_3                                     1'b0
    24      R/W     R_PADMUX_P3_AON_AS_EN_4                                     1'b0
    25      R/W     R_PADMUX_P3_AON_AS_EN_5                                     1'b0
    26      R/W     R_PADMUX_P3_AON_AS_EN_6                                     1'b0
    27      R/W     R_PADMUX_P4_AON_AS_EN_0                                     1'b0
    28      R/W     R_PADMUX_P4_AON_AS_EN_1                                     1'b0
    29      R/W     R_PADMUX_P4_AON_AS_EN_2                                     1'b0
    30      R/W     R_PADMUX_P4_AON_AS_EN_3                                     1'b0
    31      R/W     R_PADMUX_MICBIAS_AON_AS_EN                                  1'b0
 */
typedef union _AON_REG_PAD_AUTO_SW_AON_REG8X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PADMUX_P0_AON_AS_EN_0: 1;
        uint32_t R_PADMUX_P0_AON_AS_EN_1: 1;
        uint32_t R_PADMUX_P0_AON_AS_EN_2: 1;
        uint32_t R_PADMUX_P0_AON_AS_EN_3: 1;
        uint32_t R_PADMUX_P0_AON_AS_EN_4: 1;
        uint32_t R_PADMUX_P0_AON_AS_EN_5: 1;
        uint32_t R_PADMUX_P0_AON_AS_EN_6: 1;
        uint32_t R_PADMUX_P0_AON_AS_EN_7: 1;
        uint32_t R_PADMUX_P1_AON_AS_EN_0: 1;
        uint32_t R_PADMUX_P1_AON_AS_EN_1: 1;
        uint32_t R_PADMUX_P1_AON_AS_EN_6: 1;
        uint32_t R_PADMUX_P1_AON_AS_EN_7: 1;
        uint32_t R_PADMUX_P2_AON_AS_EN_0: 1;
        uint32_t R_PADMUX_P2_AON_AS_EN_1: 1;
        uint32_t R_PADMUX_P2_AON_AS_EN_2: 1;
        uint32_t R_PADMUX_P2_AON_AS_EN_3: 1;
        uint32_t R_PADMUX_P2_AON_AS_EN_4: 1;
        uint32_t R_PADMUX_P2_AON_AS_EN_5: 1;
        uint32_t R_PADMUX_P2_AON_AS_EN_6: 1;
        uint32_t R_PADMUX_P2_AON_AS_EN_7: 1;
        uint32_t R_PADMUX_P3_AON_AS_EN_0: 1;
        uint32_t R_PADMUX_P3_AON_AS_EN_1: 1;
        uint32_t R_PADMUX_P3_AON_AS_EN_2: 1;
        uint32_t R_PADMUX_P3_AON_AS_EN_3: 1;
        uint32_t R_PADMUX_P3_AON_AS_EN_4: 1;
        uint32_t R_PADMUX_P3_AON_AS_EN_5: 1;
        uint32_t R_PADMUX_P3_AON_AS_EN_6: 1;
        uint32_t R_PADMUX_P4_AON_AS_EN_0: 1;
        uint32_t R_PADMUX_P4_AON_AS_EN_1: 1;
        uint32_t R_PADMUX_P4_AON_AS_EN_2: 1;
        uint32_t R_PADMUX_P4_AON_AS_EN_3: 1;
        uint32_t R_PADMUX_MICBIAS_AON_AS_EN: 1;
    };
} AON_REG_PAD_AUTO_SW_AON_REG8X_TYPE;

/*0x4000_0eb0 AON_REG_PAD_AUTO_SW_AON_REG8X*/
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_0_Pos                                                        0U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_0_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_0_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_1_Pos                                                        1U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_1_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_1_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_2_Pos                                                        2U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_2_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_2_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_3_Pos                                                        3U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_3_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_3_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_4_Pos                                                        4U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_4_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_4_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_5_Pos                                                        5U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_5_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_5_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_6_Pos                                                        6U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_6_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_6_Pos)

