rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_7_Pos                                                        7U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_7_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P0_AON_AS_EN_7_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_0_Pos                                                        8U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_0_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_0_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_1_Pos                                                        9U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_1_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_1_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_6_Pos                                                        10U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_6_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_6_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_7_Pos                                                        11U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_7_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P1_AON_AS_EN_7_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_0_Pos                                                        12U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_0_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_0_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_1_Pos                                                        13U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_1_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_1_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_2_Pos                                                        14U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_2_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_2_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_3_Pos                                                        15U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_3_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_3_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_4_Pos                                                        16U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_4_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_4_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_5_Pos                                                        17U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_5_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_5_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_6_Pos                                                        18U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_6_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_6_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_7_Pos                                                        19U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_7_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P2_AON_AS_EN_7_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_0_Pos                                                        20U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_0_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_0_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_1_Pos                                                        21U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_1_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_1_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_2_Pos                                                        22U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_2_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_2_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_3_Pos                                                        23U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_3_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_3_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_4_Pos                                                        24U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_4_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_4_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_5_Pos                                                        25U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_5_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_5_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_6_Pos                                                        26U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_6_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P3_AON_AS_EN_6_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_0_Pos                                                        27U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_0_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_0_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_1_Pos                                                        28U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_1_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_1_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_2_Pos                                                        29U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_2_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_2_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_3_Pos                                                        30U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_3_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_P4_AON_AS_EN_3_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_MICBIAS_AON_AS_EN_Pos                                                     31U
#define AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_MICBIAS_AON_AS_EN_Msk                                                     (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG8X_R_PADMUX_MICBIAS_AON_AS_EN_Pos)

/* 0xEB4    0x4000_0eb4
    0       R/W     R_PADMUX_P5_AON_AS_EN_1                                     1'b0
    1       R/W     R_PADMUX_P5_AON_AS_EN_2                                     1'b0
    2       R/W     R_PADMUX_P6_AON_AS_EN_0                                     1'b0
    3       R/W     R_PADMUX_P6_AON_AS_EN_1                                     1'b0
    4       R/W     R_PADMUX_P6_AON_AS_EN_2                                     1'b0
    5       R/W     R_PADMUX_P6_AON_AS_EN_3                                     1'b0
    6       R/W     R_PADMUX_P6_AON_AS_EN_4                                     1'b0
    7       R/W     R_PADMUX_P6_AON_AS_EN_5                                     1'b0
    8       R/W     R_PADMUX_P6_AON_AS_EN_6                                     1'b0
    9       R/W     R_PADMUX_P6_AON_AS_EN_7                                     1'b0
    10      R/W     R_PADMUX_P7_AON_AS_EN_0                                     1'b0
    11      R/W     R_PADMUX_P7_AON_AS_EN_1                                     1'b0
    12      R/W     R_PADMUX_SPIC_CSN_AON_AS_EN                                 1'b0
    13      R/W     R_PADMUX_SPIC_SCK_AON_AS_EN                                 1'b0
    14      R/W     R_PADMUX_SPIC_SIO0_AON_AS_EN                                1'b0
    15      R/W     R_PADMUX_SPIC_SIO1_AON_AS_EN                                1'b0
    16      R/W     R_PADMUX_SPIC_SIO2_AON_AS_EN                                1'b0
    17      R/W     R_PADMUX_SPIC_SIO3_AON_AS_EN                                1'b0
    31:18   R/W     RESERVED                                                    14'h0
 */
typedef union _AON_REG_PAD_AUTO_SW_AON_REG9X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t R_PADMUX_P5_AON_AS_EN_1: 1;
        uint32_t R_PADMUX_P5_AON_AS_EN_2: 1;
        uint32_t R_PADMUX_P6_AON_AS_EN_0: 1;
        uint32_t R_PADMUX_P6_AON_AS_EN_1: 1;
        uint32_t R_PADMUX_P6_AON_AS_EN_2: 1;
        uint32_t R_PADMUX_P6_AON_AS_EN_3: 1;
        uint32_t R_PADMUX_P6_AON_AS_EN_4: 1;
        uint32_t R_PADMUX_P6_AON_AS_EN_5: 1;
        uint32_t R_PADMUX_P6_AON_AS_EN_6: 1;
        uint32_t R_PADMUX_P6_AON_AS_EN_7: 1;
        uint32_t R_PADMUX_P7_AON_AS_EN_0: 1;
        uint32_t R_PADMUX_P7_AON_AS_EN_1: 1;
        uint32_t R_PADMUX_SPIC_CSN_AON_AS_EN: 1;
        uint32_t R_PADMUX_SPIC_SCK_AON_AS_EN: 1;
        uint32_t R_PADMUX_SPIC_SIO0_AON_AS_EN: 1;
        uint32_t R_PADMUX_SPIC_SIO1_AON_AS_EN: 1;
        uint32_t R_PADMUX_SPIC_SIO2_AON_AS_EN: 1;
        uint32_t R_PADMUX_SPIC_SIO3_AON_AS_EN: 1;
        uint32_t RESERVED: 14;
    };
} AON_REG_PAD_AUTO_SW_AON_REG9X_TYPE;

/*0x4000_0eb4 AON_REG_PAD_AUTO_SW_AON_REG9X*/
#define AON_REG_PAD_AUTO_SW_AON_REG9X_R_PADMUX_P5_AON_AS_EN_1_Pos                                                        0U
#define AON_REG_PAD_AUTO_SW_AON_REG9X_R_PADMUX_P5_AON_AS_EN_1_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG9X_R_PADMUX_P5_AON_AS_EN_1_Pos)

#define AON_REG_PAD_AUTO_SW_AON_REG9X_R_PADMUX_P5_AON_AS_EN_2_Pos                                                        1U
#define AON_REG_PAD_AUTO_SW_AON_REG9X_R_PADMUX_P5_AON_AS_EN_2_Msk                                                        (0x1UL << AON_REG_PAD_AUTO_SW_AON_REG9X_R_PADMUX_P5_AON_AS_EN_2_Pos)

