rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_AUTO_SW_PON_REG6X_R_PADMUX_SPIC_SCK_PU_EN_CORE_Pos                                                   18U
#define AON_REG_PAD_AUTO_SW_PON_REG6X_R_PADMUX_SPIC_SCK_PU_EN_CORE_Msk                                                   (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG6X_R_PADMUX_SPIC_SCK_PU_EN_CORE_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_4_Pos                                                                     19U
#define AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_4_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_4_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_3_Pos                                                                     20U
#define AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_3_Msk                                                                     (0xFUL << AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_3_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_2_Pos                                                                     24U
#define AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_2_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_2_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG6X_R_PADMUX_SPIC_CSN_PD_CORE_Pos                                                      25U
#define AON_REG_PAD_AUTO_SW_PON_REG6X_R_PADMUX_SPIC_CSN_PD_CORE_Msk                                                      (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG6X_R_PADMUX_SPIC_CSN_PD_CORE_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG6X_R_PADMUX_SPIC_CSN_PU_EN_CORE_Pos                                                   26U
#define AON_REG_PAD_AUTO_SW_PON_REG6X_R_PADMUX_SPIC_CSN_PU_EN_CORE_Msk                                                   (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG6X_R_PADMUX_SPIC_CSN_PU_EN_CORE_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_1_Pos                                                                     27U
#define AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_1_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_1_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_Pos                                                                       28U
#define AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_Msk                                                                       (0xFUL << AON_REG_PAD_AUTO_SW_PON_REG6X_RESERVED_Pos)

/* 0xEE0    0x4000_0ee0
    0       R/W     RESERVED_15                                                 1'b0
    1       R/W     RESERVED_14                                                 1'b0
    2       R/W     RESERVED_13                                                 1'b0
    3       R/W     RESERVED_12                                                 1'b0
    7:4     R/W     RESERVED_11                                                 4'd0
    8       R/W     RESERVED_10                                                 1'b0
    9       R/W     RESERVED_9                                                  1'b0
    10      R/W     RESERVED_8                                                  1'b0
    11      R/W     RESERVED_7                                                  1'b0
    15:12   R/W     RESERVED_6                                                  4'd0
    16      R/W     RESERVED_5                                                  1'b0
    17      R/W     R_PADMUX_SPIC_SIO3_PD_CORE                                  1'b0
    18      R/W     R_PADMUX_SPIC_SIO3_PU_EN_CORE                               1'b0
    19      R/W     RESERVED_4                                                  1'b0
    23:20   R/W     RESERVED_3                                                  4'd0
    24      R/W     RESERVED_2                                                  1'b0
    25      R/W     R_PADMUX_SPIC_SIO2_PD_CORE                                  1'b0
    26      R/W     R_PADMUX_SPIC_SIO2_PU_EN_CORE                               1'b0
    27      R/W     RESERVED_1                                                  1'b0
    31:28   R/W     RESERVED                                                    4'd0
 */
typedef union _AON_REG_PAD_AUTO_SW_PON_REG7X_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_15: 1;
        uint32_t RESERVED_14: 1;
        uint32_t RESERVED_13: 1;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 4;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 4;
        uint32_t RESERVED_5: 1;
        uint32_t R_PADMUX_SPIC_SIO3_PD_CORE: 1;
        uint32_t R_PADMUX_SPIC_SIO3_PU_EN_CORE: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 4;
        uint32_t RESERVED_2: 1;
        uint32_t R_PADMUX_SPIC_SIO2_PD_CORE: 1;
        uint32_t R_PADMUX_SPIC_SIO2_PU_EN_CORE: 1;
        uint32_t RESERVED_1: 1;
        uint32_t RESERVED: 4;
    };
} AON_REG_PAD_AUTO_SW_PON_REG7X_TYPE;

/*0x4000_0ee0 AON_REG_PAD_AUTO_SW_PON_REG7X*/
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_15_Pos                                                                    0U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_15_Msk                                                                    (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_15_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_14_Pos                                                                    1U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_14_Msk                                                                    (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_14_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_13_Pos                                                                    2U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_13_Msk                                                                    (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_13_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_12_Pos                                                                    3U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_12_Msk                                                                    (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_12_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_11_Pos                                                                    4U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_11_Msk                                                                    (0xFUL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_11_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_10_Pos                                                                    8U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_10_Msk                                                                    (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_10_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_9_Pos                                                                     9U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_9_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_9_Pos)

