rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/aon_reg.h
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_8_Pos                                                                     10U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_8_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_8_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_7_Pos                                                                     11U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_7_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_7_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_6_Pos                                                                     12U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_6_Msk                                                                     (0xFUL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_6_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_5_Pos                                                                     16U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_5_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_5_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO3_PD_CORE_Pos                                                     17U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO3_PD_CORE_Msk                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO3_PD_CORE_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO3_PU_EN_CORE_Pos                                                  18U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO3_PU_EN_CORE_Msk                                                  (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO3_PU_EN_CORE_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_4_Pos                                                                     19U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_4_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_4_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_3_Pos                                                                     20U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_3_Msk                                                                     (0xFUL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_3_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_2_Pos                                                                     24U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_2_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_2_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO2_PD_CORE_Pos                                                     25U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO2_PD_CORE_Msk                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO2_PD_CORE_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO2_PU_EN_CORE_Pos                                                  26U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO2_PU_EN_CORE_Msk                                                  (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_R_PADMUX_SPIC_SIO2_PU_EN_CORE_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_1_Pos                                                                     27U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_1_Msk                                                                     (0x1UL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_1_Pos)

#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_Pos                                                                       28U
#define AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_Msk                                                                       (0xFUL << AON_REG_PAD_AUTO_SW_PON_REG7X_RESERVED_Pos)


#define AON_REG_BASE 0x40000000

#define AON_REG_READ(Offset)\
    ((uint32_t)*((volatile uint32_t*)(AON_REG_BASE+(Offset))))

#define AON_REG_WRITE(Offset, Value)\
    ((*((volatile uint32_t*)(AON_REG_BASE + (Offset)))) = (Value))

#define AON_REG_UPDATE(Offset, Mask, Value) \
    do {\
        uint32_t temp;\
        temp = AON_REG_READ(Offset) & ~(Mask);\
        AON_REG_WRITE(Offset, (temp | ((Value) & (Mask))));\
    } while(0)

#define AON_REG_READ_BITFIELD(Offset, Bitfield)                   \
    (((Offset##_TYPE)AON_REG_READ(Offset)).Bitfield)

#define AON_REG_WRITE_BITFIELD(Offset, Bitfield, Value)           \
    do {                                                        \
        Offset##_TYPE temp = {.d32 = AON_REG_READ(Offset)};       \
        temp.Bitfield = Value;                                         \
        AON_REG_WRITE(Offset, temp.d32);                          \
    } while(0)

#endif //#define AON_REG_H
